In [1]:
import openpyxl

In [3]:
import pandas as pd
import numpy as np
import sqlalchemy
import os
import glob
import locale
# import xlrd
# import xlsxwriter
# import openpyxl
# import psycopg2
# import urllib
# import openpyxl
import time
import re
import warnings

from functools import reduce
from tqdm import tqdm
from datetime import datetime
from openpyxl.styles import Font, Color, Alignment, Border, Side, NamedStyle, PatternFill
from openpyxl.worksheet.dimensions import ColumnDimension
from openpyxl import  load_workbook
from openpyxl.utils.cell import get_column_letter
from openpyxl.utils.dataframe import dataframe_to_rows
from openpyxl.styles import Font, Color, Alignment, Border, Side, NamedStyle, PatternFill
from openpyxl.worksheet.dimensions import ColumnDimension
from urllib.parse import quote
# from psycopg2.extensions import AsIs
from dateutil.relativedelta import relativedelta
from IPython.display import Markdown as md
from sqlalchemy import create_engine
from sqlalchemy.exc import OperationalError
from datetime import datetime, timedelta

Postgres DB Connection

In [4]:
try:
    pengine = create_engine('postgresql+psycopg2://postgres:postgres@172.16.22.15:5432/postgres')
    conn = psycopg2.connect(database = 'postgres', user = 'postgres', password = 'postgres',host = "172.16.22.15",port= 5432)
    conn.autocommit = True
    cursor = conn.cursor()
    db_conn=pengine.connect()
    print("\n Postgres database connected succesfully")
except:
    print("Unable to create the Postgres DB connection")

Unable to create the Postgres DB connection

In [5]:
def sql_exec(sql,dengine):
    startime=datetime.now()
    print("Time now: ",startime)
    print("Executing Query...")
    dconn=dengine.connect()
    df=pd.read_sql_query(sql,pengine)
    endtime=datetime.now()
    dconn.close()
    timetaken=relativedelta(endtime,startime)
    print('Time Taken: ',timetaken)
    return df

Fincore_Bridge_DB 2.0 Connection

In [6]:
try:
    FINnet_2_engine=sqlalchemy.create_engine('mssql+pyodbc://SAL_User01:%s@172.16.22.25:1433/FINCORE_BRIDGE_DB?driver=ODBC+Driver+17+for+SQL+Server' % quote('Sal@123'))
except:
    print("Unable to create the Fincore Bridge DB connection")

In [7]:
try:
    FINnet_2_enginee=sqlalchemy.create_engine('mssql+pyodbc://SAL_User01:%s@172.16.22.25:1433/FINCORE_DB?driver=ODBC+Driver+17+for+SQL+Server' % quote('Sal@123'))
except:
    print("Unable to create the Fincore Bridge DB connection")

Fincore_DATAHUB 2.0 Connection

In [8]:
try:
    DATAHUB_engine=sqlalchemy.create_engine('mssql+pyodbc://SAL_User01:%s@172.16.22.25:1433/DATAHUB_DB?driver=ODBC+Driver+17+for+SQL+Server' % quote('Sal@123'))
except:
     print("Unable to create the DATAHUB DB connection")

Finnet 1.0 DB Connection

In [9]:
try:
    FINnet_1_engine1=sqlalchemy.create_engine('mssql+pyodbc://SAL_User01:%s@172.16.22.25:1433/Finnet_1.0?driver=ODBC+Driver+17+for+SQL+Server' % quote('Sal@123'))
except:
      print("Unable to create the Finnet_1.0 DB connection")

In [10]:
month_dict = {
    '01': "January",
    '02': "February",
    '03': "March",
    '04': "April",
    '05': "May",
    '06': "June",
    '07': "July",
    '08': "August",
    '09': "September",
    '10': "October",
    '11': "November",
    '12': "December"
}

In [11]:
#For adjusting the year :

def adjustmonth_(month):
    if month%100 == 0:
        first_two_month = month//100
        month = (first_two_month-1)*100+12
    return month

In [12]:
# #For adding the commas in number :

# def comma(value):
#     if pd.api.types.is_integer_dtype(value):
#         locale.setlocale(locale.LC_NUMERIC,'en-IN')
#         return value.apply(lambda x : locale.format("%d",value,grouping=True))
#     else:
#         return value

In [13]:
# #### Function for Decial place 2 

# def round_v(value):
#     rounded = round(value,2) 
#     print(rounded)

In [14]:
# #Defining batch range for finnet2.0`
# #Give range in format from initial month to last month i.e last month is the curret month 
# #and initial month is the last month upto which you want the report


# Batchid_range =[str(x) for x in input('Enter Batchid range in YYYYMMDD format for 2.0 = ').split(',')]
# print(Batchid_range)
# Batchid_range_ = ','.join(Batchid_range)
# Batchid_range_ = Batchid_range_.replace(',',' and ')
# print("Your Batchid Range is ",Batchid_range_)

In [15]:
#Defining batch range for finnet2.0`
#Give range in format from initial month to last month i.e last month is the curret month 
#and initial month is the last month upto which you want the report


Batchid_range = input('Enter Batchid range in YYYYMMDD format for 2.0 = ')
print(Batchid_range)
Batchid_range_ = Batchid_range
print("Your Batchid Range is ",Batchid_range_)


# EX - 20231231 or 20231201

Enter Batchid range in YYYYMMDD format for 2.0 = 202404
202404
Your Batchid Range is  202404

In [16]:
Current_Year=Batchid_range_[2:4]
Current_Year

'24'

In [17]:
#Defining month for finnet2.0

Current_Year=Batchid_range_[2:4]


Current_month_init=Batchid_range_[2:6]

Current_month_init=int(Current_month_init,10)
Current_month_init = adjustmonth_(Current_month_init)
Current_month_init_str = Current_month_init.__str__()[2:]
Current_month_init_name = month_dict[Current_month_init_str]
print("Current  Month Name",Current_month_init_name)
print("Current  Month ",Current_month_init)



Previous_month_init=Current_month_init - 1
Previous_month_init = adjustmonth_(Previous_month_init)
Previous_month_init_str = Previous_month_init.__str__()[2:]
Previous_month_init_name = month_dict[Previous_month_init_str]
print("Previous  Month Name",Previous_month_init_name)
print("Previous Month ",Previous_month_init)

Previous_month1_init= Previous_month_init - 1
Previous_month1_init = adjustmonth_(Previous_month1_init)
Previous_month_init_str = Previous_month1_init.__str__()[2:]
Previous_month1_init_name = month_dict[Previous_month_init_str]
print("Previous  Month Name",Previous_month1_init_name)
print("Previous Month1",Previous_month1_init)

Previous_month2_init=Previous_month1_init - 1
Previous_month2_init = adjustmonth_(Previous_month2_init)
Previous_month2_init_str = Previous_month2_init.__str__()[2:]
Previous_month2_init_name = month_dict[Previous_month2_init_str]
print("Previous  Month Name",Previous_month2_init_name)
print("Previous Month2",Previous_month2_init)

Current  Month Name April
Current  Month  2404
Previous  Month Name March
Previous Month  2403
Previous  Month Name February
Previous Month1 2402
Previous  Month Name January
Previous Month2 2401

In [18]:
# Parameter - 2 - Total report filled across all RE

In [19]:
query2_o = f'''
with cte1 as (
select count(distinct cp.Report_Id) report_count, Report_Type, 
SUBSTRING(cast(fiu_Batch_ID as nvarchar ),3,4) as yr_mon
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 
and Report_Type in  ('CTR','STR','CCR','NTR','CBWTR','BDU')
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31

group by Report_Type,SUBSTRING(cast(Fiu_Batch_Id as nvarchar),3,4)

 ),

 cte2 as (select yr_mon, Report_Type, 

case when Report_Type='STR' then report_count  else 0 end as STR,                     
case when Report_Type='CTR' then report_count  else 0 end as CTR,                     
case when Report_Type='NTR' then report_count  else 0 end as NTR,                     
case when Report_Type='CBWTR' then report_count  else 0 end as EFT,                    
case when Report_Type='CCR' then report_count  else 0 end as CCR,  
case when Report_Type='BDU' then report_count  else 0 end as BDU,
--case when Report_Type is null then report_count  else 0 end as NULLREPORT,
report_count as total_report_count
from cte1)
select yr_mon,  sum(STR) STR,sum(CTR) CTR,sum(NTR) NTR,sum(EFT) EFT,sum(CCR) CCR,sum(BDU) BDU ,sum(total_report_count)total_report_count 
from cte2 c2 group by yr_mon 

'''
print(query2_o)

with cte1 as (
select count(distinct cp.Report_Id) report_count, Report_Type,
SUBSTRING(cast(fiu_Batch_ID as nvarchar ),3,4) as yr_mon
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
and Report_Type in  ('CTR','STR','CCR','NTR','CBWTR','BDU')
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240401 and 20240431

group by Report_Type,SUBSTRING(cast(Fiu_Batch_Id as nvarchar),3,4)

 ),

 cte2 as (select yr_mon, Report_Type,

case when Report_Type='STR' then report_count  else 0 end as STR,
case when Report_Type='CTR' then report_count  else 0 end as CTR,
case when Report_Type='NTR' then report_count  else 0 end as NTR,
case when Report_Type='CBWTR' then report_count  else 0 end as EFT,
case when Report_Type='CCR' then report_count  else 0 end as CCR,
case when Report_Type='BDU' then report_count  else 0 end as BDU,
--case when Report_Type is null then report_count  else 0 end as NULLREPORT,
report_count as total_report_count
from cte1)
select yr_mon,  sum(STR) STR,sum(CTR) CTR,sum(NTR) NTR,sum(EFT) EFT,sum(CCR) CCR,sum(BDU) BDU ,sum(total_report_count)total_report_count
from cte2 c2 group by yr_mon

In [20]:
Finnet2_o = pd.read_sql(query2_o,FINnet_2_engine)
print('Query Executed successfully')
data_2o = pd.DataFrame(Finnet2_o)
data_2o.columns = data_2o.columns.str.upper()
display("Shape : ",data_2o.shape)
display(data_2o.head(5))

Query Executed successfully

'Shape : '

(1, 8)

  YR_MON    STR      CTR    NTR      EFT    CCR    BDU  TOTAL_REPORT_COUNT
0   2404  23170  1286341  77711  1174088  25606  79381             2666297

In [21]:
dfP2 = data_2o
# dfP2 = dfP2.apply(comma)
display(dfP2)

  YR_MON    STR      CTR    NTR      EFT    CCR    BDU  TOTAL_REPORT_COUNT
0   2404  23170  1286341  77711  1174088  25606  79381             2666297

In [22]:
dfP2['YR_MON'] = f'''{Current_month_init_name}''' +' '+ Batchid_range_[0:4]
dfP2

,YR_MON,STR,CTR,NTR,EFT,CCR,BDU,TOTAL_REPORT_COUNT
0,April 2024,23170,1286341,77711,1174088,25606,79381,2666297

In [22]:
# dfP2 = dfP2.reset_index()
# dfP2['index'] = dfP2['index']+1
# dfP2 = dfP2.rename(columns={'index':'sl. no.'})

In [23]:
# dfP2

In [24]:
dfP2.index = dfP2.index + 1
dfP2.head(5)

,YR_MON,STR,CTR,NTR,EFT,CCR,BDU,TOTAL_REPORT_COUNT
1,March 2024,23056,1574543,55865,603154,15201,209456,2481275

In [25]:
dfP2.reset_index(drop=True, inplace=True)

In [26]:
Total_reports_count = (dfP2['TOTAL_REPORT_COUNT'])/100000
Total_reports_count_R = round(Total_reports_count,2)
print(Total_reports_count_R)
STR_COUNT = (dfP2['STR'])/100000
STR_COUNT_R = round(STR_COUNT,2)
print(STR_COUNT_R)
CTR_COUNT = (dfP2['CTR'])/100000
CTR_COUNT_R = round(CTR_COUNT,2)
print(CTR_COUNT_R)
NTR_COUNT = (dfP2['NTR'])/100000
NTR_COUNT_R = round(NTR_COUNT,2)
print(NTR_COUNT_R)
EFT_COUNT = (dfP2['EFT'])/100000
EFT_COUNT_R = round(EFT_COUNT,2)
print(NTR_COUNT_R)
CCR_COUNT = (dfP2['CCR'])/100000
CCR_COUNT_R = round(CCR_COUNT,2)
print(CCR_COUNT_R)
BDU_COUNT = (dfP2['BDU'])/100000
BDU_COUNT_R = round(BDU_COUNT,2)
print(BDU_COUNT_R)

0    24.81
Name: TOTAL_REPORT_COUNT, dtype: float64
0    0.23
Name: STR, dtype: float64
0    15.75
Name: CTR, dtype: float64
0    0.56
Name: NTR, dtype: float64
0    0.56
Name: NTR, dtype: float64
0    0.15
Name: CCR, dtype: float64
0    2.09
Name: BDU, dtype: float64

In [27]:
# P2 = f'''A total of {Total_reports_count_R[0]} lakhs of reports were filed during {Current_month_init_name} 2024, including STR-{STR_COUNT_R[0]} Lakhs, CTR-{CTR_COUNT_R[0]} Lakhs, NTR-{NTR_COUNT_R[0]} Lakhs, EFT-{EFT_COUNT_R[0]} Lakhs, CCR-{CCR_COUNT_R[0]} Lakhs, and BDU-{BDU_COUNT_R[0]} Lakhs'''
# print(P2)

In [28]:
# dfP2.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\monthly_total_report_filledP2.csv',index=False )

In [29]:
# Parameter 4 - RE Category Wise reporting

In [30]:
query2_0 = f'''

with cte1 as ( select Report_Type, trim(upper([description])) Cat_Description,count(distinct cp.Report_Id) report_count 
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
left join [DATAHUB_DB].[FIUMetaHub].[finnet_LineOfBusiness] LOB ON LOB.name = cp.Line_Of_Business 
where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 
and Report_Type in ('CTR','STR','CCR','NTR','CBWTR','BDU')
--and CAST(Submission_Timestamp AS DATE) between '2023-09-01' and '2023-09-30'
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
group by trim(upper([description])),lob.[name],  Report_Type),


cte2 as (select Cat_Description, Report_Type, 

case when  Report_Type='STR' then report_count  else 0 end as STR,                     
case when  Report_Type='CTR' then report_count  else 0 end as CTR,                     
case when  Report_Type='NTR' then report_count  else 0 end as NTR,                     
case when  Report_Type='CBWTR' then report_count  else 0 end as EFT,                    
case when  Report_Type='CCR' then report_count  else 0 end as CCR,  
case when  Report_Type='BDU' then report_count  else 0 end as BDU,
report_count as total_report_count
from cte1)

select Cat_Description ,sum(STR) STR,sum(CTR) CTR,sum(NTR) NTR,sum(EFT) EFT,sum(CCR) CCR,sum(BDU) BDU , sum(total_report_count)total_report_count 
from cte2 c2 group by  Cat_Description order by total_report_count desc
'''

print(query2_0)

with cte1 as ( select Report_Type, trim(upper([description])) Cat_Description,count(distinct cp.Report_Id) report_count
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
left join [DATAHUB_DB].[FIUMetaHub].[finnet_LineOfBusiness] LOB ON LOB.name = cp.Line_Of_Business
where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
and Report_Type in ('CTR','STR','CCR','NTR','CBWTR','BDU')
--and CAST(Submission_Timestamp AS DATE) between '2023-09-01' and '2023-09-30'
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
group by trim(upper([description])),lob.[name],  Report_Type),


cte2 as (select Cat_Description, Report_Type,

case when  Report_Type='STR' then report_count  else 0 end as STR,
case when  Report_Type='CTR' then report_count  else 0 end as CTR,
case when  Report_Type='NTR' then report_count  else 0 end as NTR,
case when  Report_Type='CBWTR' then report_count  else 0 end as EFT,
case when  Report_Type='CCR' then report_count  else 0 end as CCR,
case when  Report_Type='BDU' then report_count  else 0 end as BDU,
report_count as total_report_count
from cte1)

select Cat_Description ,sum(STR) STR,sum(CTR) CTR,sum(NTR) NTR,sum(EFT) EFT,sum(CCR) CCR,sum(BDU) BDU , sum(total_report_count)total_report_count
from cte2 c2 group by  Cat_Description order by total_report_count desc

In [31]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
data_2o = pd.DataFrame(Finnet2_o)
data_2o.columns = data_2o.columns.str.upper()
display("Shape : ",data_2o.shape)
display(data_2o.head(5))

Query Executed successfully

'Shape : '

(41, 8)

,CAT_DESCRIPTION,STR,CTR,NTR,EFT,CCR,BDU,TOTAL_REPORT_COUNT
0,PRIVATE SECTOR BANKS,10122,1086840,37400,502491,13036,0,1649889
1,PUBLIC SECTOR BANKS,6379,388351,16174,54065,1537,0,466506
2,CARD SYSTEM OPERATORS,290,50,0,0,0,209456,209796
3,FOREIGN BANKS,888,2598,368,43762,43,0,47659
4,REGIONAL RURAL BANKS,14,30653,100,0,0,0,30767

In [32]:
dfP4 = data_2o
# dfP4 = dfP4.apply(comma)
display(dfP4)
dfP4 = dfP4.reset_index()
dfP4['index'] = dfP4['index']+1
dfP4 = dfP4.rename(columns={'index':'sl. no.'})

,CAT_DESCRIPTION,STR,CTR,NTR,EFT,CCR,BDU,TOTAL_REPORT_COUNT
0,PRIVATE SECTOR BANKS,10122,1086840,37400,502491,13036,0,1649889
1,PUBLIC SECTOR BANKS,6379,388351,16174,54065,1537,0,466506
2,CARD SYSTEM OPERATORS,290,50,0,0,0,209456,209796
3,FOREIGN BANKS,888,2598,368,43762,43,0,47659
4,REGIONAL RURAL BANKS,14,30653,100,0,0,0,30767
5,NON SCHEDULED URBAN COOPERATIVE BANKS,477,24346,158,1,43,0,25025
6,SCHEDULED URBAN COOPERATIVE BANKS,1007,10494,939,1557,253,0,14250
7,DISTRICT COOPERATIVE BANKS,0,11293,73,0,0,0,11366
8,OTHER BANKING COMPANY,1297,9385,363,12,120,0,11177
9,DEPARTMENT OF POSTS,2,6121,0,0,0,0,6123
10,STATE COOPERATIVE BANKS,6,2169,36,50,0,0,2261
11,AUTHORIZED DEALER CATEGORY II,6,143,0,1189,0,0,1338
12,PAYMENT BANKS,296,956,0,0,0,0,1252
13,NBFC NOT ACCEPTING DEPOSITS,314,641,0,26,0,0,981
14,SHARE BROKERS,608,0,0,0,0,0,608
15,LIFE INSURANCE COMPANIES,380,4,0,0,0,0,384
16,MONEY TRANSFER SERVICE PRINCIPAL,341,1,0,0,0,0,342
17,NBFC ACCEPTING DEPOSITS,60,221,12,0,0,0,293
18,LOCAL AREA BANKS,3,242,1,0,0,0,246
19,MUTUAL FUND COMPANY/COLLECTIVE INVESTMENT SCHEMES,0,0,240,0,0,0,240
20,PAYMENT GATEWAY,172,0,0,0,0,0,172
21,REGULATOR,0,0,0,0,144,0,144
22,VASP,134,0,0,0,0,0,134
23,WALLET,94,0,0,0,0,0,94
24,DEPOSITORY PARTICIPANTS,76,0,1,0,0,0,77
25,MULTI STATE COOPERATIVE SOCIETY,0,28,0,0,0,0,28
26,RESERVE BANK OF INDIA (FOR CCR PURPOSES),0,0,0,0,24,0,24
27,HOUSING FINANCE COMPANIES,17,0,0,0,0,0,17
28,RECOGNISED STOCK EXCHANGE,15,0,0,0,0,0,15
29,OTHER INTERMEDIARIES,11,0,0,0,0,0,11
30,DEPOSITORIES,10,0,0,0,0,0,10
31,COMMODITY EXCHANGE,9,0,0,0,0,0,9
32,OTHERS,9,0,0,0,0,0,9
33,MONEY TRANSFER SERVICE AGENT,8,1,0,0,0,0,9
34,ONLINE PAYMENT GATEWAY SERVICE PROVIDER (OPGSP),8,0,0,0,0,0,8
35,OTHER FINANCIAL INSTITUTIONS,0,3,0,0,0,0,3
36,FULL FLEDGED MONEY CHANGER (FFMC),0,3,0,0,0,0,3
37,REAL ESTATE,2,0,0,0,0,0,2
38,TCSPS/DEBENTURE TRUSTEES,1,0,0,0,0,0,1
39,ALTERNATIVE INVESTMENT FUND,0,0,0,1,0,0,1
40,NON LIFE INSURANCE COMPANIES,0,0,0,0,1,0,1

In [33]:
dfP4.index = dfP4.index +1
dfP4.head(5)

,sl. no.,CAT_DESCRIPTION,STR,CTR,NTR,EFT,CCR,BDU,TOTAL_REPORT_COUNT
1,1,PRIVATE SECTOR BANKS,10122,1086840,37400,502491,13036,0,1649889
2,2,PUBLIC SECTOR BANKS,6379,388351,16174,54065,1537,0,466506
3,3,CARD SYSTEM OPERATORS,290,50,0,0,0,209456,209796
4,4,FOREIGN BANKS,888,2598,368,43762,43,0,47659
5,5,REGIONAL RURAL BANKS,14,30653,100,0,0,0,30767

In [34]:
# dfP4.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\monthly_total_report_Category_wise_re_4P.csv',index=True)

In [35]:
# Parameter - 6 - NTR with Debits

In [36]:
query2_0 = f'''

with cte1 as( select  distinct cp.Report_Id ,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31 
and Report_Type = 'NTR' ),


cte2 as (SELECT c1.Report_Id,FIUREID,RE_NAME, [transactionType]FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne]ts1 join cte1 c1 on ts1.reportId=c1.Report_Id where [transactionType]='Debit'
  union 
  SELECT c1.Report_Id, FIUREID,RE_NAME, [transactionType]FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo] ts2 join cte1 c1 on ts2.reportId=c1.Report_Id where [transactionType]='Debit'
  union 
  SELECT c1.Report_Id, FIUREID,RE_NAME, [transactionType]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree] ts3 join cte1 c1 on ts3.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union 
  SELECT c1.Report_Id, FIUREID,RE_NAME,[transactionType]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour] ts4 join cte1 c1 on ts4.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union 
  SELECT c1.Report_Id, FIUREID,RE_NAME,[transactionType]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive] ts5 join cte1 c1 on ts5.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union 
  SELECT c1.Report_Id, FIUREID,RE_NAME,[transactionType]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven] ts7 join cte1 c1 on ts7.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union 
  SELECT c1.Report_Id,FIUREID,RE_NAME,[transactionType]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine] ts9 join cte1 c1 on ts9.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union 
  SELECT c1.Report_Id, FIUREID,RE_NAME,[transactionType]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts11 join cte1 c1 on ts11.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union 
  SELECT c1.Report_Id, FIUREID,RE_NAME,[depositWithdrawal]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] tc1 join cte1 c1 on tc1.reportId=c1.Report_Id
  where [depositWithdrawal]='Withdrawal'
  union 
  SELECT c1.Report_Id, FIUREID,RE_NAME,[depositeWithdrawl]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] tc2 join cte1 c1 on tc2.reportId=c1.Report_Id
  where [depositeWithdrawl] ='Withdrawal'
  union 
  SELECT  c1.Report_Id, FIUREID,RE_NAME,[relationshipFlag]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP] ts14 join cte1 c1 on ts14.reportId=c1.Report_Id
  where [relationshipFlag] ='Sender'
  
  )
  
  select  FIUREID,RE_NAME,
 
  count(Report_Id ) Non_receipts
  from cte2
  group by FIUREID ,RE_NAME order by Non_receipts desc

'''

print(query2_0)

with cte1 as( select  distinct cp.Report_Id ,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and Report_Type = 'NTR' ),


cte2 as (SELECT c1.Report_Id,FIUREID,RE_NAME, [transactionType]FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne]ts1 join cte1 c1 on ts1.reportId=c1.Report_Id where [transactionType]='Debit'
  union
  SELECT c1.Report_Id, FIUREID,RE_NAME, [transactionType]FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo] ts2 join cte1 c1 on ts2.reportId=c1.Report_Id where [transactionType]='Debit'
  union
  SELECT c1.Report_Id, FIUREID,RE_NAME, [transactionType]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree] ts3 join cte1 c1 on ts3.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union
  SELECT c1.Report_Id, FIUREID,RE_NAME,[transactionType]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour] ts4 join cte1 c1 on ts4.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union
  SELECT c1.Report_Id, FIUREID,RE_NAME,[transactionType]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive] ts5 join cte1 c1 on ts5.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union
  SELECT c1.Report_Id, FIUREID,RE_NAME,[transactionType]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven] ts7 join cte1 c1 on ts7.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union
  SELECT c1.Report_Id,FIUREID,RE_NAME,[transactionType]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine] ts9 join cte1 c1 on ts9.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union
  SELECT c1.Report_Id, FIUREID,RE_NAME,[transactionType]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts11 join cte1 c1 on ts11.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union
  SELECT c1.Report_Id, FIUREID,RE_NAME,[depositWithdrawal]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] tc1 join cte1 c1 on tc1.reportId=c1.Report_Id
  where [depositWithdrawal]='Withdrawal'
  union
  SELECT c1.Report_Id, FIUREID,RE_NAME,[depositeWithdrawl]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] tc2 join cte1 c1 on tc2.reportId=c1.Report_Id
  where [depositeWithdrawl] ='Withdrawal'
  union
  SELECT  c1.Report_Id, FIUREID,RE_NAME,[relationshipFlag]
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP] ts14 join cte1 c1 on ts14.reportId=c1.Report_Id
  where [relationshipFlag] ='Sender'

  )

  select  FIUREID,RE_NAME,

  count(Report_Id ) Non_receipts
  from cte2
  group by FIUREID ,RE_NAME order by Non_receipts desc

In [37]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
data_2o = pd.DataFrame(Finnet2_o)
data_2o.columns = data_2o.columns.str.upper()
display("Shape : ",data_2o.shape)
display(data_2o.head(5))

Query Executed successfully

'Shape : '

(4, 3)

      FIUREID                                            RE_NAME  NON_RECEIPTS
0  BAUCB01044                     RAYAT SEVAK CO-OP BANK LIMITED            13
1  FINBF00478                            SHRIRAM FINANCE LIMITED             1
2  BAUCB01230  THE BABASAHEB DESHMUKH SAHAKARI BANK LIMITED A...             1
3  BASCO00012  THE HIMACHAL PRADESH STATE CO-OPERATIVE BANK L...             1

In [38]:
dfP6 = data_2o
display(dfP6)
dfP6 = dfP6.reset_index()
dfP6['index'] = dfP6['index']+1
dfP6 = dfP6.rename(columns={'index':'sl. no.'})

      FIUREID                                            RE_NAME  NON_RECEIPTS
0  BAUCB01044                     RAYAT SEVAK CO-OP BANK LIMITED            13
1  FINBF00478                            SHRIRAM FINANCE LIMITED             1
2  BAUCB01230  THE BABASAHEB DESHMUKH SAHAKARI BANK LIMITED A...             1
3  BASCO00012  THE HIMACHAL PRADESH STATE CO-OPERATIVE BANK L...             1

In [39]:
dfP6.index = dfP6.index + 1
dfP6.head(5)

,sl. no.,FIUREID,RE_NAME,NON_RECEIPTS
1,1,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,13
2,2,FINBF00478,SHRIRAM FINANCE LIMITED,1
3,3,BAUCB01230,THE BABASAHEB DESHMUKH SAHAKARI BANK LIMITED A...,1
4,4,BASCO00012,THE HIMACHAL PRADESH STATE CO-OPERATIVE BANK L...,1

In [40]:
NTR_WTH_WITHDRAWL_Total_REPORTS = (dfP6['NON_RECEIPTS'].sum())
print(NTR_WTH_WITHDRAWL_Total_REPORTS)

Withdrawl_percentage = (NTR_WTH_WITHDRAWL_Total_REPORTS / (dfP2['NTR']) ) * 100
Withdrawl_percentage = round(Withdrawl_percentage,2)
print(Withdrawl_percentage)

16
0    0.03
Name: NTR, dtype: float64

In [41]:
# dfP6.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\monthly_NTR_with_debit_6P.csv',index=True)

In [42]:
#parameter 5 - RE Filling NTR Below Threshold Value

In [43]:
query2_0 = f'''
with cte1 as( select  distinct cp.Report_Id , coalesce([oldREId],[newREId]) as fiureid,trim(upper([name])) as re_name
 from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
and Report_Type = 'NTR' and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31 
),

cte2 as (
select Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[amount])as amount from(
select c1.Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[amount])as amount FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne] ts1 join cte1 c1 on ts1.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[amount]) <1000000 
  union 
  SELECT  c1.Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[amount])as amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo] ts2 join cte1 c1 on ts2.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union 
  SELECT  c1.Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[transactionAmount]) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree] ts3 join cte1 c1 on ts3.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmount]) <1000000
  union 
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmount]) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour] ts4 join cte1 c1 on ts4.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[transactionAmount]) <1000000
  union 
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount])  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive] ts5 join cte1 c1 on ts5.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union 
  SELECT c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount]) FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven] ts7 join cte1 c1 on ts7.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[amount]) <1000000
  union 
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount])  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine] ts9 join cte1 c1 on ts9.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union 
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),amountInInr)  amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts11 join cte1 c1 on ts11.reportId=c1.Report_Id where  try_convert(DECIMAL(18,2),amountInInr) <1000000
  union 
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmount]) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] tc1 join cte1 c1 on tc1.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmount])  <1000000
  union 
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount]) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] tc2 join cte1 c1 on tc2.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union 
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),amount) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSix] tc6 join cte1 c1 on tc6.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[Amount])  <1000000
  union 
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmmount]) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP] ts14 join cte1 c1 on ts14.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmmount])  <1000000
  union 
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmount]) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_GenReporting] gt1 join cte1 c1 on gt1.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmount])  <1000000




)z
)

  
  select FIUREID,RE_NAME,
  --count( id_)id_, 
  count(distinct cte2.Report_Id ) below_thresholds 
  from cte2 
  group by FIUREID ,RE_NAME order by below_thresholds desc

'''

print(query2_0)

with cte1 as( select  distinct cp.Report_Id , coalesce([oldREId],[newREId]) as fiureid,trim(upper([name])) as re_name
 from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
and Report_Type = 'NTR' and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
),

cte2 as (
select Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[amount])as amount from(
select c1.Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[amount])as amount FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne] ts1 join cte1 c1 on ts1.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[amount]) <1000000
  union
  SELECT  c1.Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[amount])as amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo] ts2 join cte1 c1 on ts2.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union
  SELECT  c1.Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[transactionAmount]) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree] ts3 join cte1 c1 on ts3.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmount]) <1000000
  union
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmount]) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour] ts4 join cte1 c1 on ts4.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[transactionAmount]) <1000000
  union
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount])  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive] ts5 join cte1 c1 on ts5.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union
  SELECT c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount]) FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven] ts7 join cte1 c1 on ts7.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[amount]) <1000000
  union
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount])  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine] ts9 join cte1 c1 on ts9.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),amountInInr)  amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts11 join cte1 c1 on ts11.reportId=c1.Report_Id where  try_convert(DECIMAL(18,2),amountInInr) <1000000
  union
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmount]) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] tc1 join cte1 c1 on tc1.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmount])  <1000000
  union
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount]) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] tc2 join cte1 c1 on tc2.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),amount) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSix] tc6 join cte1 c1 on tc6.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[Amount])  <1000000
  union
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmmount]) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP] ts14 join cte1 c1 on ts14.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmmount])  <1000000
  union
  SELECT  c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmount]) amount  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_GenReporting] gt1 join cte1 c1 on gt1.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmount])  <1000000




)z
)


  select FIUREID,RE_NAME,
  --count( id_)id_,
  count(distinct cte2.Report_Id ) below_thresholds
  from cte2
  group by FIUREID ,RE_NAME order by below_thresholds desc

In [44]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
data_2o = pd.DataFrame(Finnet2_o)
data_2o.columns = data_2o.columns.str.upper()
display("Shape : ",data_2o.shape)
display(data_2o.head(5))

Query Executed successfully

'Shape : '

(8, 3)

,FIUREID,RE_NAME,BELOW_THRESHOLDS
0,BASCB00126,EQUITAS SMALL FINANCE BANK LIMITED,33
1,BASCO00012,THE HIMACHAL PRADESH STATE CO-OPERATIVE BANK L...,18
2,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,16
3,BADCB00002,THE AHMEDABAD DISTRICT CO-OPERATIVE BANK LIMITED,8
4,BASCB00103,CREDIT SUISSE AG,2

In [45]:
dfP5 = data_2o
display(dfP5)
dfP5 = dfP5.reset_index()
dfP5['index'] = dfP5['index']+1
dfP5 = dfP5.rename(columns={'index':'sl. no.'})

,FIUREID,RE_NAME,BELOW_THRESHOLDS
0,BASCB00126,EQUITAS SMALL FINANCE BANK LIMITED,33
1,BASCO00012,THE HIMACHAL PRADESH STATE CO-OPERATIVE BANK L...,18
2,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,16
3,BADCB00002,THE AHMEDABAD DISTRICT CO-OPERATIVE BANK LIMITED,8
4,BASCB00103,CREDIT SUISSE AG,2
5,FINBF00478,SHRIRAM FINANCE LIMITED,2
6,BA00019908,SHIKSHAK SAHAKARI BANK LTD.,1
7,BAUCB01230,THE BABASAHEB DESHMUKH SAHAKARI BANK LIMITED A...,1

In [46]:
# dfP5 = dfP5.applymap(comma)
# dfP5.head(5)

In [47]:
dfP5.index = dfP5.index + 1
dfP5.head(5)

,sl. no.,FIUREID,RE_NAME,BELOW_THRESHOLDS
1,1,BASCB00126,EQUITAS SMALL FINANCE BANK LIMITED,33
2,2,BASCO00012,THE HIMACHAL PRADESH STATE CO-OPERATIVE BANK L...,18
3,3,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,16
4,4,BADCB00002,THE AHMEDABAD DISTRICT CO-OPERATIVE BANK LIMITED,8
5,5,BASCB00103,CREDIT SUISSE AG,2

In [48]:
NTR_WITH_THRESHOLD_NAME = dfP5['RE_NAME'][1]
NTR_WTH_THRESHOLD_REPORTS = dfP5['BELOW_THRESHOLDS'][1]

print(NTR_WITH_THRESHOLD_NAME)
print(NTR_WTH_THRESHOLD_REPORTS)

EQUITAS SMALL FINANCE  BANK LIMITED
33

In [49]:
NTR_WTH_THRESHOLD_Total_REPORTS = (dfP5['BELOW_THRESHOLDS'].sum())/100000
NTR_WTH_THRESHOLD_Total_REPORTS = round(NTR_WTH_THRESHOLD_Total_REPORTS,2)
print(NTR_WTH_THRESHOLD_Total_REPORTS)
Threshold_percentage = ((dfP5['BELOW_THRESHOLDS'].sum())/(dfP2['NTR']))*100
Threshold_percentage = round(Threshold_percentage,2)
print(Threshold_percentage)

0.0
0    0.14
Name: NTR, dtype: float64

In [50]:
# dfP5.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\monthly_NTR_below_Threshold_5P.csv',index=True)

In [51]:
# Paramter - 7 Top RE Filling reports without TRN File

In [52]:
query2_0 = f'''

with cte1 as (
select distinct coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.Report_Id, Report_Type
 
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 
and Report_Type in  ('CTR','NTR','CBWTR')

and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
),



  cte2 as (
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne]
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo]
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree]
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour] 
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive] 
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven] 
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine] 
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven]
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] 
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] 
  union 
  select reportId from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSix] 
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP] 
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_GenReporting] 
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEight] 
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTen] 
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwelve] 
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_RealEstateStr] 
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFifteen]
  
  
  ),

 
 cte3 as ( select  Report_Type, FIUREID, RE_NAME, count(distinct cte1.Report_Id) report_count
from cte1 left outer join cte2 on cte1.Report_Id=cte2.reportId where cte2.reportId is null
group by Report_Type, FIUREID, RE_NAME),

   
cte4 as(select FIUREID, RE_NAME,                   
case when Report_Type='CTR' then report_count  else 0 end as CTR,                     
case when Report_Type='NTR' then report_count  else 0 end as NTR,                     
case when Report_Type='CBWTR' then report_count  else 0 end as CBWTR,                    
report_count as total_report_count
from cte3 )
select   FIUREID, RE_NAME, sum(CTR) CTR,sum(NTR) NTR,sum(CBWTR) CBWTR, sum(total_report_count)total_report_count 
from cte4 group by FIUREID, RE_NAME order by sum(total_report_count) desc
'''

print(query2_0)

with cte1 as (
select distinct coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.Report_Id, Report_Type

from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
and Report_Type in  ('CTR','NTR','CBWTR')

and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
),



  cte2 as (
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo]
  union
  select reportId from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSix]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_GenReporting]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEight]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTen]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwelve]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_RealEstateStr]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFifteen]


  ),


 cte3 as ( select  Report_Type, FIUREID, RE_NAME, count(distinct cte1.Report_Id) report_count
from cte1 left outer join cte2 on cte1.Report_Id=cte2.reportId where cte2.reportId is null
group by Report_Type, FIUREID, RE_NAME),


cte4 as(select FIUREID, RE_NAME,
case when Report_Type='CTR' then report_count  else 0 end as CTR,
case when Report_Type='NTR' then report_count  else 0 end as NTR,
case when Report_Type='CBWTR' then report_count  else 0 end as CBWTR,
report_count as total_report_count
from cte3 )
select   FIUREID, RE_NAME, sum(CTR) CTR,sum(NTR) NTR,sum(CBWTR) CBWTR, sum(total_report_count)total_report_count
from cte4 group by FIUREID, RE_NAME order by sum(total_report_count) desc

In [53]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
data_2o = pd.DataFrame(Finnet2_o)
data_2o.columns = data_2o.columns.str.upper()
display("Shape : ",data_2o.shape)
display(data_2o.head(5))

Query Executed successfully

'Shape : '

(122, 6)

,FIUREID,RE_NAME,CTR,NTR,CBWTR,TOTAL_REPORT_COUNT
0,BASCB00079,KOTAK MAHINDRA BANK LIMITED,0,6,1986,1992
1,BASCB00071,HDFC BANK LIMITED,1403,3,2,1408
2,BASCB00061,AXIS BANK,1374,1,2,1377
3,BARRB00259,MADHYA PRADESH GRAMIN BANK,1206,0,0,1206
4,BA00037527,SHRI KANYAKA NAGARI SAHAKARI BANK LTD,1105,0,0,1105

In [54]:
dfP7 = data_2o
display(dfP7)
dfP7 = dfP7.reset_index()
dfP7['index'] = dfP7['index']+1
dfP7 = dfP7.rename(columns={'index':'sl. no.'})

,FIUREID,RE_NAME,CTR,NTR,CBWTR,TOTAL_REPORT_COUNT
0,BASCB00079,KOTAK MAHINDRA BANK LIMITED,0,6,1986,1992
1,BASCB00071,HDFC BANK LIMITED,1403,3,2,1408
2,BASCB00061,AXIS BANK,1374,1,2,1377
3,BARRB00259,MADHYA PRADESH GRAMIN BANK,1206,0,0,1206
4,BA00037527,SHRI KANYAKA NAGARI SAHAKARI BANK LTD,1105,0,0,1105
...,...,...,...,...,...,...
117,FIAPR02083,MULTIMONEY FOREX LIMITED,1,0,0,1
118,FIAPR01244,ZENITH LEISURE HOLIDAYS LTD,1,0,0,1
119,BADCB00112,GONDIA DISTRICT CENTRAL CO-OPERATIVE BANK LIMITED,1,0,0,1
120,BAUCB01552,THE MAHAVEER CO-OPERATIVE BANK LIMITED BELGAUM,1,0,0,1
121,BAUCB00426,ICHALKARNJI MERCHANTS CO-OP BANK LIMITED,1,0,0,1

In [55]:
dfP7.index = dfP7.index + 1
dfP7.head(5)

,sl. no.,FIUREID,RE_NAME,CTR,NTR,CBWTR,TOTAL_REPORT_COUNT
1,1,BASCB00079,KOTAK MAHINDRA BANK LIMITED,0,6,1986,1992
2,2,BASCB00071,HDFC BANK LIMITED,1403,3,2,1408
3,3,BASCB00061,AXIS BANK,1374,1,2,1377
4,4,BARRB00259,MADHYA PRADESH GRAMIN BANK,1206,0,0,1206
5,5,BA00037527,SHRI KANYAKA NAGARI SAHAKARI BANK LTD,1105,0,0,1105

In [56]:
# dfP7.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\monthly_Without_TRN_file_7P.csv',index=True)

In [57]:
# Parameter - 8 CTR Abnormally

In [60]:
# query2_0 = f'''
# with cte1 as( 
# select distinct coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.Report_Id, Report_Type, trim(a.accountNumber)accountNumber
# from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
# join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
# join  [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountDetail] (nolock) a on a.reportid=cp.Report_Id
# and  Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 
# and Report_Type = 'CTR'

# and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31),

# cte2 as (  
# select  distinct c1.Report_Id, FIUREID, accountNumber ,RE_NAME
#  from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_PersonDetail] (nolock) pd
# inner join cte1 c1 on pd.reportId=c1.Report_Id and pan is not null
# inner join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountPerson] (nolock) ap
# ON pd.reportId=ap.reportId and concat('A-',trim(ap.accountNo))=c1.accountNumber and pd.ucic=ap.ucic   and  relationTypeId = 1
# union all
# select distinct c1.Report_Id, FIUREID,accountNumber, RE_NAME
#  from  [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_EntityDetail] (nolock) ed
# inner join cte1  c1 on ed.reportId=c1.Report_Id and pan is not null
# inner join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountPerson] (nolock) ap
# ON ed.reportId=ap.reportId and concat('A-',trim(ap.accountNo))=c1.accountNumber and ed.ucic=ap.ucic  and  relationTypeId = 1
# ),

# cte3 as (
#   SELECT c2.Report_Id, FIUREID,RE_NAME,[transactionAmount]amount, 
#   tc1.accountNumber  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] tc1 join cte2 c2 on tc1.reportId=c2.Report_Id and tc1.accountNumber=c2.accountNumber and active_=1 
#   and tc1.accountNumber = [transactionAmount]or [transactionAmount]>100000000000
#   union 
#   SELECT c2.Report_Id, FIUREID,RE_NAME,[amount],
#  tc2.accountNumber   FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] tc2 join cte2 c2 on tc2.reportId=c2.Report_Id and tc2.accountNumber=c2.accountNumber and active_=1 
#  and tc2.accountNumber = [amount]  or [amount] >100000000000 
#   ) 

# select Report_Id as Report_id ,FIUREID , RE_NAME ,accountnumber , amount from cte3

# '''

# print(query2_0)

In [61]:
# Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
# print('Query Executed successfully')
# data_2o = pd.DataFrame(Finnet2_o)
# data_2o.columns = data_2o.columns.str.upper()
# display("Shape : ",data_2o.shape)
# display(data_2o.head(5))

In [62]:
# dfP8 = data_2o
# display(dfP8)
# dfP8 = dfP8.reset_index()
# dfP8['index'] = dfP8['index']+1
# dfP8 = dfP8.rename(columns={'index':'sl. no.'})

In [ ]:
# dfP8.index = dfP8.index + 1
# dfP8.head(5)

In [63]:
# # For dashboard --------------------

# query2_0 = f'''
# with cte1 as( 
# select  coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.Report_Id, Report_Type, trim(a.accountNumber)accountNumber
# from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
# join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
# join  [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountDetail] (nolock) a on a.reportid=cp.Report_Id
# and  Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 
# and Report_Type = 'CTR'

# and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31),

# cte2 as (  
# select  distinct c1.Report_Id, FIUREID, accountNumber ,RE_NAME
#  from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_PersonDetail] (nolock) pd
# inner join cte1 c1 on pd.reportId=c1.Report_Id and pan is not null
# inner join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountPerson] (nolock) ap
# ON pd.reportId=ap.reportId and concat('A-',trim(ap.accountNo))=c1.accountNumber and pd.ucic=ap.ucic   and  relationTypeId = 1
# union all
# select distinct c1.Report_Id, FIUREID,accountNumber, RE_NAME
#  from  [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_EntityDetail] (nolock) ed
# inner join cte1  c1 on ed.reportId=c1.Report_Id and pan is not null
# inner join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountPerson] (nolock) ap
# ON ed.reportId=ap.reportId and concat('A-',trim(ap.accountNo))=c1.accountNumber and ed.ucic=ap.ucic  and  relationTypeId = 1
# ),

# cte3 as (
#   SELECT c2.Report_Id, FIUREID,RE_NAME,[transactionAmount]amount, 
#   tc1.accountNumber  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] tc1 join cte2 c2 on tc1.reportId=c2.Report_Id and tc1.accountNumber=c2.accountNumber and active_=1 
#   and tc1.accountNumber = [transactionAmount]or [transactionAmount]>100000000000
#   union 
#   SELECT c2.Report_Id, FIUREID,RE_NAME,[amount],
#  tc2.accountNumber   FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] tc2 join cte2 c2 on tc2.reportId=c2.Report_Id and tc2.accountNumber=c2.accountNumber and active_=1 
#  and tc2.accountNumber = [amount]  or [amount] >100000000000 
#   ) 

# select count(distinct Report_Id) as CTR_Abnormally_count ,FIUREID , RE_NAME from cte3
# group by FIUREID , RE_NAME

# '''

# print(query2_0)

In [65]:
# Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
# print('Query Executed successfully')
# data_2o = pd.DataFrame(Finnet2_o)
# data_2o.columns = data_2o.columns.str.upper()
# display("Shape : ",data_2o.shape)
# display(data_2o.head(5))

In [64]:
# dfP8A_ = data_2o
# display(dfP8A_)
# dfP8A_ = dfP8A_.reset_index()
# dfP8A_['index'] = dfP8A_['index']+1
# dfP8A_ = dfP8A_.rename(columns={'index':'sl. no.'})

In [ ]:
# dfP8.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\monthly_CTR_Abnormally_8P.csv' , index=True)

In [ ]:
#EFT Anomalies

In [ ]:
# Parameter - 9B EFT Anomalies - Missing Account

In [66]:
query2_0 = f'''

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id) total_EFTs
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8)  between 20{Current_month_init}01 and 20{Current_month_init}31
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (select FIUREID,RE_NAME, count(distinct report_id) Anomaly_Reports from

( select distinct cp.report_id, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8)  between 20{Current_month_init}01 and 20{Current_month_init}31 
--and  originCountry <>'95' and destinationCountry <>'95'
--and originCountry = '95' and [identifierType]='PAN' and [senderIdentifierAcNo] = 'null'
and originCountry = '95'  and senderAcNo is null
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
union
select distinct cp.report_id,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8)  between 20{Current_month_init}01 and 20{Current_month_init}31
--and  originCountry <>'95' and destinationCountry <>'95'
and destinationCountry = '95'  and  beneficiaryAcNo is null 
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
)z

group by  FIUREID,RE_NAME


)

select cte1.FIUREID, cte1.RE_NAME, cte1.Total_EFTs, Anomaly_Reports, concat(round((cast(Anomaly_Reports as double precision ) /cast(cte1.Total_EFTs as double precision)),2)*100 ,'%')EFT_Percentage  from cte1 inner join cte2 on cte1.fiureid=cte2.FIUREID
order by Anomaly_Reports desc

'''

print(query2_0)

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id) total_EFTs
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8)  between 20240301 and 20240331
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (select FIUREID,RE_NAME, count(distinct report_id) Anomaly_Reports from

( select distinct cp.report_id, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8)  between 20240301 and 20240331
--and  originCountry <>'95' and destinationCountry <>'95'
--and originCountry = '95' and [identifierType]='PAN' and [senderIdentifierAcNo] = 'null'
and originCountry = '95'  and senderAcNo is null
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
union
select distinct cp.report_id,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8)  between 20240301 and 20240331
--and  originCountry <>'95' and destinationCountry <>'95'
and destinationCountry = '95'  and  beneficiaryAcNo is null
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
)z

group by  FIUREID,RE_NAME


)

select cte1.FIUREID, cte1.RE_NAME, cte1.Total_EFTs, Anomaly_Reports, concat(round((cast(Anomaly_Reports as double precision ) /cast(cte1.Total_EFTs as double precision)),2)*100 ,'%')EFT_Percentage  from cte1 inner join cte2 on cte1.fiureid=cte2.FIUREID
order by Anomaly_Reports desc

In [67]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
data_2o = pd.DataFrame(Finnet2_o)
data_2o.columns = data_2o.columns.str.upper()
display("Shape : ",data_2o.shape)
display(data_2o.head(5))

Query Executed successfully

'Shape : '

(16, 5)

,FIUREID,RE_NAME,TOTAL_EFTS,ANOMALY_REPORTS,EFT_PERCENTAGE
0,BASCB00071,HDFC BANK LIMITED,291042,16222,6%
1,BASCB00074,INDUSIND BANK LIMITED,14281,8667,61%
2,BASCB00061,AXIS BANK,23117,195,1%
3,BASCB00046,PUNJAB & SIND BANK,179,179,100%
4,BASCB00068,DHANLAXMI BANK LIMITED,122,122,100%

In [68]:
dfP9B = data_2o
display(dfP9B)
dfP9B = dfP9B.reset_index()
dfP9B['index'] = dfP9B['index']+1
dfP9B = dfP9B.rename(columns={'index':'sl. no.'})

,FIUREID,RE_NAME,TOTAL_EFTS,ANOMALY_REPORTS,EFT_PERCENTAGE
0,BASCB00071,HDFC BANK LIMITED,291042,16222,6%
1,BASCB00074,INDUSIND BANK LIMITED,14281,8667,61%
2,BASCB00061,AXIS BANK,23117,195,1%
3,BASCB00046,PUNJAB & SIND BANK,179,179,100%
4,BASCB00068,DHANLAXMI BANK LIMITED,122,122,100%
5,BASCB00128,EMIRATES NBD BANK PJSC,11877,96,1%
6,BASCB00016,DBS BANK INDIA LTD.,5363,37,1%
7,BASCB00114,MASHREQBANK PSC,44,37,84%
8,BASCB00064,CSB BANK LTD,218,32,15%
9,BASCB00079,KOTAK MAHINDRA BANK LIMITED,55223,30,0%
10,BASCB00072,ICICI BANK LIMITED,62805,29,0%
11,BASCB00124,IDFC FIRST BANK LTD,12585,9,0%
12,BAUCB01837,BASSEIN CATHOLIC CO OP BANK LIMITED,27,2,7%
13,INOTH00089,LAKE SHORE INDIA RETAIL VENTURE FUND,1,1,100%
14,BASCB00086,SOUTH INDIAN BANK LIMITED,1373,1,0%
15,BASCB00015,CITIBANK N A,10795,1,0%

In [69]:
dfP9B.index = dfP9B.index + 1
dfP9B.head(5)

,sl. no.,FIUREID,RE_NAME,TOTAL_EFTS,ANOMALY_REPORTS,EFT_PERCENTAGE
1,1,BASCB00071,HDFC BANK LIMITED,291042,16222,6%
2,2,BASCB00074,INDUSIND BANK LIMITED,14281,8667,61%
3,3,BASCB00061,AXIS BANK,23117,195,1%
4,4,BASCB00046,PUNJAB & SIND BANK,179,179,100%
5,5,BASCB00068,DHANLAXMI BANK LIMITED,122,122,100%

In [70]:
EFT_Missing_Account_REPORTS = (dfP9B['ANOMALY_REPORTS'].sum())/100000
EFT_Missing_Account_REPORTS = round(EFT_Missing_Account_REPORTS,2)
print(EFT_Missing_Account_REPORTS)


EFT_Missing_Account_percentage = (dfP9B['ANOMALY_REPORTS'].sum()) / (dfP2['EFT']) * 100
EFT_Missing_Account_percentage = round(EFT_Missing_Account_percentage,2)
print(EFT_Missing_Account_percentage)

0.26
0    4.25
Name: EFT, dtype: float64

In [71]:
# dfP9B.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\monthly_EFT_Abnormally_Missing_AC_NO_9B.csv',index=True)

In [72]:
# Parameter - 9C EFT Anomalies - Sender And Benificary country not India

In [73]:
query2_0 = f'''
with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id) total_EFTs
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id)Anomaly_Reports
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and  originCountry <>'95' and destinationCountry <>'95'
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))

)

select cte1.FIUREID, cte1.RE_NAME, cte1.Total_EFTs, Anomaly_Reports AS EFTs_with_Sender_AND_Beneficiary_country_not_India, concat(round((cast(Anomaly_Reports as double precision ) /cast(cte1.Total_EFTs as double precision)),2)*100 ,'%')Percent_of_EFTs_with_Sender_and_Beneficiary_country_not_India  from cte1 inner join cte2 on cte1.fiureid=cte2.FIUREID
order by Anomaly_Reports desc
'''
print(query2_0)

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id) total_EFTs
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id)Anomaly_Reports
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and  originCountry <>'95' and destinationCountry <>'95'
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))

)

select cte1.FIUREID, cte1.RE_NAME, cte1.Total_EFTs, Anomaly_Reports AS EFTs_with_Sender_AND_Beneficiary_country_not_India, concat(round((cast(Anomaly_Reports as double precision ) /cast(cte1.Total_EFTs as double precision)),2)*100 ,'%')Percent_of_EFTs_with_Sender_and_Beneficiary_country_not_India  from cte1 inner join cte2 on cte1.fiureid=cte2.FIUREID
order by Anomaly_Reports desc

In [74]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
data_2o = pd.DataFrame(Finnet2_o)
data_2o.columns = data_2o.columns.str.upper()
display("Shape : ",data_2o.shape)
display(data_2o.head(5))

Query Executed successfully

'Shape : '

(0, 5)

Empty DataFrame
Columns: [FIUREID, RE_NAME, TOTAL_EFTS, EFTS_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA, PERCENT_OF_EFTS_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA]
Index: []

In [75]:
dfP9C = data_2o
display(dfP9C)
dfP9C = dfP9C.reset_index()
dfP9C['index'] = dfP9C['index']+1
dfP9C = dfP9C.rename(columns={'index':'sl. no.'})

Empty DataFrame
Columns: [FIUREID, RE_NAME, TOTAL_EFTS, EFTS_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA, PERCENT_OF_EFTS_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA]
Index: []

In [76]:
dfP9C.index = dfP9C.index + 1
dfP9C.head(5)

Empty DataFrame
Columns: [sl. no., FIUREID, RE_NAME, TOTAL_EFTS, EFTS_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA, PERCENT_OF_EFTS_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA]
Index: []

In [77]:
EFT_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA_REPORTS = (dfP9C['EFTS_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA'].sum()) #/100000
# EFT_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA_REPORTS = round(EFT_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA_REPORTS,2)
print(EFT_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA_REPORTS)


# EFT_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA_percentage = (dfP9C['EFTS_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA'].sum()) / (dfP2['EFT']) * 100
# EFT_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA_percentage = round(EFT_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA_percentage,2)
# print(EFT_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA_percentage)

0

In [78]:
# dfP9C.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\monthly_EFT_Abnormally_Sender_Benificary_not_India_9C.csv',index=True)

In [79]:
# Parameter - 9D EFT Anomalies - Missing State

In [80]:
query2_0 = f'''

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id) total_EFTs
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
where ( name not like '% IBU%' and name not like '%-IBU%')
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (select FIUREID,RE_NAME, count(distinct report_id)Anomaly_Reports from

( select distinct cp.report_id, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
where ( name not like '% IBU%' and name not like '%-IBU%')
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and originCountry = '95'  and senderState is null
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
union
select distinct cp.report_id,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
where ( name not like '% IBU%' and name not like '%-IBU%')
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and destinationCountry = '95'  and  benState is null 
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
)z

group by  FIUREID,RE_NAME

)

select cte1.FIUREID, cte1.RE_NAME, cte1.Total_EFTs, Anomaly_Reports as EFTs_with_missing_state_name , concat(round((cast(Anomaly_Reports as double precision ) /cast(cte1.Total_EFTs as double precision)),2)*100 ,'%')Percent_of_EFTs_with_missing_state_name  from cte1 inner join cte2 on cte1.fiureid=cte2.FIUREID
order by Anomaly_Reports desc


'''

print(query2_0)

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id) total_EFTs
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
where ( name not like '% IBU%' and name not like '%-IBU%')
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (select FIUREID,RE_NAME, count(distinct report_id)Anomaly_Reports from

( select distinct cp.report_id, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
where ( name not like '% IBU%' and name not like '%-IBU%')
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and originCountry = '95'  and senderState is null
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
union
select distinct cp.report_id,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
where ( name not like '% IBU%' and name not like '%-IBU%')
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and destinationCountry = '95'  and  benState is null
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
)z

group by  FIUREID,RE_NAME

)

select cte1.FIUREID, cte1.RE_NAME, cte1.Total_EFTs, Anomaly_Reports as EFTs_with_missing_state_name , concat(round((cast(Anomaly_Reports as double precision ) /cast(cte1.Total_EFTs as double precision)),2)*100 ,'%')Percent_of_EFTs_with_missing_state_name  from cte1 inner join cte2 on cte1.fiureid=cte2.FIUREID
order by Anomaly_Reports desc

In [81]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
data_2o = pd.DataFrame(Finnet2_o)
data_2o.columns = data_2o.columns.str.upper()
display("Shape : ",data_2o.shape)
display(data_2o.head(5))

Query Executed successfully

'Shape : '

(55, 5)

,FIUREID,RE_NAME,TOTAL_EFTS,EFTS_WITH_MISSING_STATE_NAME,PERCENT_OF_EFTS_WITH_MISSING_STATE_NAME
0,BASCB00071,HDFC BANK LIMITED,291042,88751,30%
1,BASCB00079,KOTAK MAHINDRA BANK LIMITED,55223,53237,96%
2,BASCB00061,AXIS BANK,23117,23004,100%
3,BASCB00069,THE FEDERAL BANK LTD,24512,17744,72%
4,BASCB00074,INDUSIND BANK LIMITED,14281,14281,100%

In [82]:
dfP9D = data_2o

In [83]:
display(dfP9D)
dfP9D = dfP9D.reset_index()
dfP9D['index'] = dfP9D['index']+1
dfP9D = dfP9D.rename(columns={'index':'sl. no.'})

,FIUREID,RE_NAME,TOTAL_EFTS,EFTS_WITH_MISSING_STATE_NAME,PERCENT_OF_EFTS_WITH_MISSING_STATE_NAME
0,BASCB00071,HDFC BANK LIMITED,291042,88751,30%
1,BASCB00079,KOTAK MAHINDRA BANK LIMITED,55223,53237,96%
2,BASCB00061,AXIS BANK,23117,23004,100%
3,BASCB00069,THE FEDERAL BANK LTD,24512,17744,72%
4,BASCB00074,INDUSIND BANK LIMITED,14281,14281,100%
5,BASCB00072,ICICI BANK LIMITED,62805,13798,22%
6,BASCB00124,IDFC FIRST BANK LTD,12585,12540,100%
7,BASCB00128,EMIRATES NBD BANK PJSC,11877,11749,99%
8,BASCB00050,STATE BANK OF INDIA,25133,7464,30%
9,BASCB00015,CITIBANK N A,10795,7194,67%
10,BASCB00003,AMERICAN EXPRESS BANKING CORP.,4110,4110,100%
11,BASCB00016,DBS BANK INDIA LTD.,5363,2943,55%
12,BASCB00058,UNION BANK OF INDIA,2688,2688,100%
13,BASCB00020,J P MORGAN CHASE BANK NA,2409,2409,100%
14,BASCB00019,HONGKONG AND SHANGHAI BANKING CORPORATION LIMITED,7180,1681,23%
15,FIAPR00122,THOMAS COOK (INDIA) LTD,1189,1188,100%
16,BASCB00036,BANK OF BARODA,6240,667,11%
17,BASCB00029,STANDARD CHARTERED BANK,647,581,90%
18,BASCB00067,DCB BANK LIMITED,447,447,100%
19,BASCB00039,CANARA BANK,7899,427,5%
20,BASCB00026,SHINHAN BANK,395,395,100%
21,BASCB00047,PUNJAB NATIONAL BANK,2447,376,15%
22,BASCB00077,KARNATAKA BANK LIMITED,462,369,80%
23,BA00019905,SARASWAT COOP BANK LIMITED BOMBAY,575,352,61%
24,BASCB00040,CENTRAL BANK OF INDIA,499,345,69%
25,BASCB00087,TAMILNAD MERCANTILE BANK LIMITED,264,264,100%
26,BASCB00064,CSB BANK LTD,218,218,100%
27,BA00022718,JAMMU AND KASHMIR BANK LIMITED,184,183,99%
28,BASCB00046,PUNJAB & SIND BANK,179,179,100%
29,BASCB00008,BANK OF AMERICA NATIONAL ASSOCIATION,2213,164,7%
30,BASCB00083,RBL BANK LTD,7680,142,2%
31,BASCB00068,DHANLAXMI BANK LIMITED,122,119,98%
32,BASCB00038,BANK OF MAHARASHTRA,944,108,11%
33,BASCB00117,KEB HANA BANK,55,55,100%
34,BASCB00114,MASHREQBANK PSC,44,44,100%
35,BASCB00057,UCO BANK,380,42,11%
36,BASCB00043,INDIAN BANK,133,34,26%
37,BAUCB01837,BASSEIN CATHOLIC CO OP BANK LIMITED,27,27,100%
38,BA00024558,BANK OF BAHRAIN AND KUWAIT BSC,37,25,68%
39,BASCB00075,IDBI BANK LTD,2068,22,1%
40,BA00024401,INDUSTRIAL AND COMMERCIAL BANK OF CHINA LIMITE...,21,21,100%
41,BASCB00006,BNP PARIBAS,338,18,5%
42,BASCB00098,WOORI BANK,216,17,8%
43,BASCB00024,MIZUHO BANK LTD.,8,8,100%
44,BASCB00120,DOHA BANK Q P S C,399,7,2%
45,BAUCB01880,SVC COOPERATIVE BANK LTD,132,6,5%
46,BASCB00031,MUFG BANK LTD,533,5,1%
47,BAUCB01838,BHARAT CO-OPERATIVE BANK MUMBAI LIMITED,174,3,2%
48,BASCB00010,BANK OF CEYLON,8,1,13%
49,BASCB00012,BARCLAYS BANK PLC,855,1,0%
50,BASCB00078,KARUR VYSYA BANK LIMITED,1293,1,0%
51,BAUCB01855,THE KALUPUR COMMERCIAL COOP BANK LIMITED,220,1,0%
52,BASCB00123,BANDHAN BANK LIMITED,27,1,4%
53,BAUCB00961,PRIME CO-OPERATIVE BANK LIMITED SURAT,1,1,100%
54,FINBF13068,BOBCARD LIMITED (FORMERLY BOB FINANCIAL SOLUTI...,1,1,100%

In [84]:
dfP9D.index = dfP9D.index + 1
dfP9D.head(5)

,sl. no.,FIUREID,RE_NAME,TOTAL_EFTS,EFTS_WITH_MISSING_STATE_NAME,PERCENT_OF_EFTS_WITH_MISSING_STATE_NAME
1,1,BASCB00071,HDFC BANK LIMITED,291042,88751,30%
2,2,BASCB00079,KOTAK MAHINDRA BANK LIMITED,55223,53237,96%
3,3,BASCB00061,AXIS BANK,23117,23004,100%
4,4,BASCB00069,THE FEDERAL BANK LTD,24512,17744,72%
5,5,BASCB00074,INDUSIND BANK LIMITED,14281,14281,100%

In [85]:
EFTS_WITH_MISSING_STATE_NAME_REPORTS = (dfP9D['EFTS_WITH_MISSING_STATE_NAME'].sum())/100000
EFTS_WITH_MISSING_STATE_NAME_REPORTS = round(EFTS_WITH_MISSING_STATE_NAME_REPORTS,2)
print(EFTS_WITH_MISSING_STATE_NAME_REPORTS)


EFTS_WITH_MISSING_STATE_NAME_percentage = (dfP9D['EFTS_WITH_MISSING_STATE_NAME'].sum()) / (dfP2['EFT']) * 100
EFTS_WITH_MISSING_STATE_NAME_percentage = round(EFTS_WITH_MISSING_STATE_NAME_percentage,2)
print(EFTS_WITH_MISSING_STATE_NAME_percentage)

2.7
0    44.84
Name: EFT, dtype: float64

In [86]:
# dfP9D.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\monthly_EFT_Abnormally_Missing_State_9D.csv',index=True)

In [87]:
#Parameter 9-A EFT Anomaly amount less than 5 lakh

In [88]:
query2_0 = f'''

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id) total_EFTs
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (select  coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id)Anomaly_Reports
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and [amountInInr] < 500000
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))

)

select cte1.FIUREID, cte1.RE_NAME, cte1.Total_EFTs, Anomaly_Reports as EFTs_amounting_less_than_5_Lakhs, concat(round((cast(Anomaly_Reports as double precision ) /cast(cte1.Total_EFTs as double precision)),2)*100 ,'%')Percent_of_EFTs_amounting_less_than_5_Lakhs  from cte1 inner join cte2 on cte1.fiureid=cte2.FIUREID
order by Anomaly_Reports desc

'''

print(query2_0)

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id) total_EFTs
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (select  coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id)Anomaly_Reports
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and [amountInInr] < 500000
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))

)

select cte1.FIUREID, cte1.RE_NAME, cte1.Total_EFTs, Anomaly_Reports as EFTs_amounting_less_than_5_Lakhs, concat(round((cast(Anomaly_Reports as double precision ) /cast(cte1.Total_EFTs as double precision)),2)*100 ,'%')Percent_of_EFTs_amounting_less_than_5_Lakhs  from cte1 inner join cte2 on cte1.fiureid=cte2.FIUREID
order by Anomaly_Reports desc

In [89]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
data_2o = pd.DataFrame(Finnet2_o)
data_2o.columns = data_2o.columns.str.upper()
display("Shape : ",data_2o.shape)
display(data_2o.head(5))

Query Executed successfully

'Shape : '

(6, 5)

,FIUREID,RE_NAME,TOTAL_EFTS,EFTS_AMOUNTING_LESS_THAN_5_LAKHS,PERCENT_OF_EFTS_AMOUNTING_LESS_THAN_5_LAKHS
0,BASCB00071,HDFC BANK LIMITED,291042,1723,1%
1,BASCB00039,CANARA BANK,7899,694,9%
2,BASCB00008,BANK OF AMERICA NATIONAL ASSOCIATION,2213,18,1%
3,BAUCB01837,BASSEIN CATHOLIC CO OP BANK LIMITED,27,5,19%
4,BASCB00015,CITIBANK N A,10795,4,0%

In [90]:
dfP9A = data_2o
display(dfP9A)
dfP9A = dfP9A.reset_index()
dfP9A['index'] = dfP9A['index']+1
dfP9A = dfP9A.rename(columns={'index':'sl. no.'})

,FIUREID,RE_NAME,TOTAL_EFTS,EFTS_AMOUNTING_LESS_THAN_5_LAKHS,PERCENT_OF_EFTS_AMOUNTING_LESS_THAN_5_LAKHS
0,BASCB00071,HDFC BANK LIMITED,291042,1723,1%
1,BASCB00039,CANARA BANK,7899,694,9%
2,BASCB00008,BANK OF AMERICA NATIONAL ASSOCIATION,2213,18,1%
3,BAUCB01837,BASSEIN CATHOLIC CO OP BANK LIMITED,27,5,19%
4,BASCB00015,CITIBANK N A,10795,4,0%
5,BA00035883,THE HONGKONG AND SHANGHAI BANKING CORPORATION ...,47,2,4%

In [91]:
dfP9A.index = dfP9A.index + 1
dfP9A.head(5)

,sl. no.,FIUREID,RE_NAME,TOTAL_EFTS,EFTS_AMOUNTING_LESS_THAN_5_LAKHS,PERCENT_OF_EFTS_AMOUNTING_LESS_THAN_5_LAKHS
1,1,BASCB00071,HDFC BANK LIMITED,291042,1723,1%
2,2,BASCB00039,CANARA BANK,7899,694,9%
3,3,BASCB00008,BANK OF AMERICA NATIONAL ASSOCIATION,2213,18,1%
4,4,BAUCB01837,BASSEIN CATHOLIC CO OP BANK LIMITED,27,5,19%
5,5,BASCB00015,CITIBANK N A,10795,4,0%

In [92]:
EFT_BELOW_THRESHOLDS_Total_REPORTS = (dfP9A['EFTS_AMOUNTING_LESS_THAN_5_LAKHS'].sum())/100000
EFT_BELOW_THRESHOLDS_Total_REPORTS = round(EFT_BELOW_THRESHOLDS_Total_REPORTS,2)
print(EFT_BELOW_THRESHOLDS_Total_REPORTS)


EFT_BELOW_THRESHOLD_percentage = (dfP9A['EFTS_AMOUNTING_LESS_THAN_5_LAKHS'].sum() / (dfP2['EFT']) ) * 100
EFT_BELOW_THRESHOLD_percentage = round(EFT_BELOW_THRESHOLD_percentage,2)
print(EFT_BELOW_THRESHOLD_percentage)

0.02
0    0.41
Name: EFT, dtype: float64

In [93]:
# dfP9A.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\monthly_EFT_Abnormally_NTR_Less_5lkh_9A.csv',index=True)

In [94]:
#Parameter 9-e EFT Anomaly same amount in INR and Foreign

In [95]:
query2_0 = f'''

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id) total_EFTs
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
--join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id) Anomaly_Reports
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and [amountInInr] = amountInTxCurrency and txCurrencyCode='29'
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name])))

select cte1.FIUREID, cte1.RE_NAME, cte1.Total_EFTs, Anomaly_Reports AS EFTs_with_both_INR_and_Foreign_currency_equal, concat(round((cast(Anomaly_Reports as double precision ) /cast(cte1.Total_EFTs as double precision)),2)*100 ,'%')Percent_of_EFTs_with_both_INR_and_Foreign_currency_equal   from cte1 inner join cte2 on cte1.fiureid=cte2.FIUREID
order by Anomaly_Reports desc

'''

print(query2_0)

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id) total_EFTs
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
--join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, count(distinct cp.report_id) Anomaly_Reports
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and [amountInInr] = amountInTxCurrency and txCurrencyCode='29'
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
group by coalesce([oldREId],[newREId]),trim(upper([name])))

select cte1.FIUREID, cte1.RE_NAME, cte1.Total_EFTs, Anomaly_Reports AS EFTs_with_both_INR_and_Foreign_currency_equal, concat(round((cast(Anomaly_Reports as double precision ) /cast(cte1.Total_EFTs as double precision)),2)*100 ,'%')Percent_of_EFTs_with_both_INR_and_Foreign_currency_equal   from cte1 inner join cte2 on cte1.fiureid=cte2.FIUREID
order by Anomaly_Reports desc

In [96]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
data_2o = pd.DataFrame(Finnet2_o)
data_2o.columns = data_2o.columns.str.upper()
display("Shape : ",data_2o.shape)
display(data_2o.head(5))

Query Executed successfully

'Shape : '

(34, 5)

,FIUREID,RE_NAME,TOTAL_EFTS,EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL,PERCENT_OF_EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL
0,BASCB00071,HDFC BANK LIMITED,291042,85567,29%
1,BASCB00072,ICICI BANK LIMITED,62805,15863,25%
2,BASCB00128,EMIRATES NBD BANK PJSC,11877,11773,99%
3,BASCB00050,STATE BANK OF INDIA,25133,7303,29%
4,BASCB00079,KOTAK MAHINDRA BANK LIMITED,55223,5405,10%

In [97]:
dfP9E = data_2o
display(dfP9E)
dfP9E = dfP9E.reset_index()
dfP9E['index'] = dfP9E['index']+1
dfP9E = dfP9E.rename(columns={'index':'sl. no.'})

,FIUREID,RE_NAME,TOTAL_EFTS,EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL,PERCENT_OF_EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL
0,BASCB00071,HDFC BANK LIMITED,291042,85567,29%
1,BASCB00072,ICICI BANK LIMITED,62805,15863,25%
2,BASCB00128,EMIRATES NBD BANK PJSC,11877,11773,99%
3,BASCB00050,STATE BANK OF INDIA,25133,7303,29%
4,BASCB00079,KOTAK MAHINDRA BANK LIMITED,55223,5405,10%
5,BASCB00015,CITIBANK N A,10795,4779,44%
6,BASCB00074,INDUSIND BANK LIMITED,14281,4249,30%
7,BASCB00016,DBS BANK INDIA LTD.,5363,3734,70%
8,BASCB00061,AXIS BANK,23117,2704,12%
9,BASCB00003,AMERICAN EXPRESS BANKING CORP.,4110,2503,61%
10,BASCB00020,J P MORGAN CHASE BANK NA,2409,2408,100%
11,BASCB00083,RBL BANK LTD,7680,1608,21%
12,BASCB00008,BANK OF AMERICA NATIONAL ASSOCIATION,2213,1388,63%
13,BASCB00012,BARCLAYS BANK PLC,855,383,45%
14,BASCB00120,DOHA BANK Q P S C,399,380,95%
15,BASCB00019,HONGKONG AND SHANGHAI BANKING CORPORATION LIMITED,7180,356,5%
16,BASCB00044,INDIAN OVERSEAS BANK,3073,165,5%
17,BASCB00047,PUNJAB NATIONAL BANK,2447,147,6%
18,BASCB00031,MUFG BANK LTD,533,81,15%
19,BASCB00036,BANK OF BARODA,6240,49,1%
20,BASCB00006,BNP PARIBAS,338,36,11%
21,BASCB00105,SUMITOMO MITSUI BANKING CORPORATION,187,27,14%
22,BASCB00039,CANARA BANK,7899,17,0%
23,BASCB00078,KARUR VYSYA BANK LIMITED,1293,9,1%
24,BASCB00024,MIZUHO BANK LTD.,8,8,100%
25,BASCB00114,MASHREQBANK PSC,44,6,14%
26,BA00019905,SARASWAT COOP BANK LIMITED BOMBAY,575,5,1%
27,BASCB00064,CSB BANK LTD,218,4,2%
28,BAUCB01834,ABHYUDAYA CO-OP BANK LIMITED,38,2,5%
29,BASCB00026,SHINHAN BANK,395,2,1%
30,BASCB00113,UNITED OVERSEAS BANK LIMITED,1,1,100%
31,BASCB00087,TAMILNAD MERCANTILE BANK LIMITED,264,1,0%
32,BASCB00057,UCO BANK,380,1,0%
33,BASCB00067,DCB BANK LIMITED,447,1,0%

In [98]:
dfP9E.index = dfP9E.index +1
dfP9E.head(5)

,sl. no.,FIUREID,RE_NAME,TOTAL_EFTS,EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL,PERCENT_OF_EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL
1,1,BASCB00071,HDFC BANK LIMITED,291042,85567,29%
2,2,BASCB00072,ICICI BANK LIMITED,62805,15863,25%
3,3,BASCB00128,EMIRATES NBD BANK PJSC,11877,11773,99%
4,4,BASCB00050,STATE BANK OF INDIA,25133,7303,29%
5,5,BASCB00079,KOTAK MAHINDRA BANK LIMITED,55223,5405,10%

In [99]:
EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL_REPORTS = (dfP9E['EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL'].sum())/100000
EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL_REPORTS = round(EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL_REPORTS,2)
print(EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL_REPORTS)


EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL_percentage = (dfP9E['EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL'].sum() / (dfP2['EFT']) ) * 100
EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL_percentage = round(EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL_percentage,2)
print(EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL_percentage)

1.51
0    25.03
Name: EFT, dtype: float64

##### 10- Missing/Invalid PAN

In [100]:
query2_0 = f'''
with cte1 as (select FIUREID,RE_NAME,
sum(case  when Report_Type = 'STR' then Anomaly_Reports else 0 end) 'STR',
sum(case  when Report_Type = 'CTR' then Anomaly_Reports else 0 end) 'CTR',
sum(case  when Report_Type = 'NTR' then Anomaly_Reports else 0 end) 'NTR',
sum(case  when Report_Type = 'CBWTR' then Anomaly_Reports else 0 end) 'CBWTR',
sum(case  when Report_Type = 'CCR' then Anomaly_Reports else 0 end) 'CCR',
sum(case  when Report_Type = 'BDU' then Anomaly_Reports else 0 end) 'BDU',
sum(Anomaly_Reports) AS anomalies_count
from 
(
select  coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, cp.Report_Type, count(distinct cp.report_id) Anomaly_Reports from 

(select reportid,Report_Type,relationTypeId,personname,branch_state_code from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] (nolock) where (pan not like '%[A-Z][A-Z][A-Z][A-Z][A-Z][0-9][0-9][0-9][0-9][A-Z]%' or pan is null)) peb

inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)	
where substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31 
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' ) cp on cp.Report_Id = peb.reportid
inner join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1 ) re on cp.Re_Id = re.id_
group by coalesce([oldREId],[newREId]),cp.Report_Type,trim(upper([name])))zz
group by FIUREID,RE_NAME ),

cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select distinct CTE1.FIUREID,CTE1.RE_NAME, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID
	
ORDER BY anomalies_count  DESC

'''

print(query2_0)

with cte1 as (select FIUREID,RE_NAME,
sum(case  when Report_Type = 'STR' then Anomaly_Reports else 0 end) 'STR',
sum(case  when Report_Type = 'CTR' then Anomaly_Reports else 0 end) 'CTR',
sum(case  when Report_Type = 'NTR' then Anomaly_Reports else 0 end) 'NTR',
sum(case  when Report_Type = 'CBWTR' then Anomaly_Reports else 0 end) 'CBWTR',
sum(case  when Report_Type = 'CCR' then Anomaly_Reports else 0 end) 'CCR',
sum(case  when Report_Type = 'BDU' then Anomaly_Reports else 0 end) 'BDU',
sum(Anomaly_Reports) AS anomalies_count
from
(
select  coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, cp.Report_Type, count(distinct cp.report_id) Anomaly_Reports from

(select reportid,Report_Type,relationTypeId,personname,branch_state_code from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] (nolock) where (pan not like '%[A-Z][A-Z][A-Z][A-Z][A-Z][0-9][0-9][0-9][0-9][A-Z]%' or pan is null)) peb

inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)
where substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' ) cp on cp.Report_Id = peb.reportid
inner join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1 ) re on cp.Re_Id = re.id_
group by coalesce([oldREId],[newREId]),cp.Report_Type,trim(upper([name])))zz
group by FIUREID,RE_NAME ),

cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select distinct CTE1.FIUREID,CTE1.RE_NAME, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID

ORDER BY anomalies_count  DESC

In [101]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfP10 = pd.DataFrame(Finnet2_o)
dfP10.columns = dfP10.columns.str.upper()
display("Shape : ",dfP10.shape)
dfP10 = dfP10.reset_index()
dfP10['index'] = dfP10['index']+1
dfP10 = dfP10.rename(columns={'index':'sl. no.'})
dfP10.index = dfP10.index + 1
dfP10.head(5)

Query Executed successfully

'Shape : '

(561, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BASCB00071,HDFC BANK LIMITED,1130719,551490,48%
2,2,FICSO00020,VISA WORLDWIDE PTE. LTD,209374,209374,100%
3,3,BASCB00072,ICICI BANK LIMITED,157334,80998,51%
4,4,BASCB00079,KOTAK MAHINDRA BANK LIMITED,76817,62816,81%
5,5,BASCB00039,CANARA BANK,73696,52971,71%

##### 11-Delay in Reports filing (CTR, EFT, NTR )

In [102]:
query2_0 = f'''


with cte1 as(select concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id,Report_Type,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, Report_Id,

CONVERT(datetime,left(Fiu_Batch_Id,8)) date_of_submission
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details]cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re on cp.Re_Id = re.id_
where Report_Type!='STR'
and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31 
--and left(Fiu_Batch_Id, 6) = '202401'
--in ('202305','202306','202307','202308','202309','202310','202311','202312')
)
,cte2 as 
(
select * from
(
select distinct  reportid,'TcOne'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne]
group by reportid
union
select distinct reportid,'TcThree'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcThree]
group by reportid
union
select distinct reportid,'TcTwo'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo]
group by reportid
union
select distinct reportid,'TsEight'source,max(tradeDate) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEight]
group by reportid
union
select distinct reportid,'TsEleven'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven]
group by reportid
union
select distinct reportid,'TsFifteen'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFifteen]
group by reportid
union
select distinct reportid,'TsFive'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive]
group by reportid
union
select distinct reportid,'TsFour'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour]
group by reportid
union
select distinct reportid,'TsNine'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine]
group by reportid
--union
--select distinct reportid,'TsNineB'source,'no reporting' max_txn_date from [FINCORE_BRIDGE].[fingate_TsNineB]
--group by reportid
union
select distinct reportid,'TsOne'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne]
group by reportid
union
select distinct reportid,'TsSeven'source,max(tradeDate) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven]
group by reportid
union
select distinct reportid,'TsSix'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSix]
group by reportid
union
select distinct reportid,'TsTen'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTen]
group by reportid
union
select distinct reportid,'TsThree'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree]
group by reportid
union
select distinct reportid,'TsTwelve'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwelve]
group by reportid
union
select distinct reportid,'TsTwo'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo]
group by reportid
union
select distinct reportid,'RealEstateStr'source,max(date_) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_RealEstateStr]
group by reportid
union
select distinct reportid,'Mtss_New'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Mtss_New]
group by reportid
union
select distinct reportid,'StrVDASP'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP]
group by reportid
union
select distinct reportid,'CbwtrBank'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]
group by reportid
union
select distinct reportid,'casinoCbwtr'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_casinoCbwtr]
group by reportid
union
select distinct reportid,'general reporting'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_GenReporting]
group by reportid
)z)
,

cte3 as (select FIUREID, RE_NAME,Report_Type, count(distinct Report_Id) anomalies_count from (
select distinct cte1.*,cte2.source,max_txn_date,DATEDIFF(day,EOMONTH (max_txn_date),date_of_submission) delay_in_days 
from cte1 inner join cte2 on cte1.report_id=cte2.reportId
and DATEDIFF(day,EOMONTH (max_txn_date),date_of_submission) >= 15)a
group by FIUREID, RE_NAME,Report_Type),


cte4 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	
select cte3.FIUREID , cte3.RE_NAME ,
sum(case  when Report_Type = 'CTR' then anomalies_count else 0 end) 'CTR',
sum(case  when Report_Type = 'NTR' then anomalies_count else 0 end) 'NTR',
sum(case  when Report_Type = 'CBWTR' then anomalies_count else 0 end) 'CBWTR',
sum(case  when Report_Type = 'CCR' then anomalies_count else 0 end) 'CCR',
sum(case  when Report_Type = 'BDU' then anomalies_count else 0 end) 'BDU',total_report_count,
sum(anomalies_count) AS anomalies_count
,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage
from cte3 inner join cte4 on cte3.FIUREID = cte4.FIUREID
group by cte3.FIUREID , cte3.RE_NAME , total_report_count,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%')
ORDER BY anomalies_count  DESC

'''

print(query2_0)

with cte1 as(select concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id,Report_Type,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, Report_Id,

CONVERT(datetime,left(Fiu_Batch_Id,8)) date_of_submission
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details]cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re on cp.Re_Id = re.id_
where Report_Type!='STR'
and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
--and left(Fiu_Batch_Id, 6) = '202401'
--in ('202305','202306','202307','202308','202309','202310','202311','202312')
)
,cte2 as
(
select * from
(
select distinct  reportid,'TcOne'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne]
group by reportid
union
select distinct reportid,'TcThree'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcThree]
group by reportid
union
select distinct reportid,'TcTwo'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo]
group by reportid
union
select distinct reportid,'TsEight'source,max(tradeDate) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEight]
group by reportid
union
select distinct reportid,'TsEleven'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven]
group by reportid
union
select distinct reportid,'TsFifteen'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFifteen]
group by reportid
union
select distinct reportid,'TsFive'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive]
group by reportid
union
select distinct reportid,'TsFour'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour]
group by reportid
union
select distinct reportid,'TsNine'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine]
group by reportid
--union
--select distinct reportid,'TsNineB'source,'no reporting' max_txn_date from [FINCORE_BRIDGE].[fingate_TsNineB]
--group by reportid
union
select distinct reportid,'TsOne'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne]
group by reportid
union
select distinct reportid,'TsSeven'source,max(tradeDate) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven]
group by reportid
union
select distinct reportid,'TsSix'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSix]
group by reportid
union
select distinct reportid,'TsTen'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTen]
group by reportid
union
select distinct reportid,'TsThree'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree]
group by reportid
union
select distinct reportid,'TsTwelve'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwelve]
group by reportid
union
select distinct reportid,'TsTwo'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo]
group by reportid
union
select distinct reportid,'RealEstateStr'source,max(date_) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_RealEstateStr]
group by reportid
union
select distinct reportid,'Mtss_New'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Mtss_New]
group by reportid
union
select distinct reportid,'StrVDASP'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP]
group by reportid
union
select distinct reportid,'CbwtrBank'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]
group by reportid
union
select distinct reportid,'casinoCbwtr'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_casinoCbwtr]
group by reportid
union
select distinct reportid,'general reporting'source,max([transactionDate]) max_txn_date from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_GenReporting]
group by reportid
)z)
,

cte3 as (select FIUREID, RE_NAME,Report_Type, count(distinct Report_Id) anomalies_count from (
select distinct cte1.*,cte2.source,max_txn_date,DATEDIFF(day,EOMONTH (max_txn_date),date_of_submission) delay_in_days
from cte1 inner join cte2 on cte1.report_id=cte2.reportId
and DATEDIFF(day,EOMONTH (max_txn_date),date_of_submission) >= 15)a
group by FIUREID, RE_NAME,Report_Type),


cte4 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))

select cte3.FIUREID , cte3.RE_NAME ,
sum(case  when Report_Type = 'CTR' then anomalies_count else 0 end) 'CTR',
sum(case  when Report_Type = 'NTR' then anomalies_count else 0 end) 'NTR',
sum(case  when Report_Type = 'CBWTR' then anomalies_count else 0 end) 'CBWTR',
sum(case  when Report_Type = 'CCR' then anomalies_count else 0 end) 'CCR',
sum(case  when Report_Type = 'BDU' then anomalies_count else 0 end) 'BDU',total_report_count,
sum(anomalies_count) AS anomalies_count
,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage
from cte3 inner join cte4 on cte3.FIUREID = cte4.FIUREID
group by cte3.FIUREID , cte3.RE_NAME , total_report_count,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%')
ORDER BY anomalies_count  DESC

In [103]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfP11 = pd.DataFrame(Finnet2_o)
dfP11.columns = dfP11.columns.str.upper()
display("Shape : ",dfP11.shape)
dfP11 = dfP11.reset_index()
dfP11['index'] = dfP11['index']+1
dfP11 = dfP11.rename(columns={'index':'sl. no.'})
dfP11.index = dfP11.index + 1
dfP11.head(5)

Query Executed successfully

'Shape : '

(423, 10)

,sl. no.,FIUREID,RE_NAME,CTR,NTR,CBWTR,CCR,BDU,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BASCB00071,HDFC BANK LIMITED,808732,0,0,0,0,1130719,808732,71%
2,2,BASCB00071,HDFC BANK LIMITED,0,0,291040,0,0,1130719,291040,25%
3,3,BASCB00072,ICICI BANK LIMITED,0,0,62113,0,0,157334,62113,39%
4,4,BASCB00079,KOTAK MAHINDRA BANK LIMITED,0,0,53237,0,0,76817,53237,69%
5,5,BASCB00058,UNION BANK OF INDIA,24232,0,0,0,0,27626,24232,87%

##### 12- Mismatched/ Invalid/ Missing pincodes

In [104]:
query2_0 = f'''
with cte1 as (select FIUREID,RE_NAME,
sum(case  when Report_Type = 'STR' then Anomaly_Reports else 0 end) 'STR',
sum(case  when Report_Type = 'CTR' then Anomaly_Reports else 0 end) 'CTR',
sum(case  when Report_Type = 'NTR' then Anomaly_Reports else 0 end) 'NTR',
sum(case  when Report_Type = 'CBWTR' then Anomaly_Reports else 0 end) 'CBWTR',
sum(case  when Report_Type = 'CCR' then Anomaly_Reports else 0 end) 'CCR',
sum(case  when Report_Type = 'BDU' then Anomaly_Reports else 0 end) 'BDU',
sum(Anomaly_Reports) AS anomalies_count
from 
(
select  coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, cp.Report_Type, count(distinct cp.report_id) Anomaly_Reports from 

(select reportid,Report_Type,relationTypeId,personname,branch_state_code from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] (nolock) where  ([customer_Pincode]  not like '%[0-9][0-9][0-9][0-9][0-9][0-9]%' or [customer_Pincode] is null)) peb

inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)	
where substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31 and Fingate_Migrated_Data='N' and Report_Status = 'PASS' ) cp on cp.Report_Id = peb.reportid
inner join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1 ) re on cp.Re_Id = re.id_
group by coalesce([oldREId],[newREId]),cp.Report_Type,trim(upper([name])))zz
group by FIUREID,RE_NAME ),

cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select distinct CTE1.FIUREID,CTE1.RE_NAME, total_report_count, anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID
	
ORDER BY anomalies_count  DESC

'''

print(query2_0)

with cte1 as (select FIUREID,RE_NAME,
sum(case  when Report_Type = 'STR' then Anomaly_Reports else 0 end) 'STR',
sum(case  when Report_Type = 'CTR' then Anomaly_Reports else 0 end) 'CTR',
sum(case  when Report_Type = 'NTR' then Anomaly_Reports else 0 end) 'NTR',
sum(case  when Report_Type = 'CBWTR' then Anomaly_Reports else 0 end) 'CBWTR',
sum(case  when Report_Type = 'CCR' then Anomaly_Reports else 0 end) 'CCR',
sum(case  when Report_Type = 'BDU' then Anomaly_Reports else 0 end) 'BDU',
sum(Anomaly_Reports) AS anomalies_count
from
(
select  coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, cp.Report_Type, count(distinct cp.report_id) Anomaly_Reports from

(select reportid,Report_Type,relationTypeId,personname,branch_state_code from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] (nolock) where  ([customer_Pincode]  not like '%[0-9][0-9][0-9][0-9][0-9][0-9]%' or [customer_Pincode] is null)) peb

inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)
where substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331 and Fingate_Migrated_Data='N' and Report_Status = 'PASS' ) cp on cp.Report_Id = peb.reportid
inner join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1 ) re on cp.Re_Id = re.id_
group by coalesce([oldREId],[newREId]),cp.Report_Type,trim(upper([name])))zz
group by FIUREID,RE_NAME ),

cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select distinct CTE1.FIUREID,CTE1.RE_NAME, total_report_count, anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID

ORDER BY anomalies_count  DESC

In [105]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfP12 = pd.DataFrame(Finnet2_o)
dfP12.columns = dfP12.columns.str.upper()
display("Shape : ",dfP12.shape)
dfP12 = dfP12.reset_index()
dfP12['index'] = dfP12['index']+1
dfP12 = dfP12.rename(columns={'index':'sl. no.'})
dfP12.index = dfP12.index + 1
dfP12.head(5)
#display(data_2o.head(5))

Query Executed successfully

'Shape : '

(575, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BASCB00071,HDFC BANK LIMITED,1130719,591887,52%
2,2,FICSO00020,VISA WORLDWIDE PTE. LTD,209374,209374,100%
3,3,BASCB00072,ICICI BANK LIMITED,157334,157256,99%
4,4,BASCB00036,BANK OF BARODA,79853,79843,99%
5,5,BASCB00079,KOTAK MAHINDRA BANK LIMITED,76817,76817,100%

##### 13- Missing Person Name

In [106]:
query2_0 = f'''
with cte1 as (select FIUREID,RE_NAME,
sum(case  when Report_Type = 'STR' then Anomaly_Reports else 0 end) 'STR',
sum(case  when Report_Type = 'CTR' then Anomaly_Reports else 0 end) 'CTR',
sum(case  when Report_Type = 'NTR' then Anomaly_Reports else 0 end) 'NTR',
sum(case  when Report_Type = 'CBWTR' then Anomaly_Reports else 0 end) 'CBWTR',
sum(case  when Report_Type = 'CCR' then Anomaly_Reports else 0 end) 'CCR',
sum(case  when Report_Type = 'BDU' then Anomaly_Reports else 0 end) 'BDU',
sum(Anomaly_Reports) AS anomalies_count
from 
(
select  coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, cp.Report_Type, count(distinct cp.report_id) Anomaly_Reports from 

(select reportid,Report_Type,relationTypeId,personname,branch_state_code from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch](nolock) where personname is null) peb

inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)	
where left(fiu_Batch_id,8) between 20{Current_month_init}01 and 20{Current_month_init}31 and Fingate_Migrated_Data='N' and Report_Status = 'PASS' 
) cp on cp.Report_Id = peb.reportid
inner join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1 
) re on cp.Re_Id = re.id_
group by coalesce([oldREId],[newREId]),cp.Report_Type,trim(upper([name])))zz
group by FIUREID,RE_NAME ),

cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select distinct CTE1.FIUREID,CTE1.RE_NAME, total_report_count, anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID
	
ORDER BY anomalies_count  DESC

'''

print(query2_0)

with cte1 as (select FIUREID,RE_NAME,
sum(case  when Report_Type = 'STR' then Anomaly_Reports else 0 end) 'STR',
sum(case  when Report_Type = 'CTR' then Anomaly_Reports else 0 end) 'CTR',
sum(case  when Report_Type = 'NTR' then Anomaly_Reports else 0 end) 'NTR',
sum(case  when Report_Type = 'CBWTR' then Anomaly_Reports else 0 end) 'CBWTR',
sum(case  when Report_Type = 'CCR' then Anomaly_Reports else 0 end) 'CCR',
sum(case  when Report_Type = 'BDU' then Anomaly_Reports else 0 end) 'BDU',
sum(Anomaly_Reports) AS anomalies_count
from
(
select  coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, cp.Report_Type, count(distinct cp.report_id) Anomaly_Reports from

(select reportid,Report_Type,relationTypeId,personname,branch_state_code from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch](nolock) where personname is null) peb

inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)
where left(fiu_Batch_id,8) between 20240301 and 20240331 and Fingate_Migrated_Data='N' and Report_Status = 'PASS'
) cp on cp.Report_Id = peb.reportid
inner join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1
) re on cp.Re_Id = re.id_
group by coalesce([oldREId],[newREId]),cp.Report_Type,trim(upper([name])))zz
group by FIUREID,RE_NAME ),

cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select distinct CTE1.FIUREID,CTE1.RE_NAME, total_report_count, anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID

ORDER BY anomalies_count  DESC

In [107]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp13 = pd.DataFrame(Finnet2_o)
dfp13.columns = dfp13.columns.str.upper()
display("Shape : ",dfp13.shape)
dfp13 = dfp13.reset_index()
dfp13['index'] = dfp13['index']+1
dfp13 = dfp13.rename(columns={'index':'sl. no.'})
dfp13.index = dfp13.index + 1
dfp13.head(5)

Query Executed successfully

'Shape : '

(459, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BASCB00071,HDFC BANK LIMITED,1130719,549935,48%
2,2,FICSO00020,VISA WORLDWIDE PTE. LTD,209374,209374,100%
3,3,BASCB00072,ICICI BANK LIMITED,157334,79124,50%
4,4,BASCB00079,KOTAK MAHINDRA BANK LIMITED,76817,62481,81%
5,5,BASCB00036,BANK OF BARODA,79853,51194,64%

###### 14- Incorrect branch details & missing state in RE Branch

In [113]:
query2_0 = f'''
with cte1 as (select FIUREID,RE_NAME,
sum(case  when Report_Type = 'STR' then Anomaly_Reports else 0 end) 'STR',
sum(case  when Report_Type = 'CTR' then Anomaly_Reports else 0 end) 'CTR',
sum(case  when Report_Type = 'NTR' then Anomaly_Reports else 0 end) 'NTR',
sum(case  when Report_Type = 'CBWTR' then Anomaly_Reports else 0 end) 'CBWTR',
sum(case  when Report_Type = 'CCR' then Anomaly_Reports else 0 end) 'CCR',
sum(case  when Report_Type = 'BDU' then Anomaly_Reports else 0 end) 'BDU',
sum(Anomaly_Reports) AS anomalies_count
from 
(
select  coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, cp.Report_Type, count(distinct cp.report_id) Anomaly_Reports from 

(select reportid,Report_Type,relationTypeId,personname,branch_state_code from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] (nolock)  where branch_state_code is null ) peb

inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)	
			where substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31 and Fingate_Migrated_Data='N' and Report_Status = 'PASS' 
			) cp on cp.Report_Id = peb.reportid
inner join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1 
			) re on cp.Re_Id = re.id_
group by coalesce([oldREId],[newREId]),cp.Report_Type,trim(upper([name])))zz
group by FIUREID,RE_NAME ),

cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select DISTINCT CTE1.FIUREID,CTE1.RE_NAME, total_report_count, anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID
	
ORDER BY anomalies_count  DESC


'''

print(query2_0)

with cte1 as (select FIUREID,RE_NAME,
sum(case  when Report_Type = 'STR' then Anomaly_Reports else 0 end) 'STR',
sum(case  when Report_Type = 'CTR' then Anomaly_Reports else 0 end) 'CTR',
sum(case  when Report_Type = 'NTR' then Anomaly_Reports else 0 end) 'NTR',
sum(case  when Report_Type = 'CBWTR' then Anomaly_Reports else 0 end) 'CBWTR',
sum(case  when Report_Type = 'CCR' then Anomaly_Reports else 0 end) 'CCR',
sum(case  when Report_Type = 'BDU' then Anomaly_Reports else 0 end) 'BDU',
sum(Anomaly_Reports) AS anomalies_count
from
(
select  coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, cp.Report_Type, count(distinct cp.report_id) Anomaly_Reports from

(select reportid,Report_Type,relationTypeId,personname,branch_state_code from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] (nolock)  where branch_state_code is null ) peb

inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)
			where substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331 and Fingate_Migrated_Data='N' and Report_Status = 'PASS'
			) cp on cp.Report_Id = peb.reportid
inner join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1
			) re on cp.Re_Id = re.id_
group by coalesce([oldREId],[newREId]),cp.Report_Type,trim(upper([name])))zz
group by FIUREID,RE_NAME ),

cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select DISTINCT CTE1.FIUREID,CTE1.RE_NAME, total_report_count, anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID

ORDER BY anomalies_count  DESC

In [114]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp14 = pd.DataFrame(Finnet2_o)
dfp14.columns = dfp14.columns.str.upper()
display("Shape : ",dfp14.shape)
dfp14 = dfp14.reset_index()
dfp14['index'] = dfp14['index']+1
dfp14 = dfp14.rename(columns={'index':'sl. no.'})
dfp14.index = dfp14.index + 1
dfp14.head(5)

Query Executed successfully

'Shape : '

(542, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BASCB00071,HDFC BANK LIMITED,1130719,550034,48%
2,2,FICSO00020,VISA WORLDWIDE PTE. LTD,209374,209374,100%
3,3,BASCB00072,ICICI BANK LIMITED,157334,79730,50%
4,4,BASCB00079,KOTAK MAHINDRA BANK LIMITED,76817,62624,81%
5,5,BASCB00050,STATE BANK OF INDIA,122964,59497,48%

##### 15- Mutliple UCICs reported against a single account number and report ID

In [115]:
query2_0 = f'''
with cte1 as (select report_id, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, Report_Type
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	where Fingate_Migrated_Data='N' and Report_Status = 'PASS' --and Report_Type='CTR'  
	and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31), 
	
cte2 as (
select FIUREID,RE_NAME, concat('A-',accountno)accountno , reportId,Report_Type, count( distinct ucic) ucic_count from(
select  distinct pd.reportid,FIUREID,RE_NAME, accountno, ap.ucic,Report_Type
 from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_PersonDetail] (nolock) pd
inner join cte1 c1 on pd.reportId=c1.report_id 
inner join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountPerson] (nolock) ap
   ON pd.reportId=ap.reportId where  pd.ucic=ap.ucic   and  relationTypeId = 1
union all
select distinct ed.reportid,FIUREID,RE_NAME,accountno, ap.ucic,Report_Type
 from  [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_EntityDetail] (nolock) ed
inner join cte1  c1 on ed.reportId=c1.report_id 
inner join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountPerson] (nolock) ap
ON ed.reportId=ap.reportId where  ed.ucic=ap.ucic  and  relationTypeId = 1)a
 group by FIUREID,RE_NAME, concat('A-',accountno), reportId,Report_Type
having count( distinct ucic)>2),
cte3 as (select FIUREID,RE_NAME,count(distinct accountno)accountno_count , reportId,Report_Type from cte2
group by FIUREID,RE_NAME,reportId, Report_Type),
cte4 as (select  FIUREID,RE_NAME,Report_Type, 

case when  Report_Type='STR' then accountno_count  else 0 end as STR,                     
case when  Report_Type='CTR' then accountno_count  else 0 end as CTR,                     
case when  Report_Type='NTR' then accountno_count  else 0 end as NTR,                     
case when  Report_Type='CBWTR' then accountno_count  else 0 end as EFT,                    
case when  Report_Type='CCR' then accountno_count  else 0 end as CCR,  
case when  Report_Type='BDU' then accountno_count  else 0 end as BDU,
accountno_count as total_accountno_count
from cte3),
cte5 as (select FIUREID,RE_NAME,sum(STR) STR,sum(CTR) CTR,sum(NTR) NTR,sum(EFT) EFT,sum(CCR) CCR,sum(BDU) BDU , sum(total_accountno_count)anomalies_count 
from cte4 c4 GROUP BY FIUREID,RE_NAME),
--order by total_accountno_count desc

cte6 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select cte5.FIUREID,cte5.RE_NAME, total_report_count,anomalies_count , concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte6 join cte5 on cte6.FIUREID=cte5.FIUREID
	order by anomalies_count desc


'''

print(query2_0)

with cte1 as (select report_id, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, Report_Type
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	where Fingate_Migrated_Data='N' and Report_Status = 'PASS' --and Report_Type='CTR'
	and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331),

cte2 as (
select FIUREID,RE_NAME, concat('A-',accountno)accountno , reportId,Report_Type, count( distinct ucic) ucic_count from(
select  distinct pd.reportid,FIUREID,RE_NAME, accountno, ap.ucic,Report_Type
 from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_PersonDetail] (nolock) pd
inner join cte1 c1 on pd.reportId=c1.report_id
inner join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountPerson] (nolock) ap
   ON pd.reportId=ap.reportId where  pd.ucic=ap.ucic   and  relationTypeId = 1
union all
select distinct ed.reportid,FIUREID,RE_NAME,accountno, ap.ucic,Report_Type
 from  [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_EntityDetail] (nolock) ed
inner join cte1  c1 on ed.reportId=c1.report_id
inner join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountPerson] (nolock) ap
ON ed.reportId=ap.reportId where  ed.ucic=ap.ucic  and  relationTypeId = 1)a
 group by FIUREID,RE_NAME, concat('A-',accountno), reportId,Report_Type
having count( distinct ucic)>2),
cte3 as (select FIUREID,RE_NAME,count(distinct accountno)accountno_count , reportId,Report_Type from cte2
group by FIUREID,RE_NAME,reportId, Report_Type),
cte4 as (select  FIUREID,RE_NAME,Report_Type,

case when  Report_Type='STR' then accountno_count  else 0 end as STR,
case when  Report_Type='CTR' then accountno_count  else 0 end as CTR,
case when  Report_Type='NTR' then accountno_count  else 0 end as NTR,
case when  Report_Type='CBWTR' then accountno_count  else 0 end as EFT,
case when  Report_Type='CCR' then accountno_count  else 0 end as CCR,
case when  Report_Type='BDU' then accountno_count  else 0 end as BDU,
accountno_count as total_accountno_count
from cte3),
cte5 as (select FIUREID,RE_NAME,sum(STR) STR,sum(CTR) CTR,sum(NTR) NTR,sum(EFT) EFT,sum(CCR) CCR,sum(BDU) BDU , sum(total_accountno_count)anomalies_count
from cte4 c4 GROUP BY FIUREID,RE_NAME),
--order by total_accountno_count desc

cte6 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select cte5.FIUREID,cte5.RE_NAME, total_report_count,anomalies_count , concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte6 join cte5 on cte6.FIUREID=cte5.FIUREID
	order by anomalies_count desc

In [116]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp15 = pd.DataFrame(Finnet2_o)
dfp15.columns = dfp15.columns.str.upper()
display("Shape : ",dfp15.shape)
dfp15 = dfp15.reset_index()
dfp15['index'] = dfp15['index']+1
dfp15 = dfp15.rename(columns={'index':'sl. no.'})
dfp15.index = dfp15.index + 1
dfp15.head(5)

Query Executed successfully

'Shape : '

(61, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BASCB00071,HDFC BANK LIMITED,1130719,13643,1%
2,2,BASCB00069,THE FEDERAL BANK LTD,46076,2267,4%
3,3,BASCB00061,AXIS BANK,79450,1000,1%
4,4,BASCB00057,UCO BANK,18599,861,4%
5,5,BAUCB01880,SVC COOPERATIVE BANK LTD,1264,848,67%

###### 16- Missing/ Invalid main person name

In [117]:
query2_0 = f'''

with cte1 as (select b.FIUREID,b.RE_NAME, count(distinct b.reportid) anomalies_count from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] a
inner join [Fincore_Bridge_DB].[dbo].[batch_report] b on a.reportid=b.reportid
and SUBSTRing (cast(trim('ID-' from a.fiu_Batch_id) as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and b.report_type='STR' and mainpersonname is null and customer_state_code is not null group by b.FIUREID,b.RE_NAME),
cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31
group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
select cte1.fiureid,cte1.RE_NAME, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID
ORDER BY anomalies_count  DESC


'''

print(query2_0)

with cte1 as (select b.FIUREID,b.RE_NAME, count(distinct b.reportid) anomalies_count from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] a
inner join [Fincore_Bridge_DB].[dbo].[batch_report] b on a.reportid=b.reportid
and SUBSTRing (cast(trim('ID-' from a.fiu_Batch_id) as nvarchar), 1,8) between 20240301 and 20240331
and b.report_type='STR' and mainpersonname is null and customer_state_code is not null group by b.FIUREID,b.RE_NAME),
cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
select cte1.fiureid,cte1.RE_NAME, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID
ORDER BY anomalies_count  DESC

In [118]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp16 = pd.DataFrame(Finnet2_o)
dfp16.columns = dfp16.columns.str.upper()
display("Shape : ",dfp16.shape)
dfp16 = dfp16.reset_index()
dfp16['index'] = dfp16['index']+1
dfp16 = dfp16.rename(columns={'index':'sl. no.'})
dfp16.index = dfp16.index + 1
dfp16.head(5)

Query Executed successfully

'Shape : '

(44, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BAOTH00016,INDIA POST PAYMENTS BANK LIMITED,510,383,75%
2,2,BASCB00050,STATE BANK OF INDIA,122964,304,0%
3,3,BASCB00039,CANARA BANK,73696,171,0%
4,4,BASCB00047,PUNJAB NATIONAL BANK,19113,164,0%
5,5,BASCB00083,RBL BANK LTD,10482,133,1%

###### 17- Duplicate GoS filed

In [119]:
query2_0 = f'''

with cte1 as (select FIUREID, RE_Name, count(distinct reportid)anomalies_count from 
(SELECT b.cluster_no,b.dup_no,fiureid, re_name,fiu_batch_id,report_type,reportid,a.GOS
FROM [Fincore_Bridge_DB].[dbo].[batch_report] a
inner join (
select row_number() over ( order by dup_no desc) cluster_no, * from (
SELECT gos,count(1) dup_no
FROM [Fincore_Bridge_DB].[dbo].[batch_report] group by gos having count(1)>1) b)b on a.gos=b.gos 
where report_type='STR'
and SUBSTRing (cast(trim('ID-' from a.fiu_Batch_id) as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31)a
group by FIUREID, RE_Name ),

cte2 as (SELECT fiureid, re_name, count(distinct reportid) total_report_count 
FROM [Fincore_Bridge_DB].[dbo].[batch_report]  br 
where SUBSTRing (cast(trim('ID-' from fiu_Batch_id) as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31 and br.report_type='STR'
group by fiureid, re_name )
select cte1.fiureid, cte1.re_name,total_report_count ,anomalies_count,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage 
from cte1 join cte2 on 
cte2.fiureid=cte1.fiureid
order by anomalies_count desc


'''

print(query2_0)

with cte1 as (select FIUREID, RE_Name, count(distinct reportid)anomalies_count from
(SELECT b.cluster_no,b.dup_no,fiureid, re_name,fiu_batch_id,report_type,reportid,a.GOS
FROM [Fincore_Bridge_DB].[dbo].[batch_report] a
inner join (
select row_number() over ( order by dup_no desc) cluster_no, * from (
SELECT gos,count(1) dup_no
FROM [Fincore_Bridge_DB].[dbo].[batch_report] group by gos having count(1)>1) b)b on a.gos=b.gos
where report_type='STR'
and SUBSTRing (cast(trim('ID-' from a.fiu_Batch_id) as nvarchar), 1,8) between 20240301 and 20240331)a
group by FIUREID, RE_Name ),

cte2 as (SELECT fiureid, re_name, count(distinct reportid) total_report_count
FROM [Fincore_Bridge_DB].[dbo].[batch_report]  br
where SUBSTRing (cast(trim('ID-' from fiu_Batch_id) as nvarchar), 1,8) between 20240301 and 20240331 and br.report_type='STR'
group by fiureid, re_name )
select cte1.fiureid, cte1.re_name,total_report_count ,anomalies_count,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage
from cte1 join cte2 on
cte2.fiureid=cte1.fiureid
order by anomalies_count desc

In [120]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp17 = pd.DataFrame(Finnet2_o)
dfp17.columns = dfp17.columns.str.upper()
display("Shape : ",dfp17.shape)
dfp17 = dfp17.reset_index()
dfp17['index'] = dfp17['index']+1
dfp17 = dfp17.rename(columns={'index':'sl. no.'})
dfp17.index = dfp17.index + 1
dfp17.head(5)

Query Executed successfully

'Shape : '

(7, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BASCB00039,CANARA BANK,2394,4,0%
2,2,BASCB00126,EQUITAS SMALL FINANCE BANK LIMITED,120,2,1%
3,3,BA00036412,THE VERAVAL PEOPLES CO OP BANK LTD,3,2,66%
4,4,BA00019905,SARASWAT COOP BANK LIMITED BOMBAY,778,2,0%
5,5,BASCB00050,STATE BANK OF INDIA,2006,1,0%

##### 18- Multiple GoS reported against single reportid

In [121]:
query2_0 = f'''

with cte1 as (select fiureid, re_name,report_type, count(distinct reportid) anomalies_count from(
select fiureid, re_name,report_type,reportid, count(distinct gos) Multiple_gos FROM [Fincore_Bridge_DB].[dbo].[batch_report] a
where report_type='STR'and SUBSTRing (cast(trim('ID-' from a.fiu_Batch_id) as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
group by fiureid, re_name,report_type,reportid
having count( distinct gos)>2)a
group by fiureid, re_name,report_type),
cte2 as (SELECT fiureid, re_name, count(distinct reportid) total_report_count 
FROM [Fincore_Bridge_DB].[dbo].[batch_report]  br 
where SUBSTRing (cast(trim('ID-' from fiu_Batch_id) as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and br.report_type='STR'
group by fiureid, re_name )

select cte1.fiureid, cte1.re_name,total_report_count ,anomalies_count,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage 
from cte1 join cte2 on 

cte2.fiureid=cte1.fiureid
order by anomalies_count desc


'''

print(query2_0)

with cte1 as (select fiureid, re_name,report_type, count(distinct reportid) anomalies_count from(
select fiureid, re_name,report_type,reportid, count(distinct gos) Multiple_gos FROM [Fincore_Bridge_DB].[dbo].[batch_report] a
where report_type='STR'and SUBSTRing (cast(trim('ID-' from a.fiu_Batch_id) as nvarchar), 1,8) between 20240301 and 20240331
group by fiureid, re_name,report_type,reportid
having count( distinct gos)>2)a
group by fiureid, re_name,report_type),
cte2 as (SELECT fiureid, re_name, count(distinct reportid) total_report_count
FROM [Fincore_Bridge_DB].[dbo].[batch_report]  br
where SUBSTRing (cast(trim('ID-' from fiu_Batch_id) as nvarchar), 1,8) between 20240301 and 20240331
and br.report_type='STR'
group by fiureid, re_name )

select cte1.fiureid, cte1.re_name,total_report_count ,anomalies_count,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage
from cte1 join cte2 on

cte2.fiureid=cte1.fiureid
order by anomalies_count desc

In [122]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp18 = pd.DataFrame(Finnet2_o)
dfp18.columns = dfp18.columns.str.upper()
display("Shape : ",dfp18.shape)
dfp18 = dfp18.reset_index()
dfp18['index'] = dfp18['index']+1
dfp18 = dfp18.rename(columns={'index':'sl. no.'})
dfp18.index = dfp18.index + 1
dfp18.head(5)

Query Executed successfully

'Shape : '

(0, 5)

Empty DataFrame
Columns: [sl. no., FIUREID, RE_NAME, TOTAL_REPORT_COUNT, ANOMALIES_COUNT, ANOMALIES_PERCENTAGE]
Index: []

##### 19- STR with missing GoS

In [123]:
query2_0 = f'''

with cte1 as (SELECT  fiureid, re_name, count(distinct reportid) anomalies_count FROM [Fincore_Bridge_DB].[dbo].[batch_report]
where gos is null and report_type='STR'and SUBSTRing (cast(trim('ID-' from fiu_Batch_id) as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
group by fiureid, re_name),
cte2 as (SELECT fiureid, re_name, count(distinct reportid) total_report_count 
FROM [Fincore_Bridge_DB].[dbo].[batch_report]  br 
where SUBSTRing (cast(trim('ID-' from fiu_Batch_id) as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31 and br.report_type='STR'
group by fiureid, re_name )
select cte1.fiureid, cte1.re_name,total_report_count ,anomalies_count,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage 
from cte1 join cte2 on cte2.fiureid=cte1.fiureid
order by anomalies_count desc



'''

print(query2_0)

with cte1 as (SELECT  fiureid, re_name, count(distinct reportid) anomalies_count FROM [Fincore_Bridge_DB].[dbo].[batch_report]
where gos is null and report_type='STR'and SUBSTRing (cast(trim('ID-' from fiu_Batch_id) as nvarchar), 1,8) between 20240301 and 20240331
group by fiureid, re_name),
cte2 as (SELECT fiureid, re_name, count(distinct reportid) total_report_count
FROM [Fincore_Bridge_DB].[dbo].[batch_report]  br
where SUBSTRing (cast(trim('ID-' from fiu_Batch_id) as nvarchar), 1,8) between 20240301 and 20240331 and br.report_type='STR'
group by fiureid, re_name )
select cte1.fiureid, cte1.re_name,total_report_count ,anomalies_count,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage
from cte1 join cte2 on cte2.fiureid=cte1.fiureid
order by anomalies_count desc

In [124]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp19 = pd.DataFrame(Finnet2_o)
dfp19.columns = dfp19.columns.str.upper()
display("Shape : ",dfp19.shape)
dfp19 = dfp19.reset_index()
dfp19['index'] = dfp19['index']+1
dfp19 = dfp19.rename(columns={'index':'sl. no.'})
dfp19.index = dfp19.index + 1
dfp19.head(5)

Query Executed successfully

'Shape : '

(0, 5)

Empty DataFrame
Columns: [sl. no., FIUREID, RE_NAME, TOTAL_REPORT_COUNT, ANOMALIES_COUNT, ANOMALIES_PERCENTAGE]
Index: []

##### 20- Incorrect relation flag  (account relationship id) : Atleast 1 account as accountholder

In [125]:
query2_0 = f'''

with cte1 as (select  coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, count(distinct cp.report_id) anomalies_count from 

(select reportid,Report_Type,relationTypeId,personname,branch_state_code from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] (nolock) where relationTypeId !=1) peb

inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)
where left(fiu_Batch_id,8) between 20{Current_month_init}01 and 20{Current_month_init}31 and Report_Type = 'CTR'
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' 
) cp on cp.Report_Id = peb.reportid
inner join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1 
) re on cp.Re_Id = re.id_
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31 and Report_Type = 'CTR'
group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
select cte1.FIUREID, cte1.RE_NAME, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID

order by anomalies_count desc



'''

print(query2_0)

with cte1 as (select  coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, count(distinct cp.report_id) anomalies_count from

(select reportid,Report_Type,relationTypeId,personname,branch_state_code from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] (nolock) where relationTypeId !=1) peb

inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)
where left(fiu_Batch_id,8) between 20240301 and 20240331 and Report_Type = 'CTR'
and Fingate_Migrated_Data='N' and Report_Status = 'PASS'
) cp on cp.Report_Id = peb.reportid
inner join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1
) re on cp.Re_Id = re.id_
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331 and Report_Type = 'CTR'
group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
select cte1.FIUREID, cte1.RE_NAME, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID

order by anomalies_count desc

In [126]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp20 = pd.DataFrame(Finnet2_o)
dfp20.columns = dfp20.columns.str.upper()
display("Shape : ",dfp20.shape)
dfp20 = dfp20.reset_index()
dfp20['index'] = dfp20['index']+1
dfp20 = dfp20.rename(columns={'index':'sl. no.'})
dfp20.index = dfp20.index + 1
dfp20.head(5)

Query Executed successfully

'Shape : '

(243, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BASCB00071,HDFC BANK LIMITED,810135,375704,46%
2,2,BASCB00072,ICICI BANK LIMITED,85218,35595,41%
3,3,BASCB00061,AXIS BANK,49357,20174,40%
4,4,BASCB00037,BANK OF INDIA,26285,16566,63%
5,5,BASCB00089,YES BANK LIMITED,8826,7326,83%

###### 21- CTRs filed without geographical details such as State code or pin code

In [127]:
query2_0 = f'''

with cte1 as (select b.FIUREID,b.RE_NAME, count(distinct b.reportid) anomalies_count from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] a
inner join [Fincore_Bridge_DB].[dbo].[batch_report] b on a.reportid=b.reportid
and SUBSTRing (cast(trim('ID-' from a.fiu_Batch_id) as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
  where b.Report_Type='CTR' and customer_state_code is null AND customer_pincode is null
  group by b.FIUREID,b.RE_NAME),

cte2 as (SELECT fiureid, re_name, count(distinct reportid) total_report_count 
FROM [Fincore_Bridge_DB].[dbo].[batch_report]  br 
where SUBSTRing (cast(trim('ID-' from fiu_Batch_id) as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31 and br.report_type='CTR'
group by fiureid, re_name )
select cte1.fiureid, cte1.re_name,total_report_count ,anomalies_count,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage 
from cte1 join cte2 on 
cte2.fiureid=cte1.fiureid
order by anomalies_count desc




'''

print(query2_0)

with cte1 as (select b.FIUREID,b.RE_NAME, count(distinct b.reportid) anomalies_count from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] a
inner join [Fincore_Bridge_DB].[dbo].[batch_report] b on a.reportid=b.reportid
and SUBSTRing (cast(trim('ID-' from a.fiu_Batch_id) as nvarchar), 1,8) between 20240301 and 20240331
  where b.Report_Type='CTR' and customer_state_code is null AND customer_pincode is null
  group by b.FIUREID,b.RE_NAME),

cte2 as (SELECT fiureid, re_name, count(distinct reportid) total_report_count
FROM [Fincore_Bridge_DB].[dbo].[batch_report]  br
where SUBSTRing (cast(trim('ID-' from fiu_Batch_id) as nvarchar), 1,8) between 20240301 and 20240331 and br.report_type='CTR'
group by fiureid, re_name )
select cte1.fiureid, cte1.re_name,total_report_count ,anomalies_count,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage
from cte1 join cte2 on
cte2.fiureid=cte1.fiureid
order by anomalies_count desc

In [128]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp21 = pd.DataFrame(Finnet2_o)
dfp21.columns = dfp21.columns.str.upper()
display("Shape : ",dfp21.shape)
dfp21 = dfp21.reset_index()
dfp21['index'] = dfp21['index']+1
dfp21 = dfp21.rename(columns={'index':'sl. no.'})
dfp21.index = dfp21.index + 1
dfp21.head(5)

Query Executed successfully

'Shape : '

(348, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BASCB00071,HDFC BANK LIMITED,810135,321879,39%
2,2,BASCB00036,BANK OF BARODA,71693,45117,62%
3,3,BASCB00039,CANARA BANK,53219,34985,65%
4,4,BASCB00072,ICICI BANK LIMITED,85218,32993,38%
5,5,BASCB00061,AXIS BANK,49357,17481,35%

###### 22- Same accounts are reported across different CTRs with different State code and branch details

In [129]:
query2_0 = f'''

with cte1 as ( select coalesce(oldreid,newreid) fiureid,reportid,customer_account,branch_state_code,customer_state_code, Rename 
from  [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] pe 
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp on pe.reportid = cp.Report_Id 
INNER JOIN [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re on re.id_ = cp.Re_Id
and SUBSTRing (cast(trim('ID-' from PE.fiu_Batch_id) as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31 and customer_account<> 'A-' AND CP.Report_Type = 'CTR') ,


CTE2 AS (select c1.Rename,c1.fiureid, count(distinct c1.reportid) anomalies_count from cte1 c1, cte1 c2 
where c1.customer_account = c2.customer_account and c1.reportid = c2.reportid and  c1.branch_state_code <> c2.branch_state_code 
group by c1.rename, c1.fiureid ),


cte3 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31 
	group by coalesce([oldREId],[newREId]) ,trim(upper([name]))
	)
select cte2.fiureid,cte2.rename, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte3 on cte3.FIUREID=cte2.FIUREID order by anomalies_count desc



'''

print(query2_0)

with cte1 as ( select coalesce(oldreid,newreid) fiureid,reportid,customer_account,branch_state_code,customer_state_code, Rename
from  [Fincore_Bridge_DB].[FINCORE_BRIDGE].[person_entity_branch] pe
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp on pe.reportid = cp.Report_Id
INNER JOIN [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re on re.id_ = cp.Re_Id
and SUBSTRing (cast(trim('ID-' from PE.fiu_Batch_id) as nvarchar), 1,8) between 20240301 and 20240331 and customer_account<> 'A-' AND CP.Report_Type = 'CTR') ,


CTE2 AS (select c1.Rename,c1.fiureid, count(distinct c1.reportid) anomalies_count from cte1 c1, cte1 c2
where c1.customer_account = c2.customer_account and c1.reportid = c2.reportid and  c1.branch_state_code <> c2.branch_state_code
group by c1.rename, c1.fiureid ),


cte3 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
	group by coalesce([oldREId],[newREId]) ,trim(upper([name]))
	)
select cte2.fiureid,cte2.rename, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte3 on cte3.FIUREID=cte2.FIUREID order by anomalies_count desc

In [130]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp22 = pd.DataFrame(Finnet2_o)
dfp22.columns = dfp22.columns.str.upper()
display("Shape : ",dfp22.shape)
dfp22 = dfp22.reset_index()
dfp22['index'] = dfp22['index']+1
dfp22 = dfp22.rename(columns={'index':'sl. no.'})
dfp22.index = dfp22.index + 1
dfp22.head(5)

Query Executed successfully

'Shape : '

(2, 5)

,sl. no.,FIUREID,RENAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BASCB00072,ICICI Bank Limited,157334,352,0%
2,2,BASCB00037,Bank Of India,32071,1,0%

###### 23- Invalid transaction date

In [131]:
query2_0 = f'''

with cte1 as (
select  coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, count(distinct cp.report_id) Anomaly_Reports from 

(select reportId,transactionDate from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] (nolock) 
union 
 select reportId,transactionDate from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] (nolock) 
) peb

inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)	
			where left(fiu_Batch_id,8) between 20{Current_month_init}01 and 20{Current_month_init}31 
			and Report_Type = 'CTR' and Fingate_Migrated_Data='N' and Report_Status = 'PASS' 
			) cp on cp.Report_Id = peb.reportid 
			and (left(transactionDate,4) not in ('2012','2013','2014','2015','2016','2017','2018','2019','2020','2021','2022',	'2023',	'2024')
				or left(transactionDate,4) > left(cast(getdate() as date),4))
left join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1 
			) re on cp.Re_Id = re.id_

group by coalesce([oldREId],[newREId]),trim(upper([name]))
),

cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31 and Report_Type = 'CTR'
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))

	select cte2.FIUREID , cte2.RE_NAME , total_report_count , Anomaly_Reports ,  concat(cast((Anomaly_Reports*100 / total_report_count) as double precision),'%') anomalies_percentage 
	from cte2 inner join cte1 on cte1.FIUREID = cte2.FIUREID

'''

print(query2_0)

with cte1 as (
select  coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, count(distinct cp.report_id) Anomaly_Reports from

(select reportId,transactionDate from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] (nolock)
union
 select reportId,transactionDate from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] (nolock)
) peb

inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)
			where left(fiu_Batch_id,8) between 20240301 and 20240331
			and Report_Type = 'CTR' and Fingate_Migrated_Data='N' and Report_Status = 'PASS'
			) cp on cp.Report_Id = peb.reportid
			and (left(transactionDate,4) not in ('2012','2013','2014','2015','2016','2017','2018','2019','2020','2021','2022',	'2023',	'2024')
				or left(transactionDate,4) > left(cast(getdate() as date),4))
left join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1
			) re on cp.Re_Id = re.id_

group by coalesce([oldREId],[newREId]),trim(upper([name]))
),

cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331 and Report_Type = 'CTR'
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))

	select cte2.FIUREID , cte2.RE_NAME , total_report_count , Anomaly_Reports ,  concat(cast((Anomaly_Reports*100 / total_report_count) as double precision),'%') anomalies_percentage
	from cte2 inner join cte1 on cte1.FIUREID = cte2.FIUREID

In [132]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp23 = pd.DataFrame(Finnet2_o)
dfp23.columns = dfp23.columns.str.upper()
display("Shape : ",dfp23.shape)
dfp23 = dfp23.reset_index()
dfp23['index'] = dfp23['index']+1
dfp23 = dfp23.rename(columns={'index':'sl. no.'})
dfp23.index = dfp23.index + 1
dfp23.head(5)

Query Executed successfully

'Shape : '

(1, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALY_REPORTS,ANOMALIES_PERCENTAGE
1,1,BASCO00006,THE CHANDIGARH STATE CO-OPERATIVE BANK LIMITED,11,1,9%

###### 24- Missing records in Account Person table

In [135]:
query2_0 = f'''

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, Report_Id
from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
where Report_Type='CTR' 
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31),
cte2 as( select  reportId from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountPerson] ),
cte3 as (select FIUREID,RE_NAME, COUNT(REPORT_ID)anomalies_count  from cte1  left outer join cte2 on cte1.Report_Id=cte2.reportId where cte2.reportId is null
GROUP BY FIUREID,re_nAME),
cte4 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_ and
	substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select cte3.fiureid,cte3.RE_NAME, total_report_count, anomalies_count,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte4 join cte3 on cte4.FIUREID=cte3.FIUREID
	
ORDER BY anomalies_count  DESC

'''

print(query2_0)

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, Report_Id
from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
where Report_Type='CTR'
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331),
cte2 as( select  reportId from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountPerson] ),
cte3 as (select FIUREID,RE_NAME, COUNT(REPORT_ID)anomalies_count  from cte1  left outer join cte2 on cte1.Report_Id=cte2.reportId where cte2.reportId is null
GROUP BY FIUREID,re_nAME),
cte4 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_ and
	substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select cte3.fiureid,cte3.RE_NAME, total_report_count, anomalies_count,concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte4 join cte3 on cte4.FIUREID=cte3.FIUREID

ORDER BY anomalies_count  DESC

In [136]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp24 = pd.DataFrame(Finnet2_o)
dfp24.columns = dfp24.columns.str.upper()
display("Shape : ",dfp24.shape)
dfp24 = dfp24.reset_index()
dfp24['index'] = dfp24['index']+1
dfp24 = dfp24.rename(columns={'index':'sl. no.'})
dfp24.index = dfp24.index + 1
dfp24.head(5)

Query Executed successfully

'Shape : '

(127, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BASCB00075,IDBI BANK LTD,13551,2352,17%
2,2,BASCB00086,SOUTH INDIAN BANK LIMITED,3693,2264,61%
3,3,BASCB00071,HDFC BANK LIMITED,1130719,1420,0%
4,4,BARRB00259,MADHYA PRADESH GRAMIN BANK,4504,1212,26%
5,5,BASCO00015,THE KERALA STATE CO-OPERATIVE BANK LIMITED,1013,725,71%

###### 25- Missing records in Account Details table

In [137]:
query2_0 = f'''

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, Report_Id
from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
where Report_Type='CTR' 
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31),
cte2 as( select  reportId from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountDetail] ),
cte3 as (select FIUREID,RE_NAME, COUNT(REPORT_ID)anomalies_count  from cte1  left outer join cte2 on cte1.Report_Id=cte2.reportId where cte2.reportId is null
GROUP BY FIUREID,re_nAME),
cte4 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_ and
	substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240101  and 20240131
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select cte3.FIUREID,cte3.RE_NAME, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte4 join cte3 on cte4.FIUREID=cte3.FIUREID
	
ORDER BY anomalies_count  DESC

'''

print(query2_0)

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, Report_Id
from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
where Report_Type='CTR'
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331),
cte2 as( select  reportId from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_AccountDetail] ),
cte3 as (select FIUREID,RE_NAME, COUNT(REPORT_ID)anomalies_count  from cte1  left outer join cte2 on cte1.Report_Id=cte2.reportId where cte2.reportId is null
GROUP BY FIUREID,re_nAME),
cte4 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_ and
	substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240101  and 20240131
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select cte3.FIUREID,cte3.RE_NAME, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte4 join cte3 on cte4.FIUREID=cte3.FIUREID

ORDER BY anomalies_count  DESC

In [138]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp25 = pd.DataFrame(Finnet2_o)
dfp25.columns = dfp25.columns.str.upper()
display("Shape : ",dfp25.shape)
dfp25 = dfp25.reset_index()
dfp25['index'] = dfp25['index']+1
dfp25 = dfp25.rename(columns={'index':'sl. no.'})
dfp25.index = dfp25.index + 1
dfp25.head(5)

Query Executed successfully

'Shape : '

(59, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BASCB00086,SOUTH INDIAN BANK LIMITED,24,2264,9433%
2,2,BADCB00044,BELGAUM DISTRICT CENTRAL CO-OPERATIVE BANK LIM...,328,642,195%
3,3,BADCB00002,THE AHMEDABAD DISTRICT CO-OPERATIVE BANK LIMITED,280,503,179%
4,4,BASCB00047,PUNJAB NATIONAL BANK,20003,458,2%
5,5,BASCO00014,THE KARNATAKA STATE CO-OPERATIVE APEX BANK LIM...,1097,246,22%

###### 26- Missing records in Person Details/Entity Details table

In [139]:
query2_0 = f'''

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, Report_Id
 from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_ where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1  and Report_Type='CTR' 
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31),
cte2 as( 
select  reportId from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_PersonDetail] union
select  reportId from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_EntityDetail]),
cte3 as (select FIUREID,RE_NAME,COUNT(distinct report_id) anomalies_count from cte1  left outer join cte2 on cte1.Report_Id=cte2.reportId where cte2.reportId is null
 group by FIUREID,RE_NAME),


 cte4 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_ and
	substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select cte3.FIUREID,cte3.RE_NAME, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte4 join cte3 on cte4.FIUREID=cte3.FIUREID
	
ORDER BY anomalies_count  DESC


'''

print(query2_0)

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, Report_Id
 from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_ where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1  and Report_Type='CTR'
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331),
cte2 as(
select  reportId from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_PersonDetail] union
select  reportId from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_EntityDetail]),
cte3 as (select FIUREID,RE_NAME,COUNT(distinct report_id) anomalies_count from cte1  left outer join cte2 on cte1.Report_Id=cte2.reportId where cte2.reportId is null
 group by FIUREID,RE_NAME),


 cte4 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_ and
	substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select cte3.FIUREID,cte3.RE_NAME, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte4 join cte3 on cte4.FIUREID=cte3.FIUREID

ORDER BY anomalies_count  DESC

In [140]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp26 = pd.DataFrame(Finnet2_o)
dfp26.columns = dfp26.columns.str.upper()
display("Shape : ",dfp26.shape)
dfp26 = dfp26.reset_index()
dfp26['index'] = dfp26['index']+1
dfp26 = dfp26.rename(columns={'index':'sl. no.'})
dfp26.index = dfp26.index + 1
dfp26.head(5)

Query Executed successfully

'Shape : '

(23, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,FI00019528,EBIXCASH WORLD MONEY LTD,100,100,100%
2,2,FICSO00020,VISA WORLDWIDE PTE. LTD,209374,33,0%
3,3,FIAPR00122,THOMAS COOK (INDIA) LTD,1207,18,1%
4,4,FICSO00010,MASTERCARD ASIA/PACIFIC PTE. LIMITED,201,17,8%
5,5,FIAPR01278,LULU FOREX PRIVATE LIMITED,8,8,100%

###### 27- CCRs reports which have been filed without Transaction Data which contain currency serial numbers

In [143]:
query2_0 = f'''

with cte1 as (
select coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, count(distinct cps.report_id) Anomaly_Reports from (
select a.reportId,accountNumber,accountHolderName,dateOfDetection,ciSerialNumbers,currencyCode,totalAmount 
from 
	(select id_,batchId,reportId,accountNumber,accountHolderName,transactionId,dateOfDetection,detectedAt,ficn,policeInformed,policeReportDetails,totalAmount from [FINCORE_BRIDGE].[fingate_ccr] a where reportType = 'CCR') a
inner join (select ccrId,reportId,ciType,ciDenomination,ciCount,ciSerialNumbers,currencyCode from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Counterfeit] ) b 
on  a.id_ = b.ccrId and  a.reportId = b.reportId)z
inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)	
			where left(fiu_Batch_id,8) between 20{Current_month_init}01 and 20{Current_month_init}31 and Report_Type= 'CCR' and Fingate_Migrated_Data='N' and Report_Status = 'PASS' --AND Re_Id = 727
			) cps on cps.Report_Id = z.reportId
left join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1 
			) re on cps.Re_Id = re.id_
where totalAmount is null or totalAmount = 0

and ciSerialNumbers is not null
group by coalesce([oldREId],[newREId]),trim(upper([name]))
),


cte2 as (
select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31 
	group by coalesce([oldREId],[newREId]) ,trim(upper([name]))

)


select cte1.FIUREID,cte1.RE_NAME , cte2.total_report_count ,Anomaly_Reports, concat(cast((Anomaly_Reports*100 / total_report_count) as double precision),'%') anomalies_percentage from cte1 inner join cte2 on cte1.FIUREID = cte2.FIUREID
order by Anomaly_Reports desc


'''

print(query2_0)

with cte1 as (
select coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, count(distinct cps.report_id) Anomaly_Reports from (
select a.reportId,accountNumber,accountHolderName,dateOfDetection,ciSerialNumbers,currencyCode,totalAmount
from
	(select id_,batchId,reportId,accountNumber,accountHolderName,transactionId,dateOfDetection,detectedAt,ficn,policeInformed,policeReportDetails,totalAmount from [FINCORE_BRIDGE].[fingate_ccr] a where reportType = 'CCR') a
inner join (select ccrId,reportId,ciType,ciDenomination,ciCount,ciSerialNumbers,currencyCode from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Counterfeit] ) b
on  a.id_ = b.ccrId and  a.reportId = b.reportId)z
inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)
			where left(fiu_Batch_id,8) between 20240301 and 20240331 and Report_Type= 'CCR' and Fingate_Migrated_Data='N' and Report_Status = 'PASS' --AND Re_Id = 727
			) cps on cps.Report_Id = z.reportId
left join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1
			) re on cps.Re_Id = re.id_
where totalAmount is null or totalAmount = 0

and ciSerialNumbers is not null
group by coalesce([oldREId],[newREId]),trim(upper([name]))
),


cte2 as (
select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
	group by coalesce([oldREId],[newREId]) ,trim(upper([name]))

)


select cte1.FIUREID,cte1.RE_NAME , cte2.total_report_count ,Anomaly_Reports, concat(cast((Anomaly_Reports*100 / total_report_count) as double precision),'%') anomalies_percentage from cte1 inner join cte2 on cte1.FIUREID = cte2.FIUREID
order by Anomaly_Reports desc

In [144]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp27 = pd.DataFrame(Finnet2_o)
dfp27.columns = dfp27.columns.str.upper()
display("Shape : ",dfp27.shape)
dfp27 = dfp27.reset_index()
dfp27['index'] = dfp27['index']+1
dfp27 = dfp27.rename(columns={'index':'sl. no.'})
dfp27.index = dfp27.index + 1
dfp27.head(5)

Query Executed successfully

'Shape : '

(0, 5)

Empty DataFrame
Columns: [sl. no., FIUREID, RE_NAME, TOTAL_REPORT_COUNT, ANOMALY_REPORTS, ANOMALIES_PERCENTAGE]
Index: []

###### 28- Date of Tendering is incorrectly filed.

In [160]:
query2_0 = f'''

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, count(distinct cps.report_id) Anomaly_Reports from (
select a.reportId,accountNumber,accountHolderName,dateOfDetection,ciSerialNumbers,currencyCode,totalAmount 
from 
	(select id_,batchId,reportId,accountNumber,accountHolderName,transactionId,dateOfDetection,detectedAt,ficn,policeInformed,policeReportDetails,totalAmount from [FINCORE_BRIDGE].[fingate_ccr] a where reportType = 'CCR') a
inner join (select ccrId,reportId,ciType,ciDenomination,ciCount,ciSerialNumbers,currencyCode from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Counterfeit] ) b 
on  a.id_ = b.ccrId and  a.reportId = b.reportId)z
inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)	
			where left(fiu_Batch_id,8) between 20{Current_month_init}01 and 20{Current_month_init}31 and Report_Type= 'CCR' and Fingate_Migrated_Data='N' and Report_Status = 'PASS' --AND Re_Id = 727
			) cps on cps.Report_Id = z.reportId
left join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1 
			) re on cps.Re_Id = re.id_
where 1=1 
--and accountNumber is null
and left(dateOfDetection,4) not in ('2012','2013','2014','2015','2016','2017',	'2018','2019','2020','2021','2022',	'2023',	'2024')
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (
select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31 
	group by coalesce([oldREId],[newREId]) ,trim(upper([name]))

)


select cte1.FIUREID,cte1.RE_NAME , cte2.total_report_count ,Anomaly_Reports  , concat(cast((Anomaly_Reports*100 / total_report_count) as double precision),'%') anomalies_percentage from cte1 inner join cte2 on cte1.FIUREID = cte2.FIUREID 
order by Anomaly_Reports desc


'''

print(query2_0)

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, count(distinct cps.report_id) Anomaly_Reports from (
select a.reportId,accountNumber,accountHolderName,dateOfDetection,ciSerialNumbers,currencyCode,totalAmount
from
	(select id_,batchId,reportId,accountNumber,accountHolderName,transactionId,dateOfDetection,detectedAt,ficn,policeInformed,policeReportDetails,totalAmount from [FINCORE_BRIDGE].[fingate_ccr] a where reportType = 'CCR') a
inner join (select ccrId,reportId,ciType,ciDenomination,ciCount,ciSerialNumbers,currencyCode from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Counterfeit] ) b
on  a.id_ = b.ccrId and  a.reportId = b.reportId)z
inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)
			where left(fiu_Batch_id,8) between 20240301 and 20240331 and Report_Type= 'CCR' and Fingate_Migrated_Data='N' and Report_Status = 'PASS' --AND Re_Id = 727
			) cps on cps.Report_Id = z.reportId
left join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1
			) re on cps.Re_Id = re.id_
where 1=1
--and accountNumber is null
and left(dateOfDetection,4) not in ('2012','2013','2014','2015','2016','2017',	'2018','2019','2020','2021','2022',	'2023',	'2024')
group by coalesce([oldREId],[newREId]),trim(upper([name]))),

cte2 as (
select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
	group by coalesce([oldREId],[newREId]) ,trim(upper([name]))

)


select cte1.FIUREID,cte1.RE_NAME , cte2.total_report_count ,Anomaly_Reports  , concat(cast((Anomaly_Reports*100 / total_report_count) as double precision),'%') anomalies_percentage from cte1 inner join cte2 on cte1.FIUREID = cte2.FIUREID
order by Anomaly_Reports desc

In [161]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp28 = pd.DataFrame(Finnet2_o)
dfp28.columns = dfp28.columns.str.upper()
display("Shape : ",dfp28.shape)
dfp28 = dfp28.reset_index()
dfp28['index'] = dfp28['index']+1
dfp28 = dfp28.rename(columns={'index':'sl. no.'})
dfp28.index = dfp28.index + 1
dfp28.head(5)

Query Executed successfully

'Shape : '

(0, 5)

Empty DataFrame
Columns: [sl. no., FIUREID, RE_NAME, TOTAL_REPORT_COUNT, ANOMALY_REPORTS, ANOMALIES_PERCENTAGE]
Index: []

###### 29- Missing account Number

In [162]:
query2_0 = f'''

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, count(distinct cps.report_id) anomalies_count from (
select a.reportId,accountNumber,accountHolderName,dateOfDetection,ciSerialNumbers,currencyCode,totalAmount 
from 
	(select id_,batchId,reportId,accountNumber,accountHolderName,transactionId,dateOfDetection,detectedAt,ficn,policeInformed,policeReportDetails,totalAmount from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_ccr] a where reportType = 'CCR') a
inner join (select ccrId,reportId,ciType,ciDenomination,ciCount,ciSerialNumbers,currencyCode from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Counterfeit] ) b 
on  a.id_ = b.ccrId and  a.reportId = b.reportId)z
inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)	
			where left(fiu_Batch_id,8) between 20{Current_month_init}01 and 20{Current_month_init}31 and Report_Type= 'CCR' and Fingate_Migrated_Data='N' and Report_Status = 'PASS' --AND Re_Id = 727
			) cps on cps.Report_Id = z.reportId
left join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1 
			) re on cps.Re_Id = re.id_
where accountNumber is null
group by coalesce([oldREId],[newREId]),trim(upper([name]))),



cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20{Current_month_init}01  and 20{Current_month_init}31
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select distinct cte1.FIUREID,CTE1.RE_NAME, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID
	
ORDER BY anomalies_count  DESC


'''

print(query2_0)

with cte1 as (select coalesce([oldREId],[newREId]) as FIUREID, trim(upper([name])) as RE_NAME, count(distinct cps.report_id) anomalies_count from (
select a.reportId,accountNumber,accountHolderName,dateOfDetection,ciSerialNumbers,currencyCode,totalAmount
from
	(select id_,batchId,reportId,accountNumber,accountHolderName,transactionId,dateOfDetection,detectedAt,ficn,policeInformed,policeReportDetails,totalAmount from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_ccr] a where reportType = 'CCR') a
inner join (select ccrId,reportId,ciType,ciDenomination,ciCount,ciSerialNumbers,currencyCode from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Counterfeit] ) b
on  a.id_ = b.ccrId and  a.reportId = b.reportId)z
inner join (select Report_Id,Re_Id,Report_Type from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] (nolock)
			where left(fiu_Batch_id,8) between 20240301 and 20240331 and Report_Type= 'CCR' and Fingate_Migrated_Data='N' and Report_Status = 'PASS' --AND Re_Id = 727
			) cps on cps.Report_Id = z.reportId
left join ( select id_,oldREId,newREId,name from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] (nolock)  where active_=1
			) re on cps.Re_Id = re.id_
where accountNumber is null
group by coalesce([oldREId],[newREId]),trim(upper([name]))),



cte2 as (select count(distinct report_id)total_report_count, coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME
 	from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[cps_Report_Details] cp
	join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
	and Fingate_Migrated_Data='N' and Report_Status = 'PASS'and substring(cast([fiu_Batch_Id] as nvarchar),1,8)  between 20240301  and 20240331
	group by coalesce([oldREId],[newREId]) ,trim(upper([name])))
	select distinct cte1.FIUREID,CTE1.RE_NAME, total_report_count,anomalies_count, concat(cast((anomalies_count*100 / total_report_count) as double precision),'%') anomalies_percentage  from cte2 join cte1 on cte1.FIUREID=cte2.FIUREID

ORDER BY anomalies_count  DESC

In [163]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp29 = pd.DataFrame(Finnet2_o)
dfp29.columns = dfp29.columns.str.upper()
display("Shape : ",dfp29.shape)
dfp29 = dfp29.reset_index()
dfp29['index'] = dfp29['index']+1
dfp29 = dfp29.rename(columns={'index':'sl. no.'})
dfp29.index = dfp29.index + 1
dfp29.head(5)

Query Executed successfully

'Shape : '

(35, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT_COUNT,ANOMALIES_COUNT,ANOMALIES_PERCENTAGE
1,1,BASCB00071,HDFC BANK LIMITED,1130719,2756,0%
2,2,BASCB00061,AXIS BANK,79450,2418,3%
3,3,BASCB00072,ICICI BANK LIMITED,157334,1488,0%
4,4,BASCB00050,STATE BANK OF INDIA,122964,427,0%
5,5,BASCB00036,BANK OF BARODA,79853,371,0%

###### 30- Merchant Name is missing

In [164]:
query2_0 = f'''


with cte1 as (
select coalesce(oldREId,newreid) Fiureid , re.name as RE_Name , count(distinct Report_Id) as Total_Report from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts 
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp on ts.reportId = cp.Report_Id 
inner join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re on re.id_ = cp.Re_Id
where ts.reportType = 'BDU' and cp.Report_Status = 'PASS'  and left(cp.Fiu_Batch_Id,8) between 20{Current_month_init}{Current_month_init}01 and 20{Current_month_init}31
group by coalesce(oldREId,newreid)  , re.name
),

cte2 as (
select coalesce(oldREId,newreid) Fiureid , re.name as RE_Name , count(distinct Report_Id) as Anomaly_Count from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts 
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp on ts.reportId = cp.Report_Id 
inner join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re on re.id_ = cp.Re_Id
where ts.reportType = 'BDU' and cp.Report_Status = 'PASS'  and left(cp.Fiu_Batch_Id,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and ts.merchantName is null
group by coalesce(oldREId,newreid)  , re.name
)

select cte1.Fiureid , cte1.RE_Name , Total_Report , Anomaly_Count , concat(cast((Anomaly_Count*100 / Total_Report) as double precision),'%') anomalies_percentage from cte1 inner join cte2 on cte1.Fiureid = cte2.Fiureid order by Anomaly_Count


'''

print(query2_0)

with cte1 as (
select coalesce(oldREId,newreid) Fiureid , re.name as RE_Name , count(distinct Report_Id) as Total_Report from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp on ts.reportId = cp.Report_Id
inner join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re on re.id_ = cp.Re_Id
where ts.reportType = 'BDU' and cp.Report_Status = 'PASS'  and left(cp.Fiu_Batch_Id,8) between 202403240301 and 20240331
group by coalesce(oldREId,newreid)  , re.name
),

cte2 as (
select coalesce(oldREId,newreid) Fiureid , re.name as RE_Name , count(distinct Report_Id) as Anomaly_Count from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp on ts.reportId = cp.Report_Id
inner join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re on re.id_ = cp.Re_Id
where ts.reportType = 'BDU' and cp.Report_Status = 'PASS'  and left(cp.Fiu_Batch_Id,8) between 20240301 and 20240331
and ts.merchantName is null
group by coalesce(oldREId,newreid)  , re.name
)

select cte1.Fiureid , cte1.RE_Name , Total_Report , Anomaly_Count , concat(cast((Anomaly_Count*100 / Total_Report) as double precision),'%') anomalies_percentage from cte1 inner join cte2 on cte1.Fiureid = cte2.Fiureid order by Anomaly_Count

In [165]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp30 = pd.DataFrame(Finnet2_o)
dfp30.columns = dfp30.columns.str.upper()
display("Shape : ",dfp30.shape)
dfp30 = dfp30.reset_index()
dfp30['index'] = dfp30['index']+1
dfp30 = dfp30.rename(columns={'index':'sl. no.'})
dfp30.index = dfp30.index + 1
dfp30.head(5)

Query Executed successfully

'Shape : '

(0, 5)

Empty DataFrame
Columns: [sl. no., FIUREID, RE_NAME, TOTAL_REPORT, ANOMALY_COUNT, ANOMALIES_PERCENTAGE]
Index: []

###### 31- Merchant Id is missing

In [166]:
query2_0 = f'''



with cte1 as (
select coalesce(oldREId,newreid) Fiureid , re.name as RE_Name , count(distinct Report_Id) as Total_Report from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts 
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp on ts.reportId = cp.Report_Id 
inner join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re on re.id_ = cp.Re_Id
where ts.reportType = 'BDU' and cp.Report_Status = 'PASS'  and left(cp.Fiu_Batch_Id,8) between 20{Current_month_init}01 and 20{Current_month_init}31
group by coalesce(oldREId,newreid)  , re.name
),

cte2 as (
select coalesce(oldREId,newreid) Fiureid , re.name as RE_Name , count(distinct Report_Id) as Anomaly_Count from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts 
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp on ts.reportId = cp.Report_Id 
inner join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re on re.id_ = cp.Re_Id
where ts.reportType = 'BDU' and cp.Report_Status = 'PASS'  and left(cp.Fiu_Batch_Id,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and ts.merchantId is null
group by coalesce(oldREId,newreid)  , re.name
)

select cte1.Fiureid , cte1.RE_Name , Total_Report , Anomaly_Count , concat(cast((Anomaly_Count*100 / Total_Report) as double precision),'%') anomalies_percentage from cte1 inner join cte2 on cte1.Fiureid = cte2.Fiureid order by Anomaly_Count desc


'''

print(query2_0)

with cte1 as (
select coalesce(oldREId,newreid) Fiureid , re.name as RE_Name , count(distinct Report_Id) as Total_Report from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp on ts.reportId = cp.Report_Id
inner join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re on re.id_ = cp.Re_Id
where ts.reportType = 'BDU' and cp.Report_Status = 'PASS'  and left(cp.Fiu_Batch_Id,8) between 20240301 and 20240331
group by coalesce(oldREId,newreid)  , re.name
),

cte2 as (
select coalesce(oldREId,newreid) Fiureid , re.name as RE_Name , count(distinct Report_Id) as Anomaly_Count from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp on ts.reportId = cp.Report_Id
inner join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re on re.id_ = cp.Re_Id
where ts.reportType = 'BDU' and cp.Report_Status = 'PASS'  and left(cp.Fiu_Batch_Id,8) between 20240301 and 20240331
and ts.merchantId is null
group by coalesce(oldREId,newreid)  , re.name
)

select cte1.Fiureid , cte1.RE_Name , Total_Report , Anomaly_Count , concat(cast((Anomaly_Count*100 / Total_Report) as double precision),'%') anomalies_percentage from cte1 inner join cte2 on cte1.Fiureid = cte2.Fiureid order by Anomaly_Count desc

In [167]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp31 = pd.DataFrame(Finnet2_o)
dfp31.columns = dfp31.columns.str.upper()
display("Shape : ",dfp31.shape)
dfp31 = dfp31.reset_index()
dfp31['index'] = dfp31['index']+1
dfp31 = dfp31.rename(columns={'index':'sl. no.'})
dfp31.index = dfp31.index + 1
dfp31.head(5)

Query Executed successfully

'Shape : '

(1, 5)

,sl. no.,FIUREID,RE_NAME,TOTAL_REPORT,ANOMALY_COUNT,ANOMALIES_PERCENTAGE
1,1,FICSO00010,MASTERCARD ASIA/PACIFIC PTE. LIMITED,135,33,24%

###### 32- RE-Wise RFI mostly used

In [168]:
query2_0 = f'''

with cte1 as(SELECT Fiu_Re_Id,rename, otherRedFlagInd,ROW_NUMBER() OVER (PARTITION BY rename ORDER BY COUNT(otherRedFlagInd) DESC) AS rn 
FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Gos] gos   
join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp on cp.Report_Id = gos.reportId and 
left(fiu_Batch_id,8) between 20{Current_month_init}01 and 20{Current_month_init}31
group by otherRedFlagInd,rename,Fiu_Re_Id  ) select fiu_re_id,rename,otherRedFlagInd from cte1 where rn = 1

'''

print(query2_0)

with cte1 as(SELECT Fiu_Re_Id,rename, otherRedFlagInd,ROW_NUMBER() OVER (PARTITION BY rename ORDER BY COUNT(otherRedFlagInd) DESC) AS rn
FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Gos] gos
join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp on cp.Report_Id = gos.reportId and
left(fiu_Batch_id,8) between 20240301 and 20240331
group by otherRedFlagInd,rename,Fiu_Re_Id  ) select fiu_re_id,rename,otherRedFlagInd from cte1 where rn = 1

In [169]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp32 = pd.DataFrame(Finnet2_o)
dfp32.columns = dfp32.columns.str.upper()
display("Shape : ",dfp32.shape)
dfp32 = dfp32.reset_index()
dfp32['index'] = dfp32['index']+1
dfp32 = dfp32.rename(columns={'index':'sl. no.'})
dfp32.index = dfp32.index + 1
dfp32.head(5)

Query Executed successfully

'Shape : '

(219, 3)

,sl. no.,FIU_RE_ID,RENAME,OTHERREDFLAGIND
1,1,BA00002335,Nkgsb Co-op Bank Limited,Foreign inwards remittance credited in newly o...
2,2,BA00013151,NORTH EAST SMALL FINANCE BANK,Multiple credits and debits through UPI from...
3,3,BA00009188,Nutan Nagarik Sahakari Bank Limited Ahmedabad,MULTIPLE SMALL CASH DEPOSITS
4,4,BF00022678,Nuvama Wealth and Investment Limited,Insider Trading
5,5,PA00025604,One Ninety Seven Communications Limited,High value or volume of transactions or other ...

###### 33- RFI Frequency

In [170]:
query2_0 = f'''

select rfi,count(1) count_rfi from [Fincore_Bridge_DB].[dbo].[batch_report] r
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] c on c.report_id=r.reportid
where c.report_type='STR' and left(c.fiu_Batch_id,8) between 20{Current_month_init}01 and 20{Current_month_init}31
group by rfi
order by count_rfi desc

'''

print(query2_0)

select rfi,count(1) count_rfi from [Fincore_Bridge_DB].[dbo].[batch_report] r
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] c on c.report_id=r.reportid
where c.report_type='STR' and left(c.fiu_Batch_id,8) between 20240301 and 20240331
group by rfi
order by count_rfi desc

In [171]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp33 = pd.DataFrame(Finnet2_o)
dfp33.columns = dfp33.columns.str.upper()
display("Shape : ",dfp33.shape)
dfp33 = dfp33.reset_index()
dfp33['index'] = dfp33['index']+1
dfp33 = dfp33.rename(columns={'index':'sl. no.'})
dfp33.index = dfp33.index + 1
dfp33.head(5)

Query Executed successfully

'Shape : '

(95, 2)

   sl. no.                                                RFI  COUNT_RFI
1        1                                             Others       8138
2        2                     High activity in a new account       2819
3        3  Customer is being  investigated for criminal o...       2329
4        4           High value transactions in a new account       1120
5        5       Sudden high value transaction for the client        494

###### 34- RFI not used

In [172]:
query2_0 = f'''

with cte as(select distinct rfi from [Fincore_Bridge_DB].[dbo].[batch_report] r 
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] c on c.report_id=r.reportid
where c.report_type='STR' and left(c.fiu_Batch_id,8) between 20{Current_month_init}01 and 20{Current_month_init}31)

select distinct redflagindicator from(
select distinct redflagindicator, rfi from [DATAHUB_DB].[FIUMetaHub].[finnet_AlertSource] r
left join cte on redflagindicator=rfi)z
where rfi is null

'''

print(query2_0)

with cte as(select distinct rfi from [Fincore_Bridge_DB].[dbo].[batch_report] r
inner join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] c on c.report_id=r.reportid
where c.report_type='STR' and left(c.fiu_Batch_id,8) between 20240301 and 20240331)

select distinct redflagindicator from(
select distinct redflagindicator, rfi from [DATAHUB_DB].[FIUMetaHub].[finnet_AlertSource] r
left join cte on redflagindicator=rfi)z
where rfi is null

In [173]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
dfp34 = pd.DataFrame(Finnet2_o)
dfp34.columns = dfp34.columns.str.upper()
display("Shape : ",dfp34.shape)
dfp34 = dfp34.reset_index()
dfp34['index'] = dfp34['index']+1
dfp34 = dfp34.rename(columns={'index':'sl. no.'})
dfp34.index = dfp34.index + 1
dfp34.head(5)

Query Executed successfully

'Shape : '

(128, 1)

   sl. no.                                   REDFLAGINDICATOR
1        1  \tCV1- Client is reluctant to submit informati...
2        2     Accounts Credited and then immediately Debited
3        3     Accounts Debited and Then Immediately Credited
4        4  Accounts Operated for Very Short Period and Us...
5        5  Advance for supply of goods is a major part/pe...

# Raw Data Query

In [106]:
#---NTR With Debits --

query2_0_rawData = f'''


with cte1 as( select  distinct cp.Report_Id ,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME , Report_Type , Fiu_Batch_Id , r.reportRefNo
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
inner join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
where 
Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and Report_Type = 'NTR' ),


cte2 as (SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id,FIUREID,RE_NAME, [transactionType] , c1.reportRefNo FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne]ts1 join cte1 c1 on ts1.reportId=c1.Report_Id where [transactionType]='Debit'
  union 
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME, [transactionType] , c1.reportRefNo FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo] ts2 join cte1 c1 on ts2.reportId=c1.Report_Id where [transactionType]='Debit'
  union 
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME, [transactionType] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree] ts3 join cte1 c1 on ts3.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union 
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[transactionType] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour] ts4 join cte1 c1 on ts4.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union 
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[transactionType] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive] ts5 join cte1 c1 on ts5.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union 
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[transactionType] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven] ts7 join cte1 c1 on ts7.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union 
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id,FIUREID,RE_NAME,[transactionType] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine] ts9 join cte1 c1 on ts9.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union 
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[transactionType] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts11 join cte1 c1 on ts11.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union 
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[depositWithdrawal] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] tc1 join cte1 c1 on tc1.reportId=c1.Report_Id
  where [depositWithdrawal]='Withdrawal'
  union 
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[depositeWithdrawl] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] tc2 join cte1 c1 on tc2.reportId=c1.Report_Id
  where [depositeWithdrawl] ='Withdrawal'
  union 
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[relationshipFlag] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP] ts14 join cte1 c1 on ts14.reportId=c1.Report_Id
  where [relationshipFlag] ='Sender'
  
  )
  
  select  distinct concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id ,Report_Type,FIUREID,RE_NAME,Report_Id , reportRefNo
  from cte2
'''

print(query2_0_rawData)

with cte1 as( select  distinct cp.Report_Id ,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME , Report_Type , Fiu_Batch_Id , r.reportRefNo
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
inner join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
where
Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and Report_Type = 'NTR' ),


cte2 as (SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id,FIUREID,RE_NAME, [transactionType] , c1.reportRefNo FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne]ts1 join cte1 c1 on ts1.reportId=c1.Report_Id where [transactionType]='Debit'
  union
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME, [transactionType] , c1.reportRefNo FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo] ts2 join cte1 c1 on ts2.reportId=c1.Report_Id where [transactionType]='Debit'
  union
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME, [transactionType] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree] ts3 join cte1 c1 on ts3.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[transactionType] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour] ts4 join cte1 c1 on ts4.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[transactionType] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive] ts5 join cte1 c1 on ts5.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[transactionType] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven] ts7 join cte1 c1 on ts7.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id,FIUREID,RE_NAME,[transactionType] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine] ts9 join cte1 c1 on ts9.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[transactionType] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts11 join cte1 c1 on ts11.reportId=c1.Report_Id
  where [transactionType]='Debit'
  union
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[depositWithdrawal] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] tc1 join cte1 c1 on tc1.reportId=c1.Report_Id
  where [depositWithdrawal]='Withdrawal'
  union
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[depositeWithdrawl] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] tc2 join cte1 c1 on tc2.reportId=c1.Report_Id
  where [depositeWithdrawl] ='Withdrawal'
  union
  SELECT Report_Type,Fiu_Batch_Id,c1.Report_Id, FIUREID,RE_NAME,[relationshipFlag] , c1.reportRefNo
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP] ts14 join cte1 c1 on ts14.reportId=c1.Report_Id
  where [relationshipFlag] ='Sender'

  )

  select  distinct concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id ,Report_Type,FIUREID,RE_NAME,Report_Id , reportRefNo
  from cte2

In [107]:
Finnet2_o = pd.read_sql(query2_0_rawData,FINnet_2_engine)
print('Query Executed successfully')
data_2o_DEBIT_RAW = pd.DataFrame(Finnet2_o)
data_2o_DEBIT_RAW.columns = data_2o_DEBIT_RAW.columns.str.upper()
display("Shape : ",data_2o_DEBIT_RAW.shape)
display(data_2o_DEBIT_RAW.head(5))
# data_2o.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\Raw_data_NTR_Debits.csv')

Query Executed successfully

'Shape : '

(16, 6)

,FIU_BATCH_ID,REPORT_TYPE,FIUREID,RE_NAME,REPORT_ID,REPORTREFNO
0,ID-2024032830319851,NTR,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,582697104,None
1,ID-2024031530397982,NTR,FINBF00478,SHRIRAM FINANCE LIMITED,580212937,None
2,ID-2024032830319851,NTR,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,582696908,None
3,ID-2024032830319851,NTR,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,582696914,None
4,ID-2024032830319851,NTR,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,582696946,None

In [108]:
df_RAW_NTR_with_debits = data_2o_DEBIT_RAW
df_RAW_NTR_with_debits.head(5)

,FIU_BATCH_ID,REPORT_TYPE,FIUREID,RE_NAME,REPORT_ID,REPORTREFNO
0,ID-2024032830319851,NTR,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,582697104,None
1,ID-2024031530397982,NTR,FINBF00478,SHRIRAM FINANCE LIMITED,580212937,None
2,ID-2024032830319851,NTR,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,582696908,None
3,ID-2024032830319851,NTR,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,582696914,None
4,ID-2024032830319851,NTR,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,582696946,None

In [109]:
#--Below Threshold -- 

query2_0_rawData = f'''



with cte1 as( select  distinct cp.Report_Id , coalesce([oldREId],[newREId]) as fiureid,trim(upper([name])) as re_name , Report_Type ,Fiu_Batch_Id , r.reportRefNo
 from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
inner join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
where 
Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
and Report_Type = 'NTR' and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
),

cte2 as (
select Fiu_Batch_Id,Report_Type,Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[amount])as amount , reportRefNo from(
select Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[amount])as amount , c1.[reportRefNo] FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne] ts1 join cte1 c1 on ts1.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[amount]) <1000000 
  union 
  SELECT Fiu_Batch_Id,Report_Type, c1.Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[amount])as amount , c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo] ts2 join cte1 c1 on ts2.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union 
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[transactionAmount]) amount , c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree] ts3 join cte1 c1 on ts3.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmount]) <1000000
  union 
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmount]) amount , c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour] ts4 join cte1 c1 on ts4.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[transactionAmount]) <1000000
  union 
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount]) , c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive] ts5 join cte1 c1 on ts5.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union 
  SELECT Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount]) , c1.[reportRefNo] FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven] ts7 join cte1 c1 on ts7.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[amount]) <1000000
  union 
  SELECT Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount]) , c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine] ts9 join cte1 c1 on ts9.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union 
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),amountInInr)  amount , c1.[reportRefNo] FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts11 join cte1 c1 on ts11.reportId=c1.Report_Id where  try_convert(DECIMAL(18,2),amountInInr) <1000000
  union 
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmount]) amount , c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] tc1 join cte1 c1 on tc1.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmount])  <1000000
  union 
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount]) amount , c1.[reportRefNo] FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] tc2 join cte1 c1 on tc2.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union 
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),amount) amount,c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSix] tc6 join cte1 c1 on tc6.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[Amount])  <1000000
  union 
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmmount]) amount,c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP] ts14 join cte1 c1 on ts14.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmmount])  <1000000
  union 
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmount]) amount,c1.[reportRefNo] [reportRefNo] FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_GenReporting] gt1 join cte1 c1 on gt1.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmount])  <1000000




)z
)

  
  select distinct concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id,Report_Type,FIUREID,RE_NAME,
  cte2.Report_Id , reportRefNo
  from cte2 


'''

print(query2_0_rawData)

with cte1 as( select  distinct cp.Report_Id , coalesce([oldREId],[newREId]) as fiureid,trim(upper([name])) as re_name , Report_Type ,Fiu_Batch_Id , r.reportRefNo
 from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
inner join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
where
Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
and Report_Type = 'NTR' and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
),

cte2 as (
select Fiu_Batch_Id,Report_Type,Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[amount])as amount , reportRefNo from(
select Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[amount])as amount , c1.[reportRefNo] FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne] ts1 join cte1 c1 on ts1.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[amount]) <1000000
  union
  SELECT Fiu_Batch_Id,Report_Type, c1.Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[amount])as amount , c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo] ts2 join cte1 c1 on ts2.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME, try_convert(DECIMAL(18,2),[transactionAmount]) amount , c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree] ts3 join cte1 c1 on ts3.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmount]) <1000000
  union
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmount]) amount , c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour] ts4 join cte1 c1 on ts4.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[transactionAmount]) <1000000
  union
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount]) , c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive] ts5 join cte1 c1 on ts5.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union
  SELECT Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount]) , c1.[reportRefNo] FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven] ts7 join cte1 c1 on ts7.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[amount]) <1000000
  union
  SELECT Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount]) , c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine] ts9 join cte1 c1 on ts9.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),amountInInr)  amount , c1.[reportRefNo] FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven] ts11 join cte1 c1 on ts11.reportId=c1.Report_Id where  try_convert(DECIMAL(18,2),amountInInr) <1000000
  union
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmount]) amount , c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] tc1 join cte1 c1 on tc1.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmount])  <1000000
  union
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[amount]) amount , c1.[reportRefNo] FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] tc2 join cte1 c1 on tc2.reportId=c1.Report_Id where try_convert(DECIMAL(18,2),[amount]) <1000000
  union
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),amount) amount,c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSix] tc6 join cte1 c1 on tc6.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[Amount])  <1000000
  union
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmmount]) amount,c1.[reportRefNo]  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP] ts14 join cte1 c1 on ts14.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmmount])  <1000000
  union
  SELECT  Fiu_Batch_Id,Report_Type,c1.Report_Id,FIUREID,RE_NAME,try_convert(DECIMAL(18,2),[transactionAmount]) amount,c1.[reportRefNo] [reportRefNo] FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_GenReporting] gt1 join cte1 c1 on gt1.reportId=c1.Report_Id  where try_convert(DECIMAL(18,2),[transactionAmount])  <1000000




)z
)


  select distinct concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id,Report_Type,FIUREID,RE_NAME,
  cte2.Report_Id , reportRefNo
  from cte2

In [110]:
Finnet2_o = pd.read_sql(query2_0_rawData,FINnet_2_engine)
print('Query Executed successfully')
data_2o_Below_Threshold_RAW = pd.DataFrame(Finnet2_o)
data_2o_Below_Threshold_RAW.columns = data_2o_Below_Threshold_RAW.columns.str.upper()
display("Shape : ",data_2o_Below_Threshold_RAW.shape)
display(data_2o_Below_Threshold_RAW.head(5))
# data_2o.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\Raw_data_NTR_Below_Threshold.csv')

Query Executed successfully

'Shape : '

(81, 6)

,FIU_BATCH_ID,REPORT_TYPE,FIUREID,RE_NAME,REPORT_ID,REPORTREFNO
0,ID-2024032830319851,NTR,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,582696937,None
1,ID-2024031430324697,NTR,BASCO00012,THE HIMACHAL PRADESH STATE CO-OPERATIVE BANK L...,579462215,None
2,ID-2024031430384733,NTR,BASCB00103,CREDIT SUISSE AG,579769003,None
3,ID-2024030830345748,NTR,BASCB00126,EQUITAS SMALL FINANCE BANK LIMITED,576282006,None
4,ID-2024030830345748,NTR,BASCB00126,EQUITAS SMALL FINANCE BANK LIMITED,576282003,None

In [111]:
df_RAW_NTR_below_threshold = data_2o_Below_Threshold_RAW
df_RAW_NTR_below_threshold.head(5)

,FIU_BATCH_ID,REPORT_TYPE,FIUREID,RE_NAME,REPORT_ID,REPORTREFNO
0,ID-2024032830319851,NTR,BAUCB01044,RAYAT SEVAK CO-OP BANK LIMITED,582696937,None
1,ID-2024031430324697,NTR,BASCO00012,THE HIMACHAL PRADESH STATE CO-OPERATIVE BANK L...,579462215,None
2,ID-2024031430384733,NTR,BASCB00103,CREDIT SUISSE AG,579769003,None
3,ID-2024030830345748,NTR,BASCB00126,EQUITAS SMALL FINANCE BANK LIMITED,576282006,None
4,ID-2024030830345748,NTR,BASCB00126,EQUITAS SMALL FINANCE BANK LIMITED,576282003,None

In [112]:
# --Missing Tranaction Raw -- #

query2_0_rawData = f'''

with cte1 as (
select  Fiu_Batch_Id,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.Report_Id, Report_Type , r.reportRefNo
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 
and Report_Type in  ('CTR','NTR','CBWTR')

and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8)  between 20{Current_month_init}01 and 20{Current_month_init}31),



  cte2 as (
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne]
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo]
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree]
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour] 
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive] 
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven] 
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine] 
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven]
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne] 
  union 
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo] 
  union 
  select reportId from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSix] 
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP] 
  union 
  select ReportId [reportRefNo] from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_GenReporting] 
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEight] 
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTen] 
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwelve] 
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_RealEstateStr] 
  union 
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFifteen]
  
  
  ),

 
 cte3 as ( select  concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id,Report_Type, FIUREID, RE_NAME, cte1.Report_Id, reportRefNo
from cte1 left outer join cte2 on cte1.Report_Id=cte2.reportId where cte2.reportId is null
)

   select distinct * from cte3
'''
print(query2_0_rawData)

with cte1 as (
select  Fiu_Batch_Id,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.Report_Id, Report_Type , r.reportRefNo
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
and Report_Type in  ('CTR','NTR','CBWTR')

and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8)  between 20240301 and 20240331),



  cte2 as (
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsOne]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwo]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsThree]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFour]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFive]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSeven]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsNine]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEleven]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcOne]
  union
  SELECT reportId FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TcTwo]
  union
  select reportId from [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsSix]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_StrVDASP]
  union
  select ReportId [reportRefNo] from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_GenReporting]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsEight]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTen]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsTwelve]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_RealEstateStr]
  union
  select ReportId from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_TsFifteen]


  ),


 cte3 as ( select  concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id,Report_Type, FIUREID, RE_NAME, cte1.Report_Id, reportRefNo
from cte1 left outer join cte2 on cte1.Report_Id=cte2.reportId where cte2.reportId is null
)

   select distinct * from cte3

In [113]:
Finnet2_o = pd.read_sql(query2_0_rawData,FINnet_2_engine)
print('Query Executed successfully')
data_2o_Missing_Transaction_RAW = pd.DataFrame(Finnet2_o)
data_2o_Missing_Transaction_RAW.columns = data_2o_Missing_Transaction_RAW.columns.str.upper()
display("Shape : ",data_2o_Missing_Transaction_RAW.shape)
display(data_2o_Missing_Transaction_RAW.head(5))
# data_2o.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\Raw_data_Missing_Transaction.csv')

Query Executed successfully

'Shape : '

(12433, 6)

,FIU_BATCH_ID,REPORT_TYPE,FIUREID,RE_NAME,REPORT_ID,REPORTREFNO
0,ID-2024030800163121,CTR,BASCB00061,AXIS BANK,577367660,None
1,ID-2024031200133188,CTR,BA00037527,SHRI KANYAKA NAGARI SAHAKARI BANK LTD,576529651,None
2,ID-2024033000191994,CTR,BARRB00259,MADHYA PRADESH GRAMIN BANK,583058499,None
3,ID-2024031400181434,CTR,BADCB00371,YAVATMAL DISTRICT CENTRAL CO-OPERATIVE BANK LI...,579833510,None
4,ID-2024030800163121,CTR,BASCB00061,AXIS BANK,577338028,None

In [114]:
#--Missing Account Number Raw -- 


query2_0_rawData = f'''
select distinct  concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id, Report_Type,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.report_id  ,  r.reportRefNo
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id and ( (originCountry = '95'  and senderAcNo is null) or ( destinationCountry = '95'  and  beneficiaryAcNo is null )) 
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
Where SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8)  between 20{Current_month_init}01 and 20{Current_month_init}31
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
'''
print(query2_0_rawData)

select distinct  concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id, Report_Type,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.report_id  ,  r.reportRefNo
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id and ( (originCountry = '95'  and senderAcNo is null) or ( destinationCountry = '95'  and  beneficiaryAcNo is null ))
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
Where SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8)  between 20240301 and 20240331
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'

In [115]:
Finnet2_o = pd.read_sql(query2_0_rawData,FINnet_2_engine)
print('Query Executed successfully')
data_2o_ACC_RAW = pd.DataFrame(Finnet2_o)
data_2o_ACC_RAW.columns = data_2o_ACC_RAW.columns.str.upper()
display("Shape : ",data_2o_ACC_RAW.shape)
display(data_2o_ACC_RAW.head(5))
# data_2o.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\Raw_data_Missing_Account_Number.csv')

Query Executed successfully

'Shape : '

(25660, 6)

,FIU_BATCH_ID,REPORT_TYPE,FIUREID,RE_NAME,REPORT_ID,REPORTREFNO
0,ID-2024031030177895,CBWTR,BASCB00074,INDUSIND BANK LIMITED,578303478,None
1,ID-2024031530197398,CBWTR,BASCB00071,HDFC BANK LIMITED,580044214,None
2,ID-2024031530151468,CBWTR,BASCB00071,HDFC BANK LIMITED,580410920,None
3,ID-2024031030177895,CBWTR,BASCB00074,INDUSIND BANK LIMITED,578298024,None
4,ID-2024031530197398,CBWTR,BASCB00071,HDFC BANK LIMITED,580042831,None

In [116]:
#-- Sender and Benificary not India 


query2_0_rawData = f'''
select distinct concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id,Report_Type , coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.report_id , r.reportRefNo
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id and  originCountry <>'95' and destinationCountry <>'95'
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
Where SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
'''
print(query2_0_rawData)

select distinct concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id,Report_Type , coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.report_id , r.reportRefNo
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id and  originCountry <>'95' and destinationCountry <>'95'
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
Where SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'

In [117]:
Finnet2_o = pd.read_sql(query2_0_rawData,FINnet_2_engine)
print('Query Executed successfully')
data_2o_SENDER_BEN_RAW = pd.DataFrame(Finnet2_o)
data_2o_SENDER_BEN_RAW.columns = data_2o_SENDER_BEN_RAW.columns.str.upper()
display("Shape : ",data_2o_SENDER_BEN_RAW.shape)
display(data_2o_SENDER_BEN_RAW.head(5))
# data_2o.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\Raw_data_Sender_Beni_Not_India.csv')

Query Executed successfully

'Shape : '

(0, 6)

Empty DataFrame
Columns: [FIU_BATCH_ID, REPORT_TYPE, FIUREID, RE_NAME, REPORT_ID, REPORTREFNO]
Index: []

In [118]:
# -- Missing State Query -- 

query2_0_rawData = f'''
select concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id, Report_Type,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.report_id ,r.reportRefNo 
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
where ( name not like '% IBU%' and name not like '%-IBU%')
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8)  between 20{Current_month_init}01 and 20{Current_month_init}31
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
and originCountry = '95'  and senderState is null

UNION

select concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id, Report_Type,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.report_id , r.reportRefNo 
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
where ( name not like '% IBU%' and name not like '%-IBU%')
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8)  between 20{Current_month_init}01 and 20{Current_month_init}31
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
and destinationCountry = '95'  and  benState is null 
'''

In [120]:
Finnet2_o = pd.read_sql(query2_0_rawData,FINnet_2_engine)
print('Query Executed successfully')
data_2o_missingstate = pd.DataFrame(Finnet2_o)
data_2o_missingstate.columns = data_2o_missingstate.columns.str.upper()
display("Shape : ",data_2o_missingstate.shape)
display(data_2o_missingstate.head(5))

Query Executed successfully

'Shape : '

(270458, 6)

,FIU_BATCH_ID,REPORT_TYPE,FIUREID,RE_NAME,REPORT_ID,REPORTREFNO
0,ID-2024030230122675,CBWTR,BASCB00019,HONGKONG AND SHANGHAI BANKING CORPORATION LIMITED,576160401,None
1,ID-2024030230122675,CBWTR,BASCB00019,HONGKONG AND SHANGHAI BANKING CORPORATION LIMITED,576160404,None
2,ID-2024030230122675,CBWTR,BASCB00019,HONGKONG AND SHANGHAI BANKING CORPORATION LIMITED,576160411,None
3,ID-2024030230122675,CBWTR,BASCB00019,HONGKONG AND SHANGHAI BANKING CORPORATION LIMITED,576160414,None
4,ID-2024030230122675,CBWTR,BASCB00019,HONGKONG AND SHANGHAI BANKING CORPORATION LIMITED,576160424,None

In [121]:
#-- Less than 5 Lakh 

query2_0_rawData = f'''
select distinct concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id, Report_Type,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.report_id as  total_EFTs  , r.reportRefNo 
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id and [amountInInr] < 500000
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
where  SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
'''

print(query2_0_rawData)

select distinct concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id, Report_Type,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.report_id as  total_EFTs  , r.reportRefNo
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id and [amountInInr] < 500000
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
where  SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'

In [122]:
Finnet2_o = pd.read_sql(query2_0_rawData,FINnet_2_engine)
print('Query Executed successfully')
data_2o_lessthan_5lkh = pd.DataFrame(Finnet2_o)
data_2o_lessthan_5lkh.columns = data_2o_lessthan_5lkh.columns.str.upper()
display("Shape : ",data_2o_lessthan_5lkh.shape)
display(data_2o_lessthan_5lkh.head(5))
# data_2o.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\Raw_data_Lessthan_5lkh.csv')

Query Executed successfully

'Shape : '

(2446, 6)

,FIU_BATCH_ID,REPORT_TYPE,FIUREID,RE_NAME,TOTAL_EFTS,REPORTREFNO
0,ID-2024031530151767,CBWTR,BASCB00071,HDFC BANK LIMITED,579626396,None
1,ID-2024031530151767,CBWTR,BASCB00071,HDFC BANK LIMITED,579633310,None
2,ID-2024031530131719,CBWTR,BASCB00071,HDFC BANK LIMITED,579747635,None
3,ID-2024031530116138,CBWTR,BASCB00039,CANARA BANK,580024010,None
4,ID-2024031530116138,CBWTR,BASCB00039,CANARA BANK,580030901,None

In [123]:
#-- Same Amount in INR and FOreign Currency 

query2_0_rawData = f'''
select distinct concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id,Report_Type,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.report_id ,  r.reportRefNo
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id and [amountInInr] = amountInTxCurrency and txCurrencyCode='29'
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
where  SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'
'''
print(query2_0_rawData)

select distinct concat('ID-',Fiu_Batch_Id)Fiu_Batch_Id,Report_Type,coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME, cp.report_id ,  r.reportRefNo
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
join [FINCORE_BRIDGE_DB].[FINCORE_BRIDGE].[fingate_CbwtrBank]cb on cb.reportId=cp.report_id and [amountInInr] = amountInTxCurrency and txCurrencyCode='29'
left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[fingate_Report] r (nolock) on cp.Report_Id = r.id_
where  SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
and Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 and Report_Type='CBWTR'

In [124]:
Finnet2_o = pd.read_sql(query2_0_rawData,FINnet_2_engine)
print('Query Executed successfully')
data_2o_AMOUNT_RAW = pd.DataFrame(Finnet2_o)
data_2o_AMOUNT_RAW.columns = data_2o_AMOUNT_RAW.columns.str.upper()
display("Shape : ",data_2o_AMOUNT_RAW.shape)
display(data_2o_AMOUNT_RAW.head(5))
# data_2o.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\Raw_data_Same_Amount_INR_&_Foreign.csv')

Query Executed successfully

'Shape : '

(150965, 6)

,FIU_BATCH_ID,REPORT_TYPE,FIUREID,RE_NAME,REPORT_ID,REPORTREFNO
0,ID-2024032230121426,CBWTR,BASCB00071,HDFC BANK LIMITED,581811565,None
1,ID-2024032830192565,CBWTR,BASCB00071,HDFC BANK LIMITED,582827468,None
2,ID-2024032830192565,CBWTR,BASCB00071,HDFC BANK LIMITED,582806037,None
3,ID-2024032830192565,CBWTR,BASCB00071,HDFC BANK LIMITED,582809463,None
4,ID-2024032230121426,CBWTR,BASCB00071,HDFC BANK LIMITED,581802958,None

In [125]:
main_raw_data = [df_RAW_NTR_with_debits,df_RAW_NTR_below_threshold,data_2o_Missing_Transaction_RAW,data_2o_ACC_RAW,data_2o_SENDER_BEN_RAW,data_2o_missingstate,data_2o_lessthan_5lkh,data_2o_AMOUNT_RAW]

In [126]:
Output_path = f'''C://Users//ltim_10693340//Desktop//Anmol//Monthly_Report_pre_submit//MonthlyReport_Raw_{Current_month_init_name}.xlsx'''
print(Output_path)

C://Users//ltim_10693340//Desktop//Anmol//Monthly_Report_pre_submit//MonthlyReport_Raw_March.xlsx

In [127]:
#MONTHLY RAW DATA READER

from datetime import datetime
wb=openpyxl.load_workbook(r'C:\Users\ltim_10693340\Desktop\Anmol\Template\Monthly_raw.xlsx')
i=0
for ws in wb.worksheets:
    wb.active = 1
    df=main_raw_data[i]
    #print(df)
    i=i+1
    rows=dataframe_to_rows(df,index=False,header=False)
    for r_idx,row in enumerate(rows,2):
        #print(i)
        for c_idx,value in enumerate(row,1):
            ws.cell(row=r_idx,column=c_idx,value=value)
wb.save(Output_path)

In [174]:
# Paramtere  =  3 - Total report counts across all RE's

In [175]:
#Previous to previous query

# query2_0 = f'''
# with cte1 as (
# select  coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME,count(distinct cp.Report_Id) report_count, Report_Type 
# from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
# join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
# where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 
# and Report_Type in  ('CTR','STR','CCR','NTR','CBWTR','BDU')
# --and CAST(Submission_Timestamp AS DATE) between '2023-09-01' and '2023-09-30' 
# and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
# group by coalesce([oldREId],[newREId]) ,trim(upper([name])),Report_Type

#  ),



#  cte2 as (select FIUREID,RE_NAME,Report_Type, 

# case when Report_Type='STR' then report_count  else 0 end as STR,                     
# case when Report_Type='CTR' then report_count  else 0 end as CTR,                     
# case when Report_Type='NTR' then report_count  else 0 end as NTR,                     
# case when Report_Type='CBWTR' then report_count  else 0 end as EFT,                    
# case when Report_Type='CCR' then report_count  else 0 end as CCR,  
# case when Report_Type='BDU' then report_count  else 0 end as BDU,
# report_count as total_report_count
# from cte1)
# select FIUREID,RE_NAME, sum(STR) STR,sum(CTR) CTR,sum(NTR) NTR,sum(EFT) EFT,sum(CCR) CCR,sum(BDU) BDU , sum(total_report_count)total_report_count 
# from cte2 c2 group by FIUREID,RE_NAME order by total_report_count  desc
# '''

# print(query2_0)

In [176]:
#Previous Query - With LOB CATEGORY THROUGH CPS

# query2_0 = f'''
#  with cte1 as (
#  select  coalesce([oldREId],[newREId]) as FIUREID,trim(upper(re.[name])) as RE_NAME,count(distinct cp.Report_Id) report_count, Report_Type , RE_TYPE , Line_Of_Business ,trim(upper(lob.[description])) Cat_Description, lob.[name] Cat_Name , re.reTypeId
 
#  from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
#  join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
#  left join [DATAHUB_DB].[FIUMetaHub].[finnet_LineOfBusiness] LOB ON cast(LOB.id_ as nvarchar) = re.[lineOfBusinessId] 
#  where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 
#  and Report_Type in  ('CTR','STR','CCR','NTR','CBWTR','BDU')
#  --and CAST(Submission_Timestamp AS DATE) between '2023-09-01' and '2023-09-30' 
#  and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
#  group by coalesce([oldREId],[newREId]) ,trim(upper(re.[name])),Report_Type ,  RE_TYPE ,Line_Of_Business ,trim(upper(lob.[description])) , lob.[name] , re.reTypeId

#   ),


#  cte2 as (select FIUREID,RE_NAME,RE_TYPE,Line_Of_Business,Report_Type,Cat_Description,Cat_Name,reTypeId,
#  case when Report_Type='STR' then report_count  else 0 end as STR,                     
#  case when Report_Type='CTR' then report_count  else 0 end as CTR,                     
#  case when Report_Type='NTR' then report_count  else 0 end as NTR,                     
#  case when Report_Type='CBWTR' then report_count  else 0 end as EFT,                    
#  case when Report_Type='CCR' then report_count  else 0 end as CCR,  
#  case when Report_Type='BDU' then report_count  else 0 end as BDU,
#  report_count as total_report_count
#  from cte1)
#  select FIUREID,RE_NAME,RE_TYPE,Line_Of_Business,Cat_Description ,sum(STR) STR,sum(CTR) CTR,sum(NTR) NTR,sum(EFT) EFT,sum(CCR) CCR,sum(BDU) BDU , sum(total_report_count)total_report_count 
#  from cte2 c2 
#  group by FIUREID,RE_NAME ,RE_TYPE,Line_Of_Business , Cat_Description,Cat_Name 
#  order by total_report_count  desc
# '''

# print(query2_0)

In [177]:
#Final Query after Joing JD & RETYPE DESC & LOB & CATEGORY


query2_0 = f'''

with cte1 as (
 select  coalesce(re.oldREId,re.newREId) as FIUREID,trim(upper(re.[name])) as RE_NAME,count(distinct cp.Report_Id) report_count, Report_Type , cp.RE_TYPE , ret.description as RETYPE_DESCRIPTION, Line_Of_Business ,trim(upper(lob.[description])) Cat_Description,upper(trim(JD)) as FIU_JOINT_DIRECTOR ,lob.[name] Cat_Name , re.reTypeId
 
 from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
 join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
 left join [DATAHUB_DB].[FIUMetaHub].[finnet_LineOfBusiness] LOB ON trim(upper(LOB.name)) = trim(upper(cp.Line_Of_Business))
 left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[RE_TYPE_DESC] ret on upper(trim(ret.RE_TYPE)) = upper(trim(cp.RE_TYPE))
 left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[JD FIUREID MAPPING Updated - 260424] jd on coalesce(jd.oldREId,jd.newREId) = coalesce(re.oldREId,re.newREId)
 where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 
 and Report_Type in  ('CTR','STR','CCR','NTR','CBWTR','BDU')
 --and CAST(Submission_Timestamp AS DATE) between '2023-09-01' and '2023-09-30' 
 and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Current_month_init}01 and 20{Current_month_init}31
 group by coalesce(re.oldREId,re.newREId) ,trim(upper(re.[name])),Report_Type ,  cp.RE_TYPE ,Line_Of_Business ,trim(upper(lob.[description])) , lob.[name] , re.reTypeId,ret.description,JD

  ),


 cte2 as (select FIUREID,RE_NAME,RE_TYPE,RETYPE_DESCRIPTION,Line_Of_Business,Report_Type,Cat_Description,FIU_JOINT_DIRECTOR,Cat_Name,reTypeId,
 case when Report_Type='STR' then report_count  else 0 end as STR,                     
 case when Report_Type='CTR' then report_count  else 0 end as CTR,                     
 case when Report_Type='NTR' then report_count  else 0 end as NTR,                     
 case when Report_Type='CBWTR' then report_count  else 0 end as EFT,                    
 case when Report_Type='CCR' then report_count  else 0 end as CCR,  
 case when Report_Type='BDU' then report_count  else 0 end as BDU,
 report_count as total_report_count
 from cte1)
 select FIUREID,RE_NAME,RE_TYPE,RETYPE_DESCRIPTION,Line_Of_Business,Cat_Description,FIU_JOINT_DIRECTOR ,sum(STR) STR,sum(CTR) CTR,sum(NTR) NTR,sum(EFT) EFT,sum(CCR) CCR,sum(BDU) BDU , sum(total_report_count)total_report_count 
 from cte2 c2 
 group by FIUREID,RE_NAME ,RE_TYPE,Line_Of_Business , Cat_Description,Cat_Name , RETYPE_DESCRIPTION,FIU_JOINT_DIRECTOR
 order by total_report_count  desc
 
 '''

print(query2_0)

with cte1 as (
 select  coalesce(re.oldREId,re.newREId) as FIUREID,trim(upper(re.[name])) as RE_NAME,count(distinct cp.Report_Id) report_count, Report_Type , cp.RE_TYPE , ret.description as RETYPE_DESCRIPTION, Line_Of_Business ,trim(upper(lob.[description])) Cat_Description,upper(trim(JD)) as FIU_JOINT_DIRECTOR ,lob.[name] Cat_Name , re.reTypeId

 from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
 join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
 left join [DATAHUB_DB].[FIUMetaHub].[finnet_LineOfBusiness] LOB ON trim(upper(LOB.name)) = trim(upper(cp.Line_Of_Business))
 left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[RE_TYPE_DESC] ret on upper(trim(ret.RE_TYPE)) = upper(trim(cp.RE_TYPE))
 left join [Fincore_Bridge_DB].[FINCORE_BRIDGE].[JD FIUREID MAPPING Updated - 260424] jd on coalesce(jd.oldREId,jd.newREId) = coalesce(re.oldREId,re.newREId)
 where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
 and Report_Type in  ('CTR','STR','CCR','NTR','CBWTR','BDU')
 --and CAST(Submission_Timestamp AS DATE) between '2023-09-01' and '2023-09-30'
 and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20240301 and 20240331
 group by coalesce(re.oldREId,re.newREId) ,trim(upper(re.[name])),Report_Type ,  cp.RE_TYPE ,Line_Of_Business ,trim(upper(lob.[description])) , lob.[name] , re.reTypeId,ret.description,JD

  ),


 cte2 as (select FIUREID,RE_NAME,RE_TYPE,RETYPE_DESCRIPTION,Line_Of_Business,Report_Type,Cat_Description,FIU_JOINT_DIRECTOR,Cat_Name,reTypeId,
 case when Report_Type='STR' then report_count  else 0 end as STR,
 case when Report_Type='CTR' then report_count  else 0 end as CTR,
 case when Report_Type='NTR' then report_count  else 0 end as NTR,
 case when Report_Type='CBWTR' then report_count  else 0 end as EFT,
 case when Report_Type='CCR' then report_count  else 0 end as CCR,
 case when Report_Type='BDU' then report_count  else 0 end as BDU,
 report_count as total_report_count
 from cte1)
 select FIUREID,RE_NAME,RE_TYPE,RETYPE_DESCRIPTION,Line_Of_Business,Cat_Description,FIU_JOINT_DIRECTOR ,sum(STR) STR,sum(CTR) CTR,sum(NTR) NTR,sum(EFT) EFT,sum(CCR) CCR,sum(BDU) BDU , sum(total_report_count)total_report_count
 from cte2 c2
 group by FIUREID,RE_NAME ,RE_TYPE,Line_Of_Business , Cat_Description,Cat_Name , RETYPE_DESCRIPTION,FIU_JOINT_DIRECTOR
 order by total_report_count  desc

In [178]:
Finnet2_o = pd.read_sql(query2_0,FINnet_2_engine)
print('Query Executed successfully')
data_2o = pd.DataFrame(Finnet2_o)
data_2o.columns = data_2o.columns.str.upper()
display("Shape : ",data_2o.shape)
display(data_2o.head(5))

Query Executed successfully

'Shape : '

(935, 14)

,FIUREID,RE_NAME,RE_TYPE,RETYPE_DESCRIPTION,LINE_OF_BUSINESS,CAT_DESCRIPTION,FIU_JOINT_DIRECTOR,STR,CTR,NTR,EFT,CCR,BDU,TOTAL_REPORT_COUNT
0,BASCB00071,HDFC BANK LIMITED,BA,Banks,BAPVT,PRIVATE SECTOR BANKS,KEERTHISHRI S,1794,810135,23687,291042,4061,0,1130719
1,FICSO00020,VISA WORLDWIDE PTE. LTD,CO,Card service operator,COCSO,CARD SYSTEM OPERATORS,DR SUMIT KUMAR JHA,20,33,0,0,0,209321,209374
2,BASCB00072,ICICI BANK LIMITED,BA,Banks,BAPVT,PRIVATE SECTOR BANKS,VELUSWAMY ILANCHELIYAN,698,85218,4638,62805,3975,0,157334
3,BASCB00050,STATE BANK OF INDIA,BA,Banks,BAPUB,PUBLIC SECTOR BANKS,GAURAV SINGH,2006,95305,0,25133,520,0,122964
4,BASCB00036,BANK OF BARODA,BA,Banks,BAPUB,PUBLIC SECTOR BANKS,ABHINAV UJJAINIA,418,71693,1131,6240,371,0,79853

In [179]:
dfP3 = data_2o
display(dfP3)
dfP3 = dfP3.reset_index()
dfP3['index'] = dfP3['index']+1
dfP3 = dfP3.rename(columns={'index':'sl. no.'})

,FIUREID,RE_NAME,RE_TYPE,RETYPE_DESCRIPTION,LINE_OF_BUSINESS,CAT_DESCRIPTION,FIU_JOINT_DIRECTOR,STR,CTR,NTR,EFT,CCR,BDU,TOTAL_REPORT_COUNT
0,BASCB00071,HDFC BANK LIMITED,BA,Banks,BAPVT,PRIVATE SECTOR BANKS,KEERTHISHRI S,1794,810135,23687,291042,4061,0,1130719
1,FICSO00020,VISA WORLDWIDE PTE. LTD,CO,Card service operator,COCSO,CARD SYSTEM OPERATORS,DR SUMIT KUMAR JHA,20,33,0,0,0,209321,209374
2,BASCB00072,ICICI BANK LIMITED,BA,Banks,BAPVT,PRIVATE SECTOR BANKS,VELUSWAMY ILANCHELIYAN,698,85218,4638,62805,3975,0,157334
3,BASCB00050,STATE BANK OF INDIA,BA,Banks,BAPUB,PUBLIC SECTOR BANKS,GAURAV SINGH,2006,95305,0,25133,520,0,122964
4,BASCB00036,BANK OF BARODA,BA,Banks,BAPUB,PUBLIC SECTOR BANKS,ABHINAV UJJAINIA,418,71693,1131,6240,371,0,79853
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
930,BADCB00065,CHAMOLI ZILA SAHKARI BANK LTD.,BA,Banks,BADCB,DISTRICT COOPERATIVE BANKS,SARWESHWER DUTT SHARMA,0,1,0,0,0,0,1
931,BAUCB01532,THE JANATHA CO-OPERATIVE BANK LIMITED SADALGA,BA,Banks,BANUC,NON SCHEDULED URBAN COOPERATIVE BANKS,ONKAR TRIPATHI,0,1,0,0,0,0,1
932,BAUCB00450,INNOVATIVE CO-OPERATIVE URBAN BANK LIMITED DELHI,BA,Banks,BANUC,NON SCHEDULED URBAN COOPERATIVE BANKS,None,0,1,0,0,0,0,1
933,BAUCB00752,MEHSANA JILLA PANCHAYAT KARMACHARI CO OP BANK ...,BA,Banks,BANUC,NON SCHEDULED URBAN COOPERATIVE BANKS,ONKAR TRIPATHI,0,1,0,0,0,0,1
934,BAUCB00591,KOLHAPUR URBAN CO-OP BANK LIMITED,BA,Banks,BANUC,NON SCHEDULED URBAN COOPERATIVE BANKS,ONKAR TRIPATHI,0,1,0,0,0,0,1

In [180]:
dfP3
dfP3.index = dfP3.index + 1
dfP3.head(5)

,sl. no.,FIUREID,RE_NAME,RE_TYPE,RETYPE_DESCRIPTION,LINE_OF_BUSINESS,CAT_DESCRIPTION,FIU_JOINT_DIRECTOR,STR,CTR,NTR,EFT,CCR,BDU,TOTAL_REPORT_COUNT
1,1,BASCB00071,HDFC BANK LIMITED,BA,Banks,BAPVT,PRIVATE SECTOR BANKS,KEERTHISHRI S,1794,810135,23687,291042,4061,0,1130719
2,2,FICSO00020,VISA WORLDWIDE PTE. LTD,CO,Card service operator,COCSO,CARD SYSTEM OPERATORS,DR SUMIT KUMAR JHA,20,33,0,0,0,209321,209374
3,3,BASCB00072,ICICI BANK LIMITED,BA,Banks,BAPVT,PRIVATE SECTOR BANKS,VELUSWAMY ILANCHELIYAN,698,85218,4638,62805,3975,0,157334
4,4,BASCB00050,STATE BANK OF INDIA,BA,Banks,BAPUB,PUBLIC SECTOR BANKS,GAURAV SINGH,2006,95305,0,25133,520,0,122964
5,5,BASCB00036,BANK OF BARODA,BA,Banks,BAPUB,PUBLIC SECTOR BANKS,ABHINAV UJJAINIA,418,71693,1131,6240,371,0,79853

In [181]:
RE_NAME_MAX1  = dfP3['RE_NAME'][1]
RE_NAME_MAX_REPORT1 = (dfP3['TOTAL_REPORT_COUNT'][1])/100000
RE_NAME_MAX_REPORT1 = round(RE_NAME_MAX_REPORT1,2)
print(RE_NAME_MAX_REPORT1)

RE_NAME_MAX2 = dfP3['RE_NAME'][2]
RE_NAME_MAX_REPORT2 = (dfP3['TOTAL_REPORT_COUNT'][2])/100000
RE_NAME_MAX_REPORT2 = round(RE_NAME_MAX_REPORT2,2)
print(RE_NAME_MAX_REPORT2)

RE_NAME_MAX3 = dfP3['RE_NAME'][3]
RE_NAME_MAX_REPORT3 = (dfP3['TOTAL_REPORT_COUNT'][3])/100000
RE_NAME_MAX_REPORT3 = round(RE_NAME_MAX_REPORT3,2)
print(RE_NAME_MAX_REPORT3)

11.31
2.09
1.57

In [182]:
# dfP3.to_csv(r'C:\Users\LTIM_K44469\Desktop\Monthly_Report\December\monthly_point_3P_sept.csv',index=True)

In [183]:
# Parameter - 3A - Total report filled across all RE

In [184]:
Query_for_month = f''' {Previous_month2_init_name} {Previous_month1_init_name} {Previous_month_init_name} {Current_month_init_name}''' 

print(Query_for_month)

query2_o = f'''

with cte1 as (
select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME,Report_Type , LEFT(fiu_Batch_id,8) as FIU_BATCH_ID, count(distinct cp.Report_Id) report_count
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1 
and Report_Type in  ('CTR','STR','CCR','NTR','CBWTR','BDU') 
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20{Previous_month2_init}01 and 20{Current_month_init}31
group by  coalesce([oldREId],[newREId]) ,trim(upper([name])),Report_Type,FIU_BATCH_ID
),


cte2 as (select FIUREID,SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,4) as YY,
   
  
sum(case when Report_Type='STR' and (left(fiu_Batch_id,8) between 20{Previous_month2_init:04d}01 and 20{Previous_month2_init:04d}31 )then report_count else 0  end) as STR_PM2, --{Previous_month2_init_name}
sum(case when Report_Type='STR' and (left(fiu_Batch_id,8) between 20{Previous_month1_init:04d}01 and 20{Previous_month1_init:04d}31 )then report_count else 0  end) as STR_PM1, --{Previous_month1_init_name} 
sum(case when Report_Type='STR' and (left(fiu_Batch_id,8) between 20{Previous_month_init:04d}01 and 20{Previous_month_init:04d}31 )then report_count else 0  end) as STR_PM,    --{Previous_month_init_name}
Sum(case when Report_Type='STR' and (left(fiu_Batch_id,8) between 20{Current_month_init:04d}01 and 20{Current_month_init:04d}31 )then report_count  else 0 end) as STR_CM,      --{Current_month_init_name}
                                               
                                               
sum(case when Report_Type='CTR' and (left(fiu_Batch_id,8) between 20{Previous_month2_init:04d}01 and 20{Previous_month2_init:04d}31 )then report_count  else 0 end) as CTR_PM2, --{Previous_month2_init_name}                    
sum(case when Report_Type='CTR' and (left(fiu_Batch_id,8) between 20{Previous_month1_init:04d}01 and 20{Previous_month1_init:04d}31 )then report_count else 0  end) as CTR_PM1, --{Previous_month1_init_name} 
sum(case when Report_Type='CTR' and (left(fiu_Batch_id,8) between 20{Previous_month_init:04d}01 and 20{Previous_month_init:04d}31 )then report_count  else 0 end) as CTR_PM,    --{Previous_month_init_name} 
sum(case when Report_Type='CTR' and (left(fiu_Batch_id,8) between 20{Current_month_init:04d}01 and 20{Current_month_init:04d}31 )then report_count  else 0 end) as CTR_CM,       --{Current_month_init_name}


sum(case when Report_Type='NTR' and (left(fiu_Batch_id,8) between 20{Previous_month2_init:04d}01 and 20{Previous_month2_init:04d}31 ) then report_count  else 0 end) as NTR_PM2, --{Previous_month2_init_name}                     
sum(case when Report_Type='NTR' and (left(fiu_Batch_id,8) between 20{Previous_month1_init:04d}01 and 20{Previous_month1_init:04d}31 ) then report_count  else 0 end) as NTR_PM1, --{Previous_month1_init_name}  
sum(case when Report_Type='NTR' and (left(fiu_Batch_id,8) between 20{Previous_month_init:04d}01 and 20{Previous_month_init:04d}31 ) then report_count  else 0 end) as NTR_PM,    --{Previous_month_init_name}
sum(case when Report_Type='NTR' and (left(fiu_Batch_id,8) between 20{Current_month_init:04d}01 and 20{Current_month_init:04d}31 ) then report_count  else 0 end) as NTR_CM,       --{Current_month_init_name}

                                  
sum(case when Report_Type='CBWTR' and (left(fiu_Batch_id,8) between 20{Previous_month2_init:04d}01 and 20{Previous_month2_init:04d}31 ) then report_count  else 0 end) as EFT_PM2, --{Previous_month2_init_name}                    
sum(case when Report_Type='CBWTR' and (left(fiu_Batch_id,8) between 20{Previous_month1_init:04d}01 and 20{Previous_month1_init:04d}31 ) then report_count  else 0 end) as EFT_PM1, --{Previous_month1_init_name}  
sum(case when Report_Type='CBWTR' and (left(fiu_Batch_id,8) between 20{Previous_month_init:04d}01 and 20{Previous_month_init:04d}31 ) then report_count  else 0 end) as EFT_PM,    --{Previous_month_init_name} 
sum(case when Report_Type='CBWTR' and (left(fiu_Batch_id,8) between 20{Current_month_init:04d}01 and 20{Current_month_init:04d}31 ) then report_count  else 0 end) as EFT_CM,       --{Current_month_init_name}

  
sum(case when Report_Type='CCR' and (left(fiu_Batch_id,8) between 20{Previous_month2_init:04d}01 and 20{Previous_month2_init:04d}31 ) then report_count  else 0 end) as CCR_PM2, --{Previous_month2_init_name}  
sum(case when Report_Type='CCR' and (left(fiu_Batch_id,8) between 20{Previous_month1_init:04d}01 and 20{Previous_month1_init:04d}31 ) then report_count  else 0 end) as CCR_PM1, --{Previous_month1_init_name}  
sum(case when Report_Type='CCR' and (left(fiu_Batch_id,8) between 20{Previous_month_init:04d}01 and 20{Previous_month_init:04d}31 ) then report_count  else 0 end) as CCR_PM,    --{Previous_month_init_name}
sum(case when Report_Type='CCR' and (left(fiu_Batch_id,8) between 20{Current_month_init:04d}01 and 20{Current_month_init:04d}31 ) then report_count  else 0 end) as CCR_CM,       --{Current_month_init_name}


sum(case when Report_Type='BDU' and (left(fiu_Batch_id,8) between 20{Previous_month2_init:04d}01 and 20{Previous_month2_init:04d}31 ) then report_count  else 0 end) as BDU_PM2, --{Previous_month2_init_name}
sum(case when Report_Type='BDU' and (left(fiu_Batch_id,8) between 20{Previous_month1_init:04d}01 and 20{Previous_month1_init:04d}31 ) then report_count  else 0 end) as BDU_PM1, --{Previous_month1_init_name}
sum(case when Report_Type='BDU' and (left(fiu_Batch_id,8) between 20{Previous_month_init:04d}01 and 20{Previous_month_init:04d}31 ) then report_count  else 0 end) as BDU_PM,    --{Previous_month_init_name}
sum(case when Report_Type='BDU' and (left(fiu_Batch_id,8) between 20{Current_month_init:04d}01 and 20{Current_month_init:04d}31 ) then report_count  else 0 end) as BDU_CM,       --{Current_month_init_name} 

RE_NAME
from cte1
group by FIUREID , RE_NAME , SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,4)
)

select * from cte2 '''

print(query2_o)

 December January February March


with cte1 as (
select coalesce([oldREId],[newREId]) as FIUREID,trim(upper([name])) as RE_NAME,Report_Type , LEFT(fiu_Batch_id,8) as FIU_BATCH_ID, count(distinct cp.Report_Id) report_count
from [Fincore_Bridge_DB].[FINCORE_BRIDGE].[Cps_Report_Details] cp
join [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] re (nolock) on cp.Re_Id = re.id_
where Fingate_Migrated_Data='N' and Report_Status = 'PASS' and re.active_=1
and Report_Type in  ('CTR','STR','CCR','NTR','CBWTR','BDU')
and SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,8) between 20231201 and 20240331
group by  coalesce([oldREId],[newREId]) ,trim(upper([name])),Report_Type,FIU_BATCH_ID
),


cte2 as (select FIUREID,SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,4) as YY,


sum(case when Report_Type='STR' and (left(fiu_Batch_id,8) between 20231201 and 20231231 )then report_count else 0  end) as STR_PM2, --December
sum(case when Report_Type='STR' and (left(fiu_Batch_id,8) between 20240101 and 20240131 )then report_count else 0  end) as STR_PM1, --January
sum(case when Report_Type='STR' and (left(fiu_Batch_id,8) between 20240201 and 20240231 )then report_count else 0  end) as STR_PM,    --February
Sum(case when Report_Type='STR' and (left(fiu_Batch_id,8) between 20240301 and 20240331 )then report_count  else 0 end) as STR_CM,      --March


sum(case when Report_Type='CTR' and (left(fiu_Batch_id,8) between 20231201 and 20231231 )then report_count  else 0 end) as CTR_PM2, --December
sum(case when Report_Type='CTR' and (left(fiu_Batch_id,8) between 20240101 and 20240131 )then report_count else 0  end) as CTR_PM1, --January
sum(case when Report_Type='CTR' and (left(fiu_Batch_id,8) between 20240201 and 20240231 )then report_count  else 0 end) as CTR_PM,    --February
sum(case when Report_Type='CTR' and (left(fiu_Batch_id,8) between 20240301 and 20240331 )then report_count  else 0 end) as CTR_CM,       --March


sum(case when Report_Type='NTR' and (left(fiu_Batch_id,8) between 20231201 and 20231231 ) then report_count  else 0 end) as NTR_PM2, --December
sum(case when Report_Type='NTR' and (left(fiu_Batch_id,8) between 20240101 and 20240131 ) then report_count  else 0 end) as NTR_PM1, --January
sum(case when Report_Type='NTR' and (left(fiu_Batch_id,8) between 20240201 and 20240231 ) then report_count  else 0 end) as NTR_PM,    --February
sum(case when Report_Type='NTR' and (left(fiu_Batch_id,8) between 20240301 and 20240331 ) then report_count  else 0 end) as NTR_CM,       --March


sum(case when Report_Type='CBWTR' and (left(fiu_Batch_id,8) between 20231201 and 20231231 ) then report_count  else 0 end) as EFT_PM2, --December
sum(case when Report_Type='CBWTR' and (left(fiu_Batch_id,8) between 20240101 and 20240131 ) then report_count  else 0 end) as EFT_PM1, --January
sum(case when Report_Type='CBWTR' and (left(fiu_Batch_id,8) between 20240201 and 20240231 ) then report_count  else 0 end) as EFT_PM,    --February
sum(case when Report_Type='CBWTR' and (left(fiu_Batch_id,8) between 20240301 and 20240331 ) then report_count  else 0 end) as EFT_CM,       --March


sum(case when Report_Type='CCR' and (left(fiu_Batch_id,8) between 20231201 and 20231231 ) then report_count  else 0 end) as CCR_PM2, --December
sum(case when Report_Type='CCR' and (left(fiu_Batch_id,8) between 20240101 and 20240131 ) then report_count  else 0 end) as CCR_PM1, --January
sum(case when Report_Type='CCR' and (left(fiu_Batch_id,8) between 20240201 and 20240231 ) then report_count  else 0 end) as CCR_PM,    --February
sum(case when Report_Type='CCR' and (left(fiu_Batch_id,8) between 20240301 and 20240331 ) then report_count  else 0 end) as CCR_CM,       --March


sum(case when Report_Type='BDU' and (left(fiu_Batch_id,8) between 20231201 and 20231231 ) then report_count  else 0 end) as BDU_PM2, --December
sum(case when Report_Type='BDU' and (left(fiu_Batch_id,8) between 20240101 and 20240131 ) then report_count  else 0 end) as BDU_PM1, --January
sum(case when Report_Type='BDU' and (left(fiu_Batch_id,8) between 20240201 and 20240231 ) then report_count  else 0 end) as BDU_PM,    --February
sum(case when Report_Type='BDU' and (left(fiu_Batch_id,8) between 20240301 and 20240331 ) then report_count  else 0 end) as BDU_CM,       --March

RE_NAME
from cte1
group by FIUREID , RE_NAME , SUBSTRing (cast(fiu_Batch_id as nvarchar), 1,4)
)

select * from cte2

In [185]:
Finnet2_o = pd.read_sql(query2_o,FINnet_2_engine)

In [186]:
data_2o = pd.DataFrame(Finnet2_o)
data_2o.columns = data_2o.columns.str.upper()
display("Shape : ",data_2o.shape)
display(data_2o.head(5))

'Shape : '

(1864, 27)

,FIUREID,YY,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,CTR_PM1,CTR_PM,CTR_CM,...,EFT_CM,CCR_PM2,CCR_PM1,CCR_PM,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM,RE_NAME
0,BAUCB01721,2024,0,0,0,0,0,14,1,1,...,0,0,0,0,0,0,0,0,0,URBAN CO-OPERATIVE BANK LIMITED MAINPURI
1,BASCO00014,2024,0,0,0,0,0,1022,334,353,...,0,0,0,0,0,0,0,0,0,THE KARNATAKA STATE CO-OPERATIVE APEX BANK LIM...
2,BASCB00119,2023,1,0,0,0,2,0,0,0,...,0,0,0,0,0,0,0,0,0,INDUSTRIAL BANK OF KOREA
3,BAUCB00124,2023,0,0,0,0,881,0,0,0,...,0,0,0,0,0,0,0,0,0,BARAMATI CO OP BANK LIMITED
4,BASCB00079,2023,161,0,0,0,17693,0,0,0,...,0,771,0,0,0,0,0,0,0,KOTAK MAHINDRA BANK LIMITED

In [187]:
data_2o = data_2o.drop(columns=['RE_NAME'])
data_2o

,FIUREID,YY,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,CTR_PM1,CTR_PM,CTR_CM,...,EFT_PM,EFT_CM,CCR_PM2,CCR_PM1,CCR_PM,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM
0,BAUCB01721,2024,0,0,0,0,0,14,1,1,...,0,0,0,0,0,0,0,0,0,0
1,BASCO00014,2024,0,0,0,0,0,1022,334,353,...,0,0,0,0,0,0,0,0,0,0
2,BASCB00119,2023,1,0,0,0,2,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,BAUCB00124,2023,0,0,0,0,881,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,BASCB00079,2023,161,0,0,0,17693,0,0,0,...,0,0,771,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1859,BAUCB01101,2024,0,0,0,0,0,6,4,3,...,0,0,0,0,0,0,0,0,0,0
1860,BA00046025,2024,0,0,0,0,0,0,43,29,...,0,0,0,0,0,0,0,0,0,0
1861,BAUCB01752,2024,0,16,19,53,0,487,592,813,...,0,0,0,3,5,5,0,0,0,0
1862,BA00045844,2024,0,0,0,0,0,33,0,64,...,0,0,0,0,0,0,0,0,0,0
1863,BADCB00388,2023,0,0,0,0,2228,0,0,0,...,0,0,0,0,0,0,0,0,0,0

RE Master Query

In [188]:
# query2_o_re = f'''
# select distinct oldREId as FIUREID, Upper(trim(name)) as RE_name 
# from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity] where oldREId is not null
# '''


query2_o_re = f'''
select distinct coalesce(oldREId,Newreid) as FIUREID,Upper(trim(name)) as RE_name 
from [DATAHUB_DB].[FIUMetaHub].[finnet_ReportingEntity]
where coalesce(oldREId,Newreid) is not null
'''

In [189]:
Re_name = pd.read_sql(query2_o_re,DATAHUB_engine)
df_remaster = pd.DataFrame(Re_name)
df_remaster

          FIUREID                                   RE_name
0      BA00000001                              PROD TEST RE
1      BA00000003                           TEST BANK(TEST)
2      BA00014473          SURYODAY SMALL FINANCE BANK LTD.
3      BA00015441  SHRI ADINATH CO OP BANK LTD ICHALKARANJI
4      BA00017404         NANDANI SAHAKARI BANK LTD NANDANI
...           ...                                       ...
20527  ZZZZZ00052           PAYTM PAYMENTS SERVICES LIMITED
20528  ZZZZZ00054                     INDIA TECHNOLOGY FUND
20529  ZZZZZ00055                ADVANTEDGE TECHNOLOGY FUND
20530  ZZZZZ00058     BARING PRIVATE EQUITY INDIA AIF TRUST
20531  ZZZZZ00059                 CLICBRICS INVESTMENT FUND

[20532 rows x 2 columns]

In [190]:
df_remaster.dtypes

FIUREID    object
RE_name    object
dtype: object

In [191]:
# df_remaster[df_remaster['FIUREID']=='BA00014473']

Finnet1.0 Query mssql

In [192]:
# #Defining batch range
# #Give range in format from initial month to last month i.e last month is the curret month 
# #and initial month is the last month upto which you want the report
# #last two year like -- 210912 , 221212



# Batchid_range_1_o=[str(x) for x in input('Enter Batchid range in YYMMDD format for 1.0 = ').split(',')]
# print(Batchid_range_1_o)
# Batchid_range_1_o = ','.join(Batchid_range_1_o)
# Batchid_range_1_o = Batchid_range_1_o.replace(',',' and ')
# print("Your Batchid Range is ",Batchid_range_1_o)

In [193]:
# #Defining batch range
# #Give range in format from initial month to last month i.e last month is the curret month 
# #and initial month is the last month upto which you want the report
# #last two year like -- 210912 , 221212



# Batchid_range_1_o=[str(x) for x in .split(',')]
# print(Batchid_range_1_o)
# Batchid_range_1_o = ','.join(Batchid_range_1_o)
# Batchid_range_1_o = Batchid_range_1_o.replace(',',' and ')
# print("Your Batchid Range is ",Batchid_range_1_o)

In [194]:
Batchid_range_1_o = Batchid_range_[2:6]
Batchid_range_1_o = int(Batchid_range_1_o,10) - 100
Batchid_range_1_o = str(Batchid_range_1_o)
print(Batchid_range_1_o)

2303

In [195]:
# #Batchid rang defining for range in query in latest year of finnet1.0 

# Batchid_range_1_inito1 = Batchid_range_1_o[0:7]
# Batchid_range_1_inito1=int(Batchid_range_1_inito1,10)+10000
# Batchid_range_1_inito1=Batchid_range_1_inito1.__str__()
# Batchid_range_1_lasto1 = Batchid_range_1_o[-6:]


# Batchid_range_1_init = Batchid_range_1_inito1 +' and '+ Batchid_range_1_lasto1
# print('Batchid Range for passing in latest year of finnet1.0 :',Batchid_range_1_init)

In [196]:
# #Batchid rang defining for range in query in latest - 1 year of finnet1.0 

# Batchid_range_2_inito1 = Batchid_range_1_o[0:7]
# Batchid_range_2_lasto1 = Batchid_range_1_o[-6:]
# Batchid_range_2_lasto1 = int(Batchid_range_1_lasto1,10)-10000
# Batchid_range_2_lasto1 = Batchid_range_2_lasto1.__str__()

# Batchid_range_2_init = Batchid_range_2_inito1 +' and '+ Batchid_range_2_lasto1
# print('Batchid Range for passing in latest - 1 year of finnet1.0 :',Batchid_range_2_init)

In [197]:
#Defining month for finnet1.0

Current_month_init=Batchid_range_1_o[:]
Current_month_init=int(Current_month_init,10)
Current_month_init_ = Current_month_init-100
Current_month_init_ = adjustmonth_(Current_month_init_)
print("Current  Month ",Current_month_init_)
Previous_month_init=Current_month_init_ -1
Previous_month_init = adjustmonth_(Previous_month_init)
print("Previous Month ",Previous_month_init)
Previous_month1_init= Previous_month_init-1
Previous_month1_init = adjustmonth_(Previous_month1_init)
print("Previous Month1",Previous_month1_init)
Previous_month2_init= Previous_month1_init-1
Previous_month2_init = adjustmonth_(Previous_month2_init)
print("Previous Month2",Previous_month2_init)


Current_month_last=Batchid_range_1_o[:]
Current_month_last=int(Current_month_last,10)
Current_month_last = adjustmonth_(Current_month_last)
print("Current  Month l",Current_month_last)
Previous_month_last=Current_month_last - 1
Previous_month_last = adjustmonth_(Previous_month_last)
print("Previous Month l",Previous_month_last)
Previous_month1_last= Previous_month_last - 1
Previous_month1_last = adjustmonth_(Previous_month1_last)
print("Previous Month1 l",Previous_month1_last)
Previous_month2_last=Previous_month1_last - 1
Previous_month2_last = adjustmonth_(Previous_month2_last)
print("Previous Month2 l",Previous_month2_last)

Current  Month  2203
Previous Month  2202
Previous Month1 2201
Previous Month2 2112
Current  Month l 2303
Previous Month l 2302
Previous Month1 l 2301
Previous Month2 l 2212

In [198]:
query1_o = f''' 

with cte1 as (
select Distinct b.BATCHID as BATCHID , r.RPTSERNUM as RPTSERNUM , trim(FIUREID) as FIUREID, REPORTTYPE as Report_Type ,
concat(b.batchid,'|',r.RPTSERNUM) as BRN
from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b 
inner join [Finnet_1.0].[FINCORE_BACKUP_CC].[REPORT] r on r.BATCHID = b.BATCHID
where left(b.BATCHID,6) between {Previous_month2_last}01 and {Current_month_last}31
and REPORTFORMATTYPE='ARF'
and b.batchid not in (select distinct originalbatchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH]  union select distinct batchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b2 where  batchtype ='D')
and r.is_iso = 'N'
),

cte2 as (
select Distinct b.BATCHID , rp.RPTSERNUM , trim(FIUREID) as FIUREID , REPORTTYPE , concat(b.batchid,'|',rp.RPTSERNUM) as BRN_CCR  from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b
inner join [Finnet_1.0].[FINCORE_BACKUP_CC].[CRFRPT] rp on b.BATCHID = rp.BATCHID
where left(b.BATCHID,6) between {Previous_month2_last}01 and {Current_month_last}31
and b.batchid not in (select distinct originalbatchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH]  union select distinct batchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b2 where  batchtype ='D'

)), 

cte3 as (
select Distinct b.BATCHID , tr.RPTSERNUM , trim(FIUREID) as FIUREID , REPORTTYPE , concat(b.batchid,'|',tr.RPTSERNUM) as BRN_EFT  from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b
inner join [Finnet_1.0].[FINCORE_BACKUP_CC].[TRFTRN] tr on tr.BATCHID = b.BATCHID
where left(b.BATCHID,6) between {Previous_month2_last}01 and {Current_month_last}31
and REPORTFORMATTYPE='TRF'
and b.batchid not in (select distinct originalbatchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH]  union select distinct batchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b2 where  batchtype ='D'

)) ,

cte4 as (
select * from cte1 
union
select * from cte2
union 
select * from cte3
),

cte5 as (
select  BATCHID , FIUREID, Report_Type , count(distinct BRN ) as report_count 
from cte4
--where left(batchid,4) in ({Current_month_init_:04d},{Previous_month_init:04d},{Previous_month1_init:04d},{Previous_month2_init:04d},{Current_month_last:04d},{Previous_month_last:04d},{Previous_month1_last:04d},{Previous_month2_last:04d})
group by BATCHID , FIUREID , Report_Type ) 

--select * from cte5
,

cte6 as (select FIUREID, concat('20',left(batchid,2)) as YY ,
       
sum(case when Report_Type='STR' and (left(BATCHID,4) = ('{Previous_month2_last:04d}') )then report_count  else 0 end) as STR_PM2, --{Previous_month2_init_name},                     
sum(case when Report_Type='STR' and (left(BATCHID,4) = ('{Previous_month1_last:04d}') )then report_count  else 0 end) as STR_PM1,--{Previous_month1_init_name},
sum(case when Report_Type='STR' and (left(BATCHID,4) = ('{Previous_month_last:04d}') )then report_count  else 0 end) as STR_PM,--{Previous_month_init_name},
sum(case when Report_Type='STR' and (left(BATCHID,4) = ('{Current_month_last:04d}') )then report_count  else 0 end) as STR_CM, --{Current_month_init_name}, 

  
sum(case when Report_Type='CTR' and (left(BATCHID,4) = ('{Previous_month2_last:04d}') )then report_count  else 0 end) as CTR_PM2, --{Previous_month2_init_name},      
sum(case when Report_Type='CTR' and (left(BATCHID,4) = ('{Previous_month1_last:04d}') )then report_count  else 0 end) as CTR_PM1,--{Previous_month1_init_name},
sum(case when Report_Type='CTR' and (left(BATCHID,4) = ('{Previous_month_last:04d}') )then report_count  else 0 end) as CTR_PM,--{Previous_month_init_name},
sum(case when Report_Type='CTR' and (left(BATCHID,4) = ('{Current_month_last:04d}') )then report_count  else 0 end) as CTR_CM, --{Current_month_init_name},  

                                                              
sum(case when Report_Type='NTR' and (left(BATCHID,4) = ('{Previous_month2_last:04d}') ) then report_count  else 0 end) as NTR_PM2,--{Previous_month2_init_name},                     
sum(case when Report_Type='NTR' and (left(BATCHID,4) = ('{Previous_month1_last:04d}') ) then report_count  else 0 end) as NTR_PM1,--{Previous_month1_init_name}, 
sum(case when Report_Type='NTR' and (left(BATCHID,4) = ('{Previous_month_last:04d}') ) then report_count  else 0 end) as NTR_PM,--{Previous_month_init_name},
sum(case when Report_Type='NTR' and (left(BATCHID,4) = ('{Current_month_last:04d}') ) then report_count  else 0 end) as NTR_CM, --{Current_month_init_name},

                                                          
sum(case when Report_Type='EFT' and (left(BATCHID,4) = ('{Previous_month2_last:04d}') ) then report_count  else 0 end) as EFT_PM2,--{Previous_month2_init_name},                    
sum(case when Report_Type='EFT' and (left(BATCHID,4) = ('{Previous_month1_last:04d}') ) then report_count  else 0 end) as EFT_PM1,--{Previous_month1_init_name},
sum(case when Report_Type='EFT' and (left(BATCHID,4) = ('{Previous_month_last:04d}') ) then report_count  else 0 end) as EFT_PM,--{Previous_month_init_name},
sum(case when Report_Type='EFT' and (left(BATCHID,4) = ('{Current_month_last:04d}') ) then report_count  else 0 end) as EFT_CM, --{Current_month_init_name},  


sum(case when Report_Type='CCR' and (left(BATCHID,4) = ('{Previous_month2_last:04d}') ) then report_count else 0 end) as CCR_PM2,--{Previous_month2_init_name},  
sum(case when Report_Type='CCR' and (left(BATCHID,4) = ('{Previous_month1_last:04d}') ) then report_count  else 0 end) as CCR_PM1,--{Previous_month1_init_name},  
sum(case when Report_Type='CCR' and (left(BATCHID,4) = ('{Previous_month_last:04d}') ) then report_count  else 0 end) as CCR_PM,--{Previous_month_init_name},
sum(case when Report_Type='CCR' and (left(BATCHID,4) = ('{Current_month_last:04d}') ) then report_count  else 0 end) as CCR_CM, --{Current_month_init_name},    


sum(case when Report_Type='BDU' and (left(BATCHID,4) = ('{Previous_month2_last:04d}') ) then report_count  else 0 end) as BDU_PM2,--{Previous_month2_init_name},
sum(case when Report_Type='BDU' and (left(BATCHID,4) = ('{Previous_month1_last:04d}') ) then report_count  else 0 end) as BDU_PM1,--{Previous_month1_init_name},
sum(case when Report_Type='BDU' and (left(BATCHID,4) = ('{Previous_month_last:04d}') ) then report_count  else 0 end) as BDU_PM,--{Previous_month_init_name},
sum(case when Report_Type='BDU' and (left(BATCHID,4) = ('{Current_month_last:04d}') ) then report_count  else 0 end) as BDU_CM --{Current_month_init_name}
from cte5
group by FIUREID , concat('20',left(batchid,2))
)


select * from cte6 

'''

print(query1_o)

with cte1 as (
select Distinct b.BATCHID as BATCHID , r.RPTSERNUM as RPTSERNUM , trim(FIUREID) as FIUREID, REPORTTYPE as Report_Type ,
concat(b.batchid,'|',r.RPTSERNUM) as BRN
from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b
inner join [Finnet_1.0].[FINCORE_BACKUP_CC].[REPORT] r on r.BATCHID = b.BATCHID
where left(b.BATCHID,6) between 221201 and 230331
and REPORTFORMATTYPE='ARF'
and b.batchid not in (select distinct originalbatchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH]  union select distinct batchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b2 where  batchtype ='D')
and r.is_iso = 'N'
),

cte2 as (
select Distinct b.BATCHID , rp.RPTSERNUM , trim(FIUREID) as FIUREID , REPORTTYPE , concat(b.batchid,'|',rp.RPTSERNUM) as BRN_CCR  from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b
inner join [Finnet_1.0].[FINCORE_BACKUP_CC].[CRFRPT] rp on b.BATCHID = rp.BATCHID
where left(b.BATCHID,6) between 221201 and 230331
and b.batchid not in (select distinct originalbatchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH]  union select distinct batchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b2 where  batchtype ='D'

)),

cte3 as (
select Distinct b.BATCHID , tr.RPTSERNUM , trim(FIUREID) as FIUREID , REPORTTYPE , concat(b.batchid,'|',tr.RPTSERNUM) as BRN_EFT  from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b
inner join [Finnet_1.0].[FINCORE_BACKUP_CC].[TRFTRN] tr on tr.BATCHID = b.BATCHID
where left(b.BATCHID,6) between 221201 and 230331
and REPORTFORMATTYPE='TRF'
and b.batchid not in (select distinct originalbatchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH]  union select distinct batchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b2 where  batchtype ='D'

)) ,

cte4 as (
select * from cte1
union
select * from cte2
union
select * from cte3
),

cte5 as (
select  BATCHID , FIUREID, Report_Type , count(distinct BRN ) as report_count
from cte4
--where left(batchid,4) in (2203,2202,2201,2112,2303,2302,2301,2212)
group by BATCHID , FIUREID , Report_Type )

--select * from cte5
,

cte6 as (select FIUREID, concat('20',left(batchid,2)) as YY ,

sum(case when Report_Type='STR' and (left(BATCHID,4) = ('2212') )then report_count  else 0 end) as STR_PM2, --December,
sum(case when Report_Type='STR' and (left(BATCHID,4) = ('2301') )then report_count  else 0 end) as STR_PM1,--January,
sum(case when Report_Type='STR' and (left(BATCHID,4) = ('2302') )then report_count  else 0 end) as STR_PM,--February,
sum(case when Report_Type='STR' and (left(BATCHID,4) = ('2303') )then report_count  else 0 end) as STR_CM, --March,


sum(case when Report_Type='CTR' and (left(BATCHID,4) = ('2212') )then report_count  else 0 end) as CTR_PM2, --December,
sum(case when Report_Type='CTR' and (left(BATCHID,4) = ('2301') )then report_count  else 0 end) as CTR_PM1,--January,
sum(case when Report_Type='CTR' and (left(BATCHID,4) = ('2302') )then report_count  else 0 end) as CTR_PM,--February,
sum(case when Report_Type='CTR' and (left(BATCHID,4) = ('2303') )then report_count  else 0 end) as CTR_CM, --March,


sum(case when Report_Type='NTR' and (left(BATCHID,4) = ('2212') ) then report_count  else 0 end) as NTR_PM2,--December,
sum(case when Report_Type='NTR' and (left(BATCHID,4) = ('2301') ) then report_count  else 0 end) as NTR_PM1,--January,
sum(case when Report_Type='NTR' and (left(BATCHID,4) = ('2302') ) then report_count  else 0 end) as NTR_PM,--February,
sum(case when Report_Type='NTR' and (left(BATCHID,4) = ('2303') ) then report_count  else 0 end) as NTR_CM, --March,


sum(case when Report_Type='EFT' and (left(BATCHID,4) = ('2212') ) then report_count  else 0 end) as EFT_PM2,--December,
sum(case when Report_Type='EFT' and (left(BATCHID,4) = ('2301') ) then report_count  else 0 end) as EFT_PM1,--January,
sum(case when Report_Type='EFT' and (left(BATCHID,4) = ('2302') ) then report_count  else 0 end) as EFT_PM,--February,
sum(case when Report_Type='EFT' and (left(BATCHID,4) = ('2303') ) then report_count  else 0 end) as EFT_CM, --March,


sum(case when Report_Type='CCR' and (left(BATCHID,4) = ('2212') ) then report_count else 0 end) as CCR_PM2,--December,
sum(case when Report_Type='CCR' and (left(BATCHID,4) = ('2301') ) then report_count  else 0 end) as CCR_PM1,--January,
sum(case when Report_Type='CCR' and (left(BATCHID,4) = ('2302') ) then report_count  else 0 end) as CCR_PM,--February,
sum(case when Report_Type='CCR' and (left(BATCHID,4) = ('2303') ) then report_count  else 0 end) as CCR_CM, --March,


sum(case when Report_Type='BDU' and (left(BATCHID,4) = ('2212') ) then report_count  else 0 end) as BDU_PM2,--December,
sum(case when Report_Type='BDU' and (left(BATCHID,4) = ('2301') ) then report_count  else 0 end) as BDU_PM1,--January,
sum(case when Report_Type='BDU' and (left(BATCHID,4) = ('2302') ) then report_count  else 0 end) as BDU_PM,--February,
sum(case when Report_Type='BDU' and (left(BATCHID,4) = ('2303') ) then report_count  else 0 end) as BDU_CM --March
from cte5
group by FIUREID , concat('20',left(batchid,2))
)


select * from cte6

In [199]:
query1_o2 = f''' 

with cte1 as (
select Distinct b.BATCHID as BATCHID , r.RPTSERNUM as RPTSERNUM , trim(FIUREID) as FIUREID, REPORTTYPE as Report_Type ,
concat(b.batchid,'|',r.RPTSERNUM) as BRN
from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b 
inner join [Finnet_1.0].[FINCORE_BACKUP_CC].[REPORT] r on r.BATCHID = b.BATCHID
where left(b.BATCHID,6) between {Previous_month2_init}01 and {Current_month_init_}31
and REPORTFORMATTYPE='ARF'
and b.batchid not in (select distinct originalbatchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH]  union select distinct batchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b2 where  batchtype ='D')
and r.is_iso = 'N'
),

cte2 as (
select Distinct b.BATCHID , rp.RPTSERNUM , trim(FIUREID) as FIUREID , REPORTTYPE , concat(b.batchid,'|',rp.RPTSERNUM) as BRN_CCR  from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b
inner join [Finnet_1.0].[FINCORE_BACKUP_CC].[CRFRPT] rp on b.BATCHID = rp.BATCHID
where left(b.BATCHID,6) between {Previous_month2_init}01 and {Current_month_init_}31
and b.batchid not in (select distinct originalbatchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH]  union select distinct batchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b2 where  batchtype ='D'

)), 

cte3 as (
select Distinct b.BATCHID , tr.RPTSERNUM , trim(FIUREID) as FIUREID , REPORTTYPE , concat(b.batchid,'|',tr.RPTSERNUM) as BRN_EFT  from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b
inner join [Finnet_1.0].[FINCORE_BACKUP_CC].[TRFTRN] tr on tr.BATCHID = b.BATCHID
where left(b.BATCHID,6) between {Previous_month2_init}01 and {Current_month_init_}31
and REPORTFORMATTYPE='TRF'
and b.batchid not in (select distinct originalbatchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH]  union select distinct batchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b2 where  batchtype ='D'

)) ,

cte4 as (
select * from cte1 
union
select * from cte2
union 
select * from cte3
),

cte5 as (
select BATCHID , FIUREID, Report_Type , count(distinct BRN ) as report_count 
from cte4
--where left(batchid,4) in ({Current_month_init_:04d},{Previous_month_init:04d},{Previous_month1_init:04d},{Previous_month2_init:04d},{Current_month_last:04d},{Previous_month_last:04d},{Previous_month1_last:04d},{Previous_month2_last:04d})
group by BATCHID , FIUREID , Report_Type ) 

--select * from cte5
,

cte6 as (select FIUREID,concat('20',left(batchid,2)) as YY ,
   
sum(case when Report_Type='STR' and (left(BATCHID,4) in ('{Previous_month2_init:04d}') )then report_count  else 0 end) as STR_PM2, --{Previous_month2_init_name},                     
sum(case when Report_Type='STR' and (left(BATCHID,4) in ('{Previous_month1_init:04d}') )then report_count  else 0 end) as STR_PM1,--{Previous_month1_init_name}, 
sum(case when Report_Type='STR' and (left(BATCHID,4) in ('{Previous_month_init:04d}') )then report_count  else 0 end) as STR_PM,--{Previous_month_init_name}, 
sum(case when Report_Type='STR' and (left(BATCHID,4) in ('{Current_month_init_:04d}'))then report_count  else 0 end) as STR_CM, --{Current_month_init_name},   


sum(case when Report_Type='CTR' and (left(BATCHID,4) in ('{Previous_month2_init:04d}') )then report_count  else 0 end) as CTR_PM2, --{Previous_month2_init_name},      
sum(case when Report_Type='CTR' and (left(BATCHID,4) in ('{Previous_month1_init:04d}') )then report_count  else 0 end) as CTR_PM1,--{Previous_month1_init_name},
sum(case when Report_Type='CTR' and (left(BATCHID,4) in ('{Previous_month_init:04d}') )then report_count  else 0 end) as CTR_PM,--{Previous_month_init_name},  
sum(case when Report_Type='CTR' and (left(BATCHID,4) in ('{Current_month_init_:04d}') )then report_count  else 0 end) as CTR_CM, --{Current_month_init_name},  

                      
sum(case when Report_Type='NTR' and (left(BATCHID,4) in ('{Previous_month2_init:04d}') ) then report_count  else 0 end) as NTR_PM2, --{Previous_month2_init_name},                     
sum(case when Report_Type='NTR' and (left(BATCHID,4) in ('{Previous_month1_init:04d}') ) then report_count  else 0 end) as NTR_PM1,--{Previous_month1_init_name},
sum(case when Report_Type='NTR' and (left(BATCHID,4) in ('{Previous_month_init:04d}') ) then report_count  else 0 end) as NTR_PM,--{Previous_month_init_name},                    
sum(case when Report_Type='NTR' and (left(BATCHID,4) in ('{Current_month_init_:04d}') ) then report_count  else 0 end) as NTR_CM, --{Current_month_init_name},                     

                                              
sum(case when Report_Type='EFT' and (left(BATCHID,4) in ('{Previous_month2_init:04d}') ) then report_count  else 0 end) as EFT_PM2, --{Previous_month2_init_name},                  
sum(case when Report_Type='EFT' and (left(BATCHID,4) in ('{Previous_month1_init:04d}') ) then report_count  else 0 end) as EFT_PM1,--{Previous_month1_init_name}, 
sum(case when Report_Type='EFT' and (left(BATCHID,4) in ('{Previous_month_init:04d}') ) then report_count  else 0 end) as EFT_PM,--{Previous_month_init_name},      
sum(case when Report_Type='EFT' and (left(BATCHID,4) in ('{Current_month_init_:04d}') ) then report_count  else 0 end) as EFT_CM, --{Current_month_init_name},       


sum(case when Report_Type='CCR' and (left(BATCHID,4) in ('{Previous_month2_init:04d}') ) then report_count else 0 end) as CCR_PM2, --{Previous_month2_init_name}, 
sum(case when Report_Type='CCR' and (left(BATCHID,4) in ('{Previous_month1_init:04d}') ) then report_count else 0 end) as CCR_PM1,--{Previous_month1_init_name},  
sum(case when Report_Type='CCR' and (left(BATCHID,4) in ('{Previous_month_init:04d}') ) then report_count  else 0 end) as CCR_PM,--{Previous_month_init_name},  
sum(case when Report_Type='CCR' and (left(BATCHID,4) in ('{Current_month_init_:04d}') ) then report_count  else 0 end) as CCR_CM, --{Current_month_init_name},  


sum(case when Report_Type='BDU' and (left(BATCHID,4) in ('{Previous_month2_init:04d}') ) then report_count  else 0 end) as BDU_PM2, --{Previous_month2_init_name},
sum(case when Report_Type='BDU' and (left(BATCHID,4) in ('{Previous_month1_init:04d}') ) then report_count  else 0 end) as BDU_PM1,--{Previous_month1_init_name},
sum(case when Report_Type='BDU' and (left(BATCHID,4) in ('{Previous_month_init:04d}') ) then report_count  else 0 end) as BDU_PM,--{Previous_month_init_name},
sum(case when Report_Type='BDU' and (left(BATCHID,4) in ('{Current_month_init_:04d}') ) then report_count  else 0 end) as BDU_CM --{Current_month_init_name}


from cte5
group by FIUREID , concat('20',left(batchid,2))
)


select * from cte6 

'''

print(query1_o2)

with cte1 as (
select Distinct b.BATCHID as BATCHID , r.RPTSERNUM as RPTSERNUM , trim(FIUREID) as FIUREID, REPORTTYPE as Report_Type ,
concat(b.batchid,'|',r.RPTSERNUM) as BRN
from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b
inner join [Finnet_1.0].[FINCORE_BACKUP_CC].[REPORT] r on r.BATCHID = b.BATCHID
where left(b.BATCHID,6) between 211201 and 220331
and REPORTFORMATTYPE='ARF'
and b.batchid not in (select distinct originalbatchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH]  union select distinct batchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b2 where  batchtype ='D')
and r.is_iso = 'N'
),

cte2 as (
select Distinct b.BATCHID , rp.RPTSERNUM , trim(FIUREID) as FIUREID , REPORTTYPE , concat(b.batchid,'|',rp.RPTSERNUM) as BRN_CCR  from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b
inner join [Finnet_1.0].[FINCORE_BACKUP_CC].[CRFRPT] rp on b.BATCHID = rp.BATCHID
where left(b.BATCHID,6) between 211201 and 220331
and b.batchid not in (select distinct originalbatchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH]  union select distinct batchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b2 where  batchtype ='D'

)),

cte3 as (
select Distinct b.BATCHID , tr.RPTSERNUM , trim(FIUREID) as FIUREID , REPORTTYPE , concat(b.batchid,'|',tr.RPTSERNUM) as BRN_EFT  from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b
inner join [Finnet_1.0].[FINCORE_BACKUP_CC].[TRFTRN] tr on tr.BATCHID = b.BATCHID
where left(b.BATCHID,6) between 211201 and 220331
and REPORTFORMATTYPE='TRF'
and b.batchid not in (select distinct originalbatchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH]  union select distinct batchid from [Finnet_1.0].[FINCORE_BACKUP_CC].[BATCH] b2 where  batchtype ='D'

)) ,

cte4 as (
select * from cte1
union
select * from cte2
union
select * from cte3
),

cte5 as (
select BATCHID , FIUREID, Report_Type , count(distinct BRN ) as report_count
from cte4
--where left(batchid,4) in (2203,2202,2201,2112,2303,2302,2301,2212)
group by BATCHID , FIUREID , Report_Type )

--select * from cte5
,

cte6 as (select FIUREID,concat('20',left(batchid,2)) as YY ,

sum(case when Report_Type='STR' and (left(BATCHID,4) in ('2112') )then report_count  else 0 end) as STR_PM2, --December,
sum(case when Report_Type='STR' and (left(BATCHID,4) in ('2201') )then report_count  else 0 end) as STR_PM1,--January,
sum(case when Report_Type='STR' and (left(BATCHID,4) in ('2202') )then report_count  else 0 end) as STR_PM,--February,
sum(case when Report_Type='STR' and (left(BATCHID,4) in ('2203'))then report_count  else 0 end) as STR_CM, --March,


sum(case when Report_Type='CTR' and (left(BATCHID,4) in ('2112') )then report_count  else 0 end) as CTR_PM2, --December,
sum(case when Report_Type='CTR' and (left(BATCHID,4) in ('2201') )then report_count  else 0 end) as CTR_PM1,--January,
sum(case when Report_Type='CTR' and (left(BATCHID,4) in ('2202') )then report_count  else 0 end) as CTR_PM,--February,
sum(case when Report_Type='CTR' and (left(BATCHID,4) in ('2203') )then report_count  else 0 end) as CTR_CM, --March,


sum(case when Report_Type='NTR' and (left(BATCHID,4) in ('2112') ) then report_count  else 0 end) as NTR_PM2, --December,
sum(case when Report_Type='NTR' and (left(BATCHID,4) in ('2201') ) then report_count  else 0 end) as NTR_PM1,--January,
sum(case when Report_Type='NTR' and (left(BATCHID,4) in ('2202') ) then report_count  else 0 end) as NTR_PM,--February,
sum(case when Report_Type='NTR' and (left(BATCHID,4) in ('2203') ) then report_count  else 0 end) as NTR_CM, --March,


sum(case when Report_Type='EFT' and (left(BATCHID,4) in ('2112') ) then report_count  else 0 end) as EFT_PM2, --December,
sum(case when Report_Type='EFT' and (left(BATCHID,4) in ('2201') ) then report_count  else 0 end) as EFT_PM1,--January,
sum(case when Report_Type='EFT' and (left(BATCHID,4) in ('2202') ) then report_count  else 0 end) as EFT_PM,--February,
sum(case when Report_Type='EFT' and (left(BATCHID,4) in ('2203') ) then report_count  else 0 end) as EFT_CM, --March,


sum(case when Report_Type='CCR' and (left(BATCHID,4) in ('2112') ) then report_count else 0 end) as CCR_PM2, --December,
sum(case when Report_Type='CCR' and (left(BATCHID,4) in ('2201') ) then report_count else 0 end) as CCR_PM1,--January,
sum(case when Report_Type='CCR' and (left(BATCHID,4) in ('2202') ) then report_count  else 0 end) as CCR_PM,--February,
sum(case when Report_Type='CCR' and (left(BATCHID,4) in ('2203') ) then report_count  else 0 end) as CCR_CM, --March,


sum(case when Report_Type='BDU' and (left(BATCHID,4) in ('2112') ) then report_count  else 0 end) as BDU_PM2, --December,
sum(case when Report_Type='BDU' and (left(BATCHID,4) in ('2201') ) then report_count  else 0 end) as BDU_PM1,--January,
sum(case when Report_Type='BDU' and (left(BATCHID,4) in ('2202') ) then report_count  else 0 end) as BDU_PM,--February,
sum(case when Report_Type='BDU' and (left(BATCHID,4) in ('2203') ) then report_count  else 0 end) as BDU_CM --March


from cte5
group by FIUREID , concat('20',left(batchid,2))
)


select * from cte6

Finnet1.0 Query Postgres

In [200]:
#Not required --

# query_str_finet1o =f'''
# with cte1 as (
# SELECT left(batchid,2) as YY , BATCHID , FIUREID, Reporttype , count(distinct BRN ) as report_count
# FROM str_report_5years_non_iso.str_report_1804_2305_non_iso
# where batchid between '2106010000' and '2209319999'
# and left(batchid,4) in ('2106','2107','2108','2109','2206','2207','2208','2209')
# group by left(batchid,2) , BATCHID , FIUREID, Reporttype
# ) 

# select FIUREID,YY,
# Sum(case when Reporttype='STR' and (left(BATCHID,4) in ('2109','2209'))then report_count  else 0 end )  as STR_Sep,      
# sum(case when Reporttype='STR' and (left(BATCHID,4) in ('2108','2208') )then report_count  else 0 end) as STR_Aug, 
# sum(case when Reporttype='STR' and (left(BATCHID,4) in ('2107','2207') )then report_count  else 0 end) as STR_July, 
# sum(case when Reporttype='STR' and (left(BATCHID,4) in ('2106','2206') )then report_count  else 0 end) as STR_June                     
# from cte1
# group by FIUREID , YY '''

Executing RE Master Query

Executing Finnet 1. 0 Query mssql

In [201]:
finnet1_o1 = pd.read_sql(query1_o,FINnet_1_engine1)
print('Sql Query Executed successfully')

Sql Query Executed successfully

In [202]:
finnet1_o2 = pd.read_sql(query1_o2,FINnet_1_engine1)
print('Sql Query Executed successfully')

Sql Query Executed successfully

In [203]:
# finnet1_o2.to_excel(r'C:\Users\LTIM_10693340\Desktop\Complete Monthly Report\test2.xlsx')

In [204]:
finnet1_o = pd.concat([finnet1_o1,finnet1_o2],ignore_index=True)

In [205]:
finnet1_o.columns

Index(['FIUREID', 'YY', 'STR_PM2', 'STR_PM1', 'STR_PM', 'STR_CM', 'CTR_PM2',
       'CTR_PM1', 'CTR_PM', 'CTR_CM', 'NTR_PM2', 'NTR_PM1', 'NTR_PM', 'NTR_CM',
       'EFT_PM2', 'EFT_PM1', 'EFT_PM', 'EFT_CM', 'CCR_PM2', 'CCR_PM1',
       'CCR_PM', 'CCR_CM', 'BDU_PM2', 'BDU_PM1', 'BDU_PM', 'BDU_CM'],
      dtype='object')

In [206]:
data_1_o = pd.DataFrame(finnet1_o)
display(data_1_o.head(5))
data_1_o.columns = data_1_o.columns.str.upper()
display('DATA AFTER UPPER COLUMN',data_1_o.head(5))
print('Shape of df',data_1_o.shape)

,FIUREID,YY,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,CTR_PM1,CTR_PM,CTR_CM,...,EFT_PM,EFT_CM,CCR_PM2,CCR_PM1,CCR_PM,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM
0,BAUCB01693,2022,0,0,0,0,4,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,BADCB00252,2023,0,0,0,0,0,0,0,44,...,0,0,0,0,0,0,0,0,0,0
2,BAUCB01607,2023,0,0,0,0,0,14,6,15,...,0,0,0,0,0,0,0,0,0,0
3,BASCB00076,2022,34,0,0,0,6921,0,0,0,...,0,0,14,0,0,0,0,0,0,0
4,BAUCB01422,2023,0,0,0,0,0,2,0,4,...,0,0,0,0,0,0,0,0,0,0

'DATA AFTER UPPER COLUMN'

,FIUREID,YY,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,CTR_PM1,CTR_PM,CTR_CM,...,EFT_PM,EFT_CM,CCR_PM2,CCR_PM1,CCR_PM,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM
0,BAUCB01693,2022,0,0,0,0,4,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,BADCB00252,2023,0,0,0,0,0,0,0,44,...,0,0,0,0,0,0,0,0,0,0
2,BAUCB01607,2023,0,0,0,0,0,14,6,15,...,0,0,0,0,0,0,0,0,0,0
3,BASCB00076,2022,34,0,0,0,6921,0,0,0,...,0,0,14,0,0,0,0,0,0,0
4,BAUCB01422,2023,0,0,0,0,0,2,0,4,...,0,0,0,0,0,0,0,0,0,0

Shape of df (5999, 26)

In [207]:
#filtering data in 1.0 data 
df_finnet1o_filtered =  data_1_o[data_1_o['FIUREID'].isin(data_2o['FIUREID'])]
#df_finnet1o_filtered.to_csv(r'C:\Users\SAL\Desktop\monthly_report\monthly_reportafterfilter.csv')
#print('Result downloaded to path')
df_finnet1o_filtered.shape

(2776, 26)

In [208]:
result_final = pd.concat([data_2o,df_finnet1o_filtered],ignore_index=True)
result_final["Unique"] = result_final["FIUREID"].astype(str) + "|" + result_final["YY"].astype(str)
display(result_final.head(5))
print(result_final.shape)

,FIUREID,YY,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,CTR_PM1,CTR_PM,CTR_CM,...,EFT_CM,CCR_PM2,CCR_PM1,CCR_PM,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM,Unique
0,BAUCB01721,2024,0,0,0,0,0,14,1,1,...,0,0,0,0,0,0,0,0,0,BAUCB01721|2024
1,BASCO00014,2024,0,0,0,0,0,1022,334,353,...,0,0,0,0,0,0,0,0,0,BASCO00014|2024
2,BASCB00119,2023,1,0,0,0,2,0,0,0,...,0,0,0,0,0,0,0,0,0,BASCB00119|2023
3,BAUCB00124,2023,0,0,0,0,881,0,0,0,...,0,0,0,0,0,0,0,0,0,BAUCB00124|2023
4,BASCB00079,2023,161,0,0,0,17693,0,0,0,...,0,771,0,0,0,0,0,0,0,BASCB00079|2023

(4640, 27)

In [209]:
result_final1 = result_final.groupby(['Unique']).sum()
display(result_final1.head(5))
result_final1.shape

,FIUREID,YY,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,CTR_PM1,CTR_PM,CTR_CM,...,EFT_PM,EFT_CM,CCR_PM2,CCR_PM1,CCR_PM,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM
Unique,,,,,,,,,,,,,,,,,,,,,
BA00014473|2023,BA00014473,2023,575,0,0,0,64,0,0,0,...,0,0,0,0,0,0,0,0,0,0
BA00014473|2024,BA00014473,2024,0,24,43,426,0,38,26,26,...,0,0,0,0,0,0,0,0,0,0
BA00015441|2023,BA00015441,2023,0,0,0,0,26,0,0,0,...,0,0,0,0,0,0,0,0,0,0
BA00015441|2024,BA00015441,2024,0,0,0,0,0,14,2,3,...,0,0,0,0,0,0,0,0,0,0
BA00017404|2024,BA00017404,2024,0,0,0,0,0,0,6,9,...,0,0,0,0,0,0,0,0,0,0

(3450, 26)

In [210]:
result_final1 = result_final1.reset_index()

In [211]:
result_final1[['FIUREID - 1','YY - 1']] = result_final1['Unique'].str.split("|",expand=True)

In [212]:
result_final1.drop(["Unique","FIUREID","YY"] , axis = 1 , inplace = True )

In [213]:
result_final1.rename(columns = {'FIUREID - 1':'FIUREID' , 'YY - 1':'YY'} , inplace = True)

In [214]:
df_Mapping_RE = pd.merge(result_final1,df_remaster,on = 'FIUREID',how='left' )
df_Mapping_RE.columns =  df_Mapping_RE.columns.str.upper()
display('Head',df_Mapping_RE.head(50))
display('Shape',df_Mapping_RE.shape)

'Head'

,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,CTR_PM1,CTR_PM,CTR_CM,NTR_PM2,NTR_PM1,...,CCR_PM1,CCR_PM,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM,FIUREID,YY,RE_NAME
0,575,0,0,0,64,0,0,0,21,0,...,0,0,0,0,0,0,0,BA00014473,2023,SURYODAY SMALL FINANCE BANK LTD.
1,0,24,43,426,0,38,26,26,0,1,...,0,0,0,0,0,0,0,BA00014473,2024,SURYODAY SMALL FINANCE BANK LTD.
2,0,0,0,0,26,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00015441,2023,SHRI ADINATH CO OP BANK LTD ICHALKARANJI
3,0,0,0,0,0,14,2,3,0,0,...,0,0,0,0,0,0,0,BA00015441,2024,SHRI ADINATH CO OP BANK LTD ICHALKARANJI
4,0,0,0,0,0,0,6,9,0,0,...,0,0,0,0,0,0,0,BA00017404,2024,NANDANI SAHAKARI BANK LTD NANDANI
5,0,1,0,0,0,40,17,17,0,0,...,0,0,0,0,0,0,0,BA00018889,2024,THE GUJARAT STATE CO-OPERATIVE BANK LIMITED
6,0,0,0,0,242,0,0,0,17,0,...,0,0,0,0,0,0,0,BA00018893,2023,APNA SAHAKARI BANK LIMITED
7,0,0,0,0,0,12,9,13,0,0,...,9,13,16,0,0,0,0,BA00018893,2024,APNA SAHAKARI BANK LIMITED
8,0,0,0,0,118,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00018977,2023,THE MEGHALAYA CO-OPERATIVE APEX BANK LIMITED
9,0,0,0,0,0,52,61,83,0,0,...,0,0,0,0,0,0,0,BA00018977,2024,THE MEGHALAYA CO-OPERATIVE APEX BANK LIMITED
10,3,0,0,0,8,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00019053,2023,GUJARAT AMBUJA CO-PPERATIVE BANK LIMITED
11,0,5,0,0,0,4,1,2,0,0,...,0,0,0,0,0,0,0,BA00019053,2024,GUJARAT AMBUJA CO-PPERATIVE BANK LIMITED
12,0,0,0,0,119,0,0,0,11,0,...,0,0,0,0,0,0,0,BA00019202,2023,VASAI VIKAS SAHAKARI BANK LIMITED
13,0,0,0,0,0,5,7,3,0,0,...,0,0,0,0,0,0,0,BA00019202,2024,VASAI VIKAS SAHAKARI BANK LIMITED
14,0,0,0,0,7,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00019391,2023,MALEGAON MERCHANTS CO-OP BANK LIMITED
15,0,0,0,0,0,7,3,3,0,0,...,0,0,0,0,0,0,0,BA00019391,2024,MALEGAON MERCHANTS CO-OP BANK LIMITED
16,0,0,0,0,0,5,7,1,0,0,...,0,0,0,0,0,0,0,BA00019451,2024,THE RAVER PEOPLES CO OP BANK LTD RAVER
17,0,0,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00019769,2023,KARIMNAGAR DISTRICT CO-OPERATIVE BANK LIMITED
18,269,0,0,0,3491,0,0,0,88,0,...,0,0,0,0,0,0,0,BA00019905,2023,SARASWAT COOP BANK LIMITED BOMBAY
19,0,422,1512,778,0,1568,1652,1760,0,82,...,99,120,105,0,0,0,0,BA00019905,2024,SARASWAT COOP BANK LIMITED BOMBAY
20,0,0,0,0,1011,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00019908,2023,SHIKSHAK SAHAKARI BANK LTD.
21,0,0,0,0,0,8,18,12,0,9,...,0,0,0,0,0,0,0,BA00019908,2024,SHIKSHAK SAHAKARI BANK LTD.
22,0,0,0,0,55,0,0,0,3,0,...,0,0,0,0,0,0,0,BA00020040,2023,MAHESH SAHAKARI BANK LTD PUNE
23,0,0,0,0,0,6,6,10,0,0,...,0,0,0,0,0,0,0,BA00020040,2024,MAHESH SAHAKARI BANK LTD PUNE
24,0,0,0,0,22,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00020120,2023,DHULE & NANDURBAR DIST CENT CO BANK(FORMERLY D...
25,0,0,0,0,0,21,9,16,0,0,...,0,0,0,0,0,0,0,BA00020120,2024,DHULE & NANDURBAR DIST CENT CO BANK(FORMERLY D...
26,0,0,0,0,94,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00022432,2023,GADCHIROLI DISTRICT CENTRAL CO-OPERATIVE BANK ...
27,0,0,0,0,0,18,14,19,0,0,...,0,0,0,0,0,0,0,BA00022432,2024,GADCHIROLI DISTRICT CENTRAL CO-OPERATIVE BANK ...
28,14,0,0,0,2618,0,0,0,108,0,...,0,0,0,0,0,0,0,BA00022718,2023,JAMMU AND KASHMIR BANK LIMITED
29,0,10,15,20,0,813,715,669,0,2,...,13,12,8,0,0,0,0,BA00022718,2024,JAMMU AND KASHMIR BANK LIMITED
30,0,0,0,0,0,1914,554,614,0,0,...,0,0,0,0,0,0,0,BA00022731,2024,MIZORAM RURAL BANK
31,6,0,0,0,179,0,0,0,4,0,...,0,0,0,0,0,0,0,BA00023054,2023,CITIZENS CO-OPERATIVE BANK LIMITED RAJKOT
32,0,0,0,6,0,175,173,191,0,3,...,0,0,0,0,0,0,0,BA00023054,2024,CITIZENS CO-OPERATIVE BANK LIMITED RAJKOT
33,0,0,0,0,8,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00023062,2023,CITIZEN CO-OPERATIVE BANK LIMITED NOIDA
34,0,0,0,0,0,1,8,8,0,0,...,0,0,0,0,0,0,0,BA00023062,2024,CITIZEN CO-OPERATIVE BANK LIMITED NOIDA
35,0,0,0,0,136,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00023357,2023,SIR M VISVESVARAYA CO-OPERATIVE BANK LIMITED B...
36,0,0,0,0,0,0,10,3,0,0,...,0,0,0,0,0,0,0,BA00023357,2024,SIR M VISVESVARAYA CO-OPERATIVE BANK LIMITED B...
37,0,0,0,0,0,0,13212,2571,0,0,...,0,0,0,0,0,0,0,BA00024033,2024,ANDHRA PRADESH GRAMEENA VIKAS BANK
38,0,0,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00024349,2023,JILA SAHAKARI KENDRIYA BANK MYDT PANNA
39,0,0,0,0,0,2,1,2,0,0,...,0,0,0,0,0,0,0,BA00024349,2024,JILA SAHAKARI KENDRIYA BANK MYDT PANNA
40,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00024401,2023,INDUSTRIAL AND COMMERCIAL BANK OF CHINA LIMITE...
41,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00024401,2024,INDUSTRIAL AND COMMERCIAL BANK OF CHINA LIMITE...
42,0,0,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00024558,2023,BANK OF BAHRAIN AND KUWAIT BSC
43,0,0,0,0,0,0,0,2,0,0,...,0,0,0,0,0,0,0,BA00024558,2024,BANK OF BAHRAIN AND KUWAIT BSC
44,0,0,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00024766,2023,ANGUL UNITED CENTRAL CO-OPERATIVE BANK LIMITED
45,0,0,0,0,0,0,0,25,0,0,...,0,0,0,0,0,0,0,BA00024848,2024,KODAGU DISTRICT CENTRAL CO OPERATIVE BANK LIMITED
46,0,0,0,0,0,0,868,74,0,0,...,0,0,0,0,0,0,0,BA00024878,2024,JANASEVA SAHAKARI BANK LIMITED PUNE
47,0,0,0,0,0,0,566,0,0,1,...,1,2,0,0,0,0,0,BA00025010,2024,"THE YAVATMAL URBAN CO-OPERATIVE BANK LTD., YAV..."
48,0,0,0,0,10,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00025650,2023,SONALI BANK PLC
49,0,0,0,0,0,10,0,0,0,0,...,0,0,0,0,0,0,0,BA00025650,2024,SONALI BANK PLC

'Shape'

(3450, 27)

In [215]:
# df_remaster[df_remaster.FIUREID =='VA00030987']

In [216]:
# result_final11 = pd.merge(df_Mapping_RE,df_jd,on='FIUREID',how='left' )
# result_final11.columns =  result_final11.columns.str.upper()
# display('Head',result_final11.head(2))
# display('Shape',result_final11.shape)

In [217]:
# df_Mapping_RE1 = pd.merge(result_final11,df_remaster,on = 'FIUREID',how='left' )
# df_Mapping_RE1.columns =  df_Mapping_RE1.columns.str.upper()
# display('Head',df_Mapping_RE1.head(10))
# display('Shape',df_Mapping_RE1.shape)

In [218]:
# result_final.to_excel(r"C:\Users\LTIM_10693340\Desktop\Complete Monthly Report\test211.xlsx")

In [219]:
# df_Mapping_RE = pd.merge(result_final,df_remaster,on = 'FIUREID',how='left' )
# df_Mapping_RE.columns =  df_Mapping_RE.columns.str.upper()
# display('Head',df_Mapping_RE.head(10))
# display('Shape',df_Mapping_RE.shape)
# #df_finnet1_o_reuslt.to_csv(r'C:\Users\SAL\Desktop\monthly_report\finnet1_mappingRE.csv')
# #print('Result downloaded to path')

In [220]:
# result_final = result_final.groupby(["FIUREID","YY"]).sum()
# display(result_final.head(5))
# result_final.shape

* **Mapping RE_name wrt 2.0 fiureid**

In [221]:
df_Mapping_RE = pd.merge(result_final1,df_remaster,on = 'FIUREID',how='left' )
df_Mapping_RE.columns =  df_Mapping_RE.columns.str.upper()
display('Head',df_Mapping_RE.head(5))
display('Shape',df_Mapping_RE.shape)
#df_finnet1_o_reuslt.to_csv(r'C:\Users\SAL\Desktop\monthly_report\finnet1_mappingRE.csv')
#print('Result downloaded to path')

'Head'

,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,CTR_PM1,CTR_PM,CTR_CM,NTR_PM2,NTR_PM1,...,CCR_PM1,CCR_PM,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM,FIUREID,YY,RE_NAME
0,575,0,0,0,64,0,0,0,21,0,...,0,0,0,0,0,0,0,BA00014473,2023,SURYODAY SMALL FINANCE BANK LTD.
1,0,24,43,426,0,38,26,26,0,1,...,0,0,0,0,0,0,0,BA00014473,2024,SURYODAY SMALL FINANCE BANK LTD.
2,0,0,0,0,26,0,0,0,0,0,...,0,0,0,0,0,0,0,BA00015441,2023,SHRI ADINATH CO OP BANK LTD ICHALKARANJI
3,0,0,0,0,0,14,2,3,0,0,...,0,0,0,0,0,0,0,BA00015441,2024,SHRI ADINATH CO OP BANK LTD ICHALKARANJI
4,0,0,0,0,0,0,6,9,0,0,...,0,0,0,0,0,0,0,BA00017404,2024,NANDANI SAHAKARI BANK LTD NANDANI

'Shape'

(3450, 27)

* ***Finnet 2.0 Query***

In [222]:
#filtering data in 1.0 data

In [223]:
# df_finnet1o_filtered =  df_finnet1_o_reuslt[df_finnet1_o_reuslt['FIUREID'].isin(data_2o['FIUREID'])]
# #df_finnet1o_filtered.to_csv(r'C:\Users\SAL\Desktop\monthly_report\monthly_reportafterfilter.csv')
# #print('Result downloaded to path')

In [224]:
# df_finnet1o_filtered.shape

Final Result

In [225]:
# Mapping JD Name

In [226]:
query2_o_jd = f'''
SELECT distinct coalesce(oldreid,newreid) as FIUREID , Upper(trim(JD)) as JD
  FROM [Fincore_Bridge_DB].[FINCORE_BRIDGE].[JD FIUREID MAPPING Updated - 260424]
  where coalesce(oldreid,newreid) is not null
'''

In [227]:
Finnet2_o = pd.read_sql(query2_o_jd,FINnet_2_engine)
print('Query Executed successfully')
df_jd = pd.DataFrame(Finnet2_o)
df_jd.columns = df_jd.columns.str.upper()
display("Shape : ",df_jd.shape)
display(df_jd.head(5))

Query Executed successfully

'Shape : '

(6924, 2)

      FIUREID                      JD
0  BADCB00002  SARWESHWER DUTT SHARMA
1  BADCB00004  SARWESHWER DUTT SHARMA
2  BADCB00005  SARWESHWER DUTT SHARMA
3  BADCB00007          FRANCY PEREIRA
4  BADCB00010  SARWESHWER DUTT SHARMA

In [228]:
result_final_v = pd.merge(df_Mapping_RE,df_jd,on='FIUREID',how='left' )
result_final_v.columns =  result_final_v.columns.str.upper()
display('Head',result_final_v.head(2))
display('Shape',result_final_v.shape)

'Head'

,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,CTR_PM1,CTR_PM,CTR_CM,NTR_PM2,NTR_PM1,...,CCR_PM,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM,FIUREID,YY,RE_NAME,JD
0,575,0,0,0,64,0,0,0,21,0,...,0,0,0,0,0,0,BA00014473,2023,SURYODAY SMALL FINANCE BANK LTD.,NaN
1,0,24,43,426,0,38,26,26,0,1,...,0,0,0,0,0,0,BA00014473,2024,SURYODAY SMALL FINANCE BANK LTD.,NaN

'Shape'

(3450, 28)

In [229]:
dfP3A = result_final_v
dfP3A['Grand_total'] = dfP3A['STR_CM'] + dfP3A['CTR_CM'] + dfP3A['NTR_CM'] + dfP3A['EFT_CM'] + dfP3A['CCR_CM'] + dfP3A['BDU_CM']
display(dfP3A.head(5))

,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,CTR_PM1,CTR_PM,CTR_CM,NTR_PM2,NTR_PM1,...,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM,FIUREID,YY,RE_NAME,JD,Grand_total
0,575,0,0,0,64,0,0,0,21,0,...,0,0,0,0,0,BA00014473,2023,SURYODAY SMALL FINANCE BANK LTD.,NaN,0
1,0,24,43,426,0,38,26,26,0,1,...,0,0,0,0,0,BA00014473,2024,SURYODAY SMALL FINANCE BANK LTD.,NaN,452
2,0,0,0,0,26,0,0,0,0,0,...,0,0,0,0,0,BA00015441,2023,SHRI ADINATH CO OP BANK LTD ICHALKARANJI,NaN,0
3,0,0,0,0,0,14,2,3,0,0,...,0,0,0,0,0,BA00015441,2024,SHRI ADINATH CO OP BANK LTD ICHALKARANJI,NaN,3
4,0,0,0,0,0,0,6,9,0,0,...,0,0,0,0,0,BA00017404,2024,NANDANI SAHAKARI BANK LTD NANDANI,NaN,9

In [230]:
dfP3A = dfP3A.sort_values(by = ['YY','Grand_total'] , ascending=False)
print(dfP3A.shape)
display(dfP3A.head(5))

(3450, 29)

,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,CTR_PM1,CTR_PM,CTR_CM,NTR_PM2,NTR_PM1,...,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM,FIUREID,YY,RE_NAME,JD,Grand_total
1200,0,1374,328,1794,0,1823,117433,810135,0,1093,...,4061,0,0,0,0,BASCB00071,2024,HDFC BANK LIMITED,KEERTHISHRI S,1130719
3079,0,0,12,20,0,0,48,33,0,0,...,0,0,0,445506,209321,FICSO00020,2024,VISA WORLDWIDE PTE. LTD,DR SUMIT KUMAR JHA,209374
1204,0,2388,3953,698,0,82823,81682,85218,0,3613,...,3975,0,0,0,0,BASCB00072,2024,ICICI BANK LIMITED,VELUSWAMY ILANCHELIYAN,157334
1164,0,3639,3526,2006,0,92240,91354,95305,0,0,...,520,0,0,0,0,BASCB00050,2024,STATE BANK OF INDIA,GAURAV SINGH,122964
1128,0,475,351,418,0,70945,69295,71693,0,1077,...,371,0,0,0,0,BASCB00036,2024,BANK OF BARODA,ABHINAV UJJAINIA,79853

In [231]:
dfP3A = dfP3A.reset_index()
dfP3A.head(5)

,index,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,CTR_PM1,CTR_PM,CTR_CM,NTR_PM2,...,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM,FIUREID,YY,RE_NAME,JD,Grand_total
0,1200,0,1374,328,1794,0,1823,117433,810135,0,...,4061,0,0,0,0,BASCB00071,2024,HDFC BANK LIMITED,KEERTHISHRI S,1130719
1,3079,0,0,12,20,0,0,48,33,0,...,0,0,0,445506,209321,FICSO00020,2024,VISA WORLDWIDE PTE. LTD,DR SUMIT KUMAR JHA,209374
2,1204,0,2388,3953,698,0,82823,81682,85218,0,...,3975,0,0,0,0,BASCB00072,2024,ICICI BANK LIMITED,VELUSWAMY ILANCHELIYAN,157334
3,1164,0,3639,3526,2006,0,92240,91354,95305,0,...,520,0,0,0,0,BASCB00050,2024,STATE BANK OF INDIA,GAURAV SINGH,122964
4,1128,0,475,351,418,0,70945,69295,71693,0,...,371,0,0,0,0,BASCB00036,2024,BANK OF BARODA,ABHINAV UJJAINIA,79853

In [232]:
dfP3A = dfP3A.reset_index()
dfP3A['index'] = dfP3A['level_0']+1
dfP3A = dfP3A.rename(columns={'index':'sl. no.'})
display(dfP3A)

,level_0,sl. no.,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,CTR_PM1,CTR_PM,CTR_CM,...,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM,FIUREID,YY,RE_NAME,JD,Grand_total
0,0,1,0,1374,328,1794,0,1823,117433,810135,...,4061,0,0,0,0,BASCB00071,2024,HDFC BANK LIMITED,KEERTHISHRI S,1130719
1,1,2,0,0,12,20,0,0,48,33,...,0,0,0,445506,209321,FICSO00020,2024,VISA WORLDWIDE PTE. LTD,DR SUMIT KUMAR JHA,209374
2,2,3,0,2388,3953,698,0,82823,81682,85218,...,3975,0,0,0,0,BASCB00072,2024,ICICI BANK LIMITED,VELUSWAMY ILANCHELIYAN,157334
3,3,4,0,3639,3526,2006,0,92240,91354,95305,...,520,0,0,0,0,BASCB00050,2024,STATE BANK OF INDIA,GAURAV SINGH,122964
4,4,5,0,475,351,418,0,70945,69295,71693,...,371,0,0,0,0,BASCB00036,2024,BANK OF BARODA,ABHINAV UJJAINIA,79853
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3445,3445,3446,3,0,0,0,0,0,0,0,...,0,0,0,0,0,INDPP00247,2021,KOTAK SECURITIES LIMITED,SANJOY GHOSH,0
3446,3446,3447,4,0,0,0,0,0,0,0,...,0,0,0,0,0,INOTH00048,2021,NATIONAL STOCK EXCHANGE OF INDIA LIMITED,SANJOY GHOSH,0
3447,3447,3448,0,0,0,0,0,0,0,0,...,0,0,0,0,0,INOTH00089,2021,LAKE SHORE INDIA RETAIL VENTURE FUND,SHEKHAR TRIPATHI,0
3448,3448,3449,0,0,0,0,0,0,0,0,...,0,0,0,0,0,INPOM00111,2021,TATA ASSET MANAGEMENT PRIVATE LIMITED,SANJOY GHOSH,0
3449,3449,3450,121,0,0,0,0,0,0,0,...,0,0,0,0,0,ZZZZZ00034,2021,PHONEPE PRIVATE LIMITED,VELUSWAMY ILANCHELIYAN,0

In [233]:
# dfP3A.index = dfP3A.index + 1
# print(dfP3A.shape)
# dfP3A.head(5)

In [234]:
dfP3A.columns

Index(['level_0', 'sl. no.', 'STR_PM2', 'STR_PM1', 'STR_PM', 'STR_CM',
       'CTR_PM2', 'CTR_PM1', 'CTR_PM', 'CTR_CM', 'NTR_PM2', 'NTR_PM1',
       'NTR_PM', 'NTR_CM', 'EFT_PM2', 'EFT_PM1', 'EFT_PM', 'EFT_CM', 'CCR_PM2',
       'CCR_PM1', 'CCR_PM', 'CCR_CM', 'BDU_PM2', 'BDU_PM1', 'BDU_PM', 'BDU_CM',
       'FIUREID', 'YY', 'RE_NAME', 'JD', 'Grand_total'],
      dtype='object')

In [235]:
dfP3A = dfP3A[['sl. no.','FIUREID','RE_NAME','YY','JD','STR_PM2','STR_PM1','STR_PM','STR_CM','CTR_PM2','CTR_PM1','CTR_PM','CTR_CM','NTR_PM2','NTR_PM1','NTR_PM','NTR_CM','EFT_PM2','EFT_PM1','EFT_PM','EFT_CM','CCR_PM2','CCR_PM1','CCR_PM','CCR_CM','BDU_PM2','BDU_PM1', 'BDU_PM', 'BDU_CM']]
print(dfP3A.shape)
dfP3A.head(5)

(3450, 29)

,sl. no.,FIUREID,RE_NAME,YY,JD,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,...,EFT_PM,EFT_CM,CCR_PM2,CCR_PM1,CCR_PM,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM
0,1,BASCB00071,HDFC BANK LIMITED,2024,KEERTHISHRI S,0,1374,328,1794,0,...,113883,291042,0,4082,4199,4061,0,0,0,0
1,2,FICSO00020,VISA WORLDWIDE PTE. LTD,2024,DR SUMIT KUMAR JHA,0,0,12,20,0,...,0,0,0,0,0,0,0,0,445506,209321
2,3,BASCB00072,ICICI BANK LIMITED,2024,VELUSWAMY ILANCHELIYAN,0,2388,3953,698,0,...,100253,62805,0,3574,3865,3975,0,0,0,0
3,4,BASCB00050,STATE BANK OF INDIA,2024,GAURAV SINGH,0,3639,3526,2006,0,...,29491,25133,0,621,515,520,0,0,0,0
4,5,BASCB00036,BANK OF BARODA,2024,ABHINAV UJJAINIA,0,475,351,418,0,...,7109,6240,0,320,299,371,0,0,0,0

In [236]:
dfP3A.columns

Index(['sl. no.', 'FIUREID', 'RE_NAME', 'YY', 'JD', 'STR_PM2', 'STR_PM1',
       'STR_PM', 'STR_CM', 'CTR_PM2', 'CTR_PM1', 'CTR_PM', 'CTR_CM', 'NTR_PM2',
       'NTR_PM1', 'NTR_PM', 'NTR_CM', 'EFT_PM2', 'EFT_PM1', 'EFT_PM', 'EFT_CM',
       'CCR_PM2', 'CCR_PM1', 'CCR_PM', 'CCR_CM', 'BDU_PM2', 'BDU_PM1',
       'BDU_PM', 'BDU_CM'],
      dtype='object')

In [237]:
dfP3A.head(5)

,sl. no.,FIUREID,RE_NAME,YY,JD,STR_PM2,STR_PM1,STR_PM,STR_CM,CTR_PM2,...,EFT_PM,EFT_CM,CCR_PM2,CCR_PM1,CCR_PM,CCR_CM,BDU_PM2,BDU_PM1,BDU_PM,BDU_CM
0,1,BASCB00071,HDFC BANK LIMITED,2024,KEERTHISHRI S,0,1374,328,1794,0,...,113883,291042,0,4082,4199,4061,0,0,0,0
1,2,FICSO00020,VISA WORLDWIDE PTE. LTD,2024,DR SUMIT KUMAR JHA,0,0,12,20,0,...,0,0,0,0,0,0,0,0,445506,209321
2,3,BASCB00072,ICICI BANK LIMITED,2024,VELUSWAMY ILANCHELIYAN,0,2388,3953,698,0,...,100253,62805,0,3574,3865,3975,0,0,0,0
3,4,BASCB00050,STATE BANK OF INDIA,2024,GAURAV SINGH,0,3639,3526,2006,0,...,29491,25133,0,621,515,520,0,0,0,0
4,5,BASCB00036,BANK OF BARODA,2024,ABHINAV UJJAINIA,0,475,351,418,0,...,7109,6240,0,320,299,371,0,0,0,0

In [238]:
#Summary Sheet

P0 = f'''Executive Summary-{Current_month_init_name}-{Current_Year}'''
P00 = ''
P1 = f'''Total TO_BE_UPDATED entities have been registered as new REs with the FIU-IND.'''
P2 = f'''A total of {Total_reports_count_R[0]} lakhs of reports were filed during {Current_month_init_name} 2024, including STR-{STR_COUNT_R[0]} Lakhs, CTR-{CTR_COUNT_R[0]} Lakhs, NTR-{NTR_COUNT_R[0]} Lakhs, EFT-{EFT_COUNT_R[0]} Lakhs, CCR-{CCR_COUNT_R[0]} Lakhs, and BDU-{BDU_COUNT_R[0]} Lakhs''' 
P3 = f'''{RE_NAME_MAX1} has filed maximum reports of ({RE_NAME_MAX_REPORT1} Lakhs) followed by {RE_NAME_MAX2} ({RE_NAME_MAX_REPORT2} lakhs) and {RE_NAME_MAX3} ({RE_NAME_MAX_REPORT3} lakhs)'''
P4 = f'''Out of the total {NTR_COUNT_R[0]} lakhs NTRs filed during the month, {NTR_WTH_THRESHOLD_Total_REPORTS} lakhs NTRs ({Threshold_percentage[0]}%) were filed below the reporting threshold and {NTR_WTH_WITHDRAWL_Total_REPORTS} ({Withdrawl_percentage[0]}%) NTRs were filed with withdrawal amount'''
P5 = f'''Out of the total {EFT_COUNT_R[0]} lakhs EFTs filed during the month, {EFT_BELOW_THRESHOLDS_Total_REPORTS} lakhs EFTs were filed below the reporting threshold and {EFT_Missing_Account_REPORTS} lakhs EFTs ({EFT_Missing_Account_percentage[0]}%) were filed with missing account number'''
P6 = f'''Out of the total {EFT_COUNT_R[0]} lakhs EFTs filed during the month, {EFT_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA_REPORTS} EFTs were filed where the beneficiary and sender country not India and {EFTS_WITH_MISSING_STATE_NAME_REPORTS} lakhs EFTs ({EFTS_WITH_MISSING_STATE_NAME_percentage[0]}%) were filed with missing state details'''
P7 = f'''Out of the total {EFT_COUNT_R[0]} lakhs EFTs filed during the month, {EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL_REPORTS} lakhs EFTs ({EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL_percentage[0]}%) were filed where INR and Foreign currency amounts are equal'''

################################################# CORRECT UPTO HERE ###########################################################################################################################################################################################

In [239]:
df_summary = pd.DataFrame(data = [P0,P00,P1,P2,P3,P4,P5,P6,P7])
# df_summary = df_summary.reset_index()
# df_summary['index'] = df_summary['index']+1
# df_summary = df_summary.rename(columns={'index':'sl. no.'})

df_summary
# df_summary.to_csv(r'C:\Users\LTIM_10693340\Desktop\Monthly_Report\test.csv')

                                                   0
0                         Executive Summary-March-24
1
2  Total TO_BE_UPDATED entities have been registe...
3  A total of 24.81 lakhs of reports were filed d...
4  HDFC BANK LIMITED has filed maximum reports of...
5  Out of the total 0.56 lakhs NTRs filed during ...
6  Out of the total 6.03 lakhs EFTs filed during ...
7  Out of the total 6.03 lakhs EFTs filed during ...
8  Out of the total 6.03 lakhs EFTs filed during ...

In [242]:
dfP5_d = dfP5[['FIUREID','BELOW_THRESHOLDS']]
dfP6_d = dfP6[['FIUREID','NON_RECEIPTS']]
dfP7_d = dfP7[['FIUREID','CTR','NTR','CBWTR']]
# dfP8_d = dfP8A_[['FIUREID','CTR_ABNORMALLY_COUNT']]
dfP9A_d = dfP9A[['FIUREID','EFTS_AMOUNTING_LESS_THAN_5_LAKHS']]
dfP9B_d = dfP9B[['FIUREID','ANOMALY_REPORTS']]
dfP9C_d = dfP9C[['FIUREID','EFTS_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA']]
dfP9D_d = dfP9D[['FIUREID','EFTS_WITH_MISSING_STATE_NAME']]
dfP9E_d = dfP9E[['FIUREID','EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL']]

dict1 = {'CTR':'CTR_Missing_trn','NTR':'NTR_Missing_trn','CBWTR':'CBWTR_Missing_trn'}
dict2 = {'ANOMALY_REPORTS':'EFT_Missing_Account_REPORTS'}
dfP7_d.rename(columns = dict1 ,inplace = True)
dfP9B_d.rename(columns = dict2 ,inplace = True)



df_dashboard = [dfP3,dfP5_d,dfP6_d,dfP7_d,dfP9A_d,dfP9B_d,dfP9C_d,dfP9D_d,dfP9E_d]

df_merged = reduce(lambda  left,right: pd.merge(left,right,on=['FIUREID'], how='left'), df_dashboard)
df_merged.head(5)

C:\Users\ltim_10693340\AppData\Local\Temp\ipykernel_10820\221183867.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfP7_d.rename(columns = dict1 ,inplace = True)
C:\Users\ltim_10693340\AppData\Local\Temp\ipykernel_10820\221183867.py:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfP9B_d.rename(columns = dict2 ,inplace = True)

,sl. no.,FIUREID,RE_NAME,RE_TYPE,RETYPE_DESCRIPTION,LINE_OF_BUSINESS,CAT_DESCRIPTION,FIU_JOINT_DIRECTOR,STR,CTR,...,BELOW_THRESHOLDS,NON_RECEIPTS,CTR_Missing_trn,NTR_Missing_trn,CBWTR_Missing_trn,EFTS_AMOUNTING_LESS_THAN_5_LAKHS,EFT_Missing_Account_REPORTS,EFTS_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA,EFTS_WITH_MISSING_STATE_NAME,EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL
0,1,BASCB00071,HDFC BANK LIMITED,BA,Banks,BAPVT,PRIVATE SECTOR BANKS,KEERTHISHRI S,1794,810135,...,NaN,NaN,1403.0,3.0,2.0,1723.0,16222.0,NaN,88751.0,85567.0
1,2,FICSO00020,VISA WORLDWIDE PTE. LTD,CO,Card service operator,COCSO,CARD SYSTEM OPERATORS,DR SUMIT KUMAR JHA,20,33,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,BASCB00072,ICICI BANK LIMITED,BA,Banks,BAPVT,PRIVATE SECTOR BANKS,VELUSWAMY ILANCHELIYAN,698,85218,...,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,13798.0,15863.0
3,4,BASCB00050,STATE BANK OF INDIA,BA,Banks,BAPUB,PUBLIC SECTOR BANKS,GAURAV SINGH,2006,95305,...,NaN,NaN,81.0,0.0,0.0,NaN,NaN,NaN,7464.0,7303.0
4,5,BASCB00036,BANK OF BARODA,BA,Banks,BAPUB,PUBLIC SECTOR BANKS,ABHINAV UJJAINIA,418,71693,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,667.0,49.0

# **ALL DFS**

In [243]:
dummy_df = pd.DataFrame()
print(dummy_df)

Empty DataFrame
Columns: []
Index: []

In [245]:
main_file_copy = [df_summary,dfP2,dfP3,dfP3A,dfP4,dfP5,dfP6,dfP7,dfP9A,dfP9B,dfP9C,dfP9D,dfP9E,dfP10,dfP11,dfP12,dfp13,dfp14,dfp15,dfp16,dfp17,dfp18,dfp19,dfp20,dfp21,dfp22,dfp23,dfp24,dfp25,dfp26,dfp27,dfp28,dfp29,dfp29,dfp30,dfp31,dfp32,dfp33,dummy_df,dummy_df]

In [ ]:
Output_path = f'''C://Users//ltim_10693340//Desktop//Anmol//Monthly_Report_pre_submit//MonthlyReport_{Current_month_init_name}.xlsx'''
print(Output_path)

In [255]:
#MONTHLY REPORT READER - Check 

from datetime import datetime
wb=openpyxl.load_workbook(r'\\172.20.2.200\sal\In progress\Monthly Reports\Code\Template\MonthlyReport_Final_Template - 030552024.xlsx')
i=0
for ws in wb.worksheets:
    wb.active = 1
    df=main_file_copy[i]
    #print(df)
    i=i+1
    rows=dataframe_to_rows(df,index=False,header=False)
    for r_idx,row in enumerate(rows,8):
        #print(i)
        for c_idx,value in enumerate(row,1):
            ws.cell(row=r_idx,column=c_idx,value=value)
wb.save(Output_path)

NameError: name 'Output_path' is not defined

In [204]:
main_file = [df_summary,dfP2,dfP3,dfP3A,dfP4,dfP5,dfP6,dfP7,dfP8,dfP9A,dfP9B,dfP9C,dfP9D,dfP9E,dummy_df,dummy_df]

In [205]:
# main_file = [dfP2,dfP3,dfP4,dfP5,dfP6,dfP7,dfP8,dfP9A,dfP9B,dfP9C,dfP9D,dfP9E]

In [206]:
# main_file1=[dfP2,dfP4,dfP5,dfP6]

In [207]:
# main_file1[dfP2]

In [208]:
Output_path = f'''C://Users//ltim_10693340//Desktop//Anmol//Monthly_Report_pre_submit//MonthlyReport_{Current_month_init_name}.xlsx'''
print(Output_path)

C://Users//ltim_10693340//Desktop//Anmol//Monthly_Report_pre_submit//MonthlyReport_March.xlsx

In [209]:
# Output_path = r'C:\Users\LTIM_10693340\Desktop\Monthly_Report\MonthlyReport_Final_Template.xlsx'

In [210]:
#MONTHLY REPORT READER

from datetime import datetime
wb=openpyxl.load_workbook(r'C:\Users\ltim_10693340\Desktop\Anmol\Template\MonthlyReport_Final_Template - 030552024.xlsx')
i=0
for ws in wb.worksheets:
    wb.active = 1
    df=main_file[i]
    #print(df)
    i=i+1
    rows=dataframe_to_rows(df,index=False,header=False)
    for r_idx,row in enumerate(rows,8):
        #print(i)
        for c_idx,value in enumerate(row,1):
            ws.cell(row=r_idx,column=c_idx,value=value)
wb.save(Output_path)

In [215]:
Output_path = f'''C://Users//ltim_10693340//Desktop//Anmol//Monthly_Report_pre_submit//MonthlyReport_{Current_month_init_name}_Dashboard.xlsx'''
print(Output_path)
df_merged.to_excel(Output_path)

C://Users//ltim_10693340//Desktop//Anmol//Monthly_Report_pre_submit//MonthlyReport_March_Dashboard.xlsx

In [ ]:

# main_file_dashboard = [dummy_df,df_merged,dummy_df,dummy_df,dummy_df,dummy_df,dummy_df,dummy_df,dummy_df,dummy_df,dummy_df,dummy_df,dummy_df,dummy_df]


# # MONTHLY REPORT DASHBOARD

# from datetime import datetime
# wb=openpyxl.load_workbook(r'C:\Users\LTIM_10693340\Desktop\Template\MonthlyReport Dec 23 - For Dashboard_210324 -2 - Final.xlsx' , data_only = 'True')
# i=0
# for ws in wb.worksheets:
#     wb.active = 1
#     df=main_file[i]
#     #print(df)
#     i=i+1
#     rows=dataframe_to_rows(df,index=False,header=False)
#     for r_idx,row in enumerate(rows,8):
#         #print(i)
#         for c_idx,value in enumerate(row,1):
#             ws.cell(row=r_idx,column=c_idx,value=value)
# wb.save(Output_path)

In [ ]:
month_date = {
    '01': "31",
    '02': "29",
    '03': "31",
    '04': "30",
    '05': "31",
    '06': "30",
    '07': "31",
    '08': "31",
    '09': "30",
    '10': "31",
    '11': "30",
    '12': "31"
}

In [202]:
# MAIN SHEET CREATION


M0 = f'''Monthly Report - {Current_month_init_name} 20{Current_Year}'''
M1 = f'''The primary objective of the study is to generate a monthly report containing statistics and analysis based on the below-listed pointers.'''
M2 = f'''A total of {Total_reports_count_R[0]} lakhs of reports were filed during {Current_month_init_name} 2024, including STR-{STR_COUNT_R[0]} Lakhs, CTR-{CTR_COUNT_R[0]} Lakhs, NTR-{NTR_COUNT_R[0]} Lakhs, EFT-{EFT_COUNT_R[0]} Lakhs, CCR-{CCR_COUNT_R[0]} Lakhs, and BDU-{BDU_COUNT_R[0]} Lakhs''' 
M3 = f'''{RE_NAME_MAX1} has filed maximum reports of ({RE_NAME_MAX_REPORT1} Lakhs) followed by {RE_NAME_MAX2} ({RE_NAME_MAX_REPORT2} lakhs) and {RE_NAME_MAX3} ({RE_NAME_MAX_REPORT3} lakhs)'''





P00 = ''
P1 = f'''Total TO_BE_UPDATED entities have been registered as new REs with the FIU-IND.'''
P2 = f'''A total of {Total_reports_count_R[0]} lakhs of reports were filed during {Current_month_init_name} 2024, including STR-{STR_COUNT_R[0]} Lakhs, CTR-{CTR_COUNT_R[0]} Lakhs, NTR-{NTR_COUNT_R[0]} Lakhs, EFT-{EFT_COUNT_R[0]} Lakhs, CCR-{CCR_COUNT_R[0]} Lakhs, and BDU-{BDU_COUNT_R[0]} Lakhs''' 
P3 = f'''{RE_NAME_MAX1} has filed maximum reports of ({RE_NAME_MAX_REPORT1} Lakhs) followed by {RE_NAME_MAX2} ({RE_NAME_MAX_REPORT2} lakhs) and {RE_NAME_MAX3} ({RE_NAME_MAX_REPORT3} lakhs)'''
P4 = f'''Out of the total {NTR_COUNT_R[0]} lakhs NTRs filed during the month, {NTR_WTH_THRESHOLD_Total_REPORTS} lakhs NTRs ({Threshold_percentage[0]}%) were filed below the reporting threshold and {NTR_WTH_WITHDRAWL_Total_REPORTS} ({Withdrawl_percentage[0]}%) NTRs were filed with withdrawal amount'''
P5 = f'''Out of the total {EFT_COUNT_R[0]} lakhs EFTs filed during the month, {EFT_BELOW_THRESHOLDS_Total_REPORTS} lakhs EFTs were filed below the reporting threshold and {EFT_Missing_Account_REPORTS} lakhs EFTs ({EFT_Missing_Account_percentage[0]}%) were filed with missing account number'''
P6 = f'''Out of the total {EFT_COUNT_R[0]} lakhs EFTs filed during the month, {EFT_WITH_SENDER_AND_BENEFICIARY_COUNTRY_NOT_INDIA_REPORTS} EFTs were filed where the beneficiary and sender country not India and {EFTS_WITH_MISSING_STATE_NAME_REPORTS} lakhs EFTs ({EFTS_WITH_MISSING_STATE_NAME_percentage[0]}%) were filed with missing state details'''
P7 = f'''Out of the total {EFT_COUNT_R[0]} lakhs EFTs filed during the month, {EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL_REPORTS} lakhs EFTs ({EFTS_WITH_BOTH_INR_AND_FOREIGN_CURRENCY_EQUAL_percentage[0]}%) were filed where INR and Foreign currency amounts are equal'''

################################################# CORRECT UPTO HERE ###########################################################################################################################################################################################

In [6]:
df = pd.read_excel(r'\\172.20.2.200\sal\In progress\Monthly Reports\Code\Template\MonthlyReport_Final_Template - 030552024.xlsx')

KeyError: 1